
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ДатаВремя.Доступность = ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Кадровик")или РольДоступна("ПолныеПрава");
	Элементы.ОсновнойОтпуск.Доступность = ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Кадровик")или РольДоступна("ПолныеПрава");
	Элементы.ПериодЗаКоторыйПредоставляетсяОтпуск.Доступность = ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Кадровик")или РольДоступна("ПолныеПрава");
КонецПроцедуры

