
//&После("ПриЗаполненииРазделовДатЗапретаИзменения")
//Процедура ВИЛС_ПриЗаполненииРазделовДатЗапретаИзменения(Разделы)
//    Раздел = Разделы.Добавить();
//    Раздел.Имя  = "Заказы";
//    Раздел.Идентификатор = Новый УникальныйИдентификатор("169aa428-01ac-11e8-aa82-0050568f22ce");
//    Раздел.Представление = НСтр("ru = 'Заказы';
//								|en = 'Orders '");
//КонецПроцедуры             

//&После("ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения")
//Процедура ВИЛС_ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных)
//	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", "Дата", "Заказы", "");
//КонецПроцедуры
