
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если  Элементы.Найти("ВИЛС_Наименование") = Неопределено Тогда
		ЭлементФормы = Элементы.Вставить("ВИЛС_Наименование",Тип("ПолеФормы"),Элементы.Серии,Элементы.СерииНомер);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.Заголовок = "Наименование";
		ЭлементФормы.ПутьКДанным = "Объект.Серии.Серия.Наименование";
	КонецЕсли;
	Если Элементы.Найти("ВИЛС_Наименование_Остатки")  = Неопределено Тогда
		ЭлементФормы = Элементы.Вставить("ВИЛС_Наименование_Остатки",Тип("ПолеФормы"),Элементы.ОстаткиСерий,Элементы.ОстаткиСерийНомер);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.Заголовок = "Наименование";
		ЭлементФормы.ПутьКДанным = "ОстаткиСерий.Серия.Наименование";
	КонецЕсли;
КонецПроцедуры
