
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заказ = Параметры.Основание;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.КодСтроки КАК КлючСвязи,
	|	ЗаказКлиентаТовары.Серия КАК Серия
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказДавальцаПродукция.Номенклатура,
	|	ЗаказДавальцаПродукция.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказДавальцаПродукция.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказДавальцаПродукция.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказДавальцаПродукция.Упаковка
	|	КОНЕЦ,
	|	ЗаказДавальцаПродукция.КоличествоУпаковок,
	|	ЗаказДавальцаПродукция.Количество,
	|	ЗаказДавальцаПродукция.Цена,
	|	ЗаказДавальцаПродукция.Ссылка.СтавкаНДС,
	|	ЗаказДавальцаПродукция.КодСтроки,
	|	ЗаказДавальцаПродукция.Серия
	|ИЗ
	|	Документ.ЗаказДавальца.Продукция КАК ЗаказДавальцаПродукция
	|ГДЕ
	|	ЗаказДавальцаПродукция.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование",Заказ);
	ОстаткиИзЗаказа.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВСчет(Команда)
	ЭтаФорма.Закрыть();
	СтруктураПереноса = СобратьСтруктуру();
	ОповеститьОВыборе(СтруктураПереноса);
	
КонецПроцедуры

&НаСервере
Функция СобратьСтруктуру()
	
	ПереносимаяНоменклатура = Новый Массив;
	Колонки = ОстаткиИзЗаказа.Выгрузить().Колонки;
	Для Каждого СтрокаТЧ Из ОстаткиИзЗаказа Цикл 
		СтруктураСтроки = Новый Структура();
		Для Каждого Колонка Из Колонки Цикл
			
			ИмяКолонки = Колонка.Имя;
			СтруктураСтроки.Вставить(ИмяКолонки,СтрокаТЧ[ИмяКолонки]);
			
		КонецЦикла;  
		ПереносимаяНоменклатура.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ПереносимаяНоменклатура;	
КонецФункции

&НаКлиенте
Процедура ОстаткиИзЗаказаКоличествоУпаковокПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОстаткиИзЗаказа.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		ТекДанные.Количество = ТекДанные.КоличествоУпаковок;
	КонецЕсли;
	
	
КонецПроцедуры
