
&После("ПередЗаписью")
Процедура ВИЛС_ПередЗаписью(Отказ)
	
	ЗначениеПеречисленияВзносы = ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией;
	ИмяПеречисленияВзносы = ЗначениеПеречисленияВзносы.Метаданные().Имя;
	ИндексЗначенияПеречисленияВзносы = Перечисления[ИмяПеречисленияВзносы].Индекс(ЗначениеПеречисленияВзносы);
	ИмяЗначенияПеречисления = ?(Метаданные.Перечисления[ИмяПеречисленияВзносы].ЗначенияПеречисления[ИндексЗначенияПеречисленияВзносы].Имя="ПодземныеИВредныеРаботы","Пункт 1","Пункт 2");
	ПредставлениеОДН = ?(ЗначениеЗаполнено(ОснованиеДосрочногоНазначенияПенсии),"("+СокрЛП(ОснованиеДосрочногоНазначенияПенсии.Код)+")","");
	Наименование = ""+ИмяЗначенияПеречисления+", "+СокрЛП(КодПозицииСпискаПФР.Код)+""+ПредставлениеОДН;
	
КонецПроцедуры
