// begin fix Suetin 23.08.2019 15:34:36 Если в списке выбора несколько КПП, очищаем КПП, пускай выбирают вручную, т.к. Грузополучатель только в заказе, а туда идти далеко...
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() 
		и ЗначениеЗаполнено(Объект.Контрагент)
		и ЗначениеЗаполнено(Объект.КППКонтрагента) Тогда
		Если Не СписокВыбораКПП.Количество() Тогда
			ЗаполнитьСписокВыбораКПП(СписокВыбораКПП, Объект.Контрагент, Объект.Дата);
		КонецЕсли;
		Если СписокВыбораКПП.Количество() > 1 Тогда
			Объект.КППКонтрагента = "";
			Выставлен = Ложь;
			ВыставленПриИзмененииНаСервере();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
// end fix Suetin 23.08.2019 15:53:28

// begin fix Suetin 10.03.2020 13:27:16 Если ЮрЛицо, добавляем проверку на заполненность КПП Контрагента
&НаСервере
Процедура ВИЛС_ОбработкаПроверкиЗаполненияНаСервереПеред(Отказ, ПроверяемыеРеквизиты)
//#Вставка
	Если Объект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо 
		и Не ЗначениеЗаполнено(Объект.КППКонтрагента) Тогда
		Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = "Не указан КПП контрагента!";
	    Сообщение.Поле = "Объект.КППКонтрагента";
	    Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
//#КонецВставки
КонецПроцедуры


&НаКлиенте
Процедура ВИЛС_ДатаПриИзмененииПосле(Элемент)
	ОбъектДата = НачалоДня(Объект.Дата);
	Если Не Объект.ДатаВыставления = ОбъектДата Тогда
		 Объект.ДатаВыставления = ОбъектДата;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		 	НСтр("ru ='Дата выставления установлена в соответствии с Датой документа.'"),, "Выставлен");
	КонецЕсли;
КонецПроцедуры
// end fix Suetin 10.03.2020 13:27:19
