
&НаКлиенте
&ИзменениеИКонтроль("ПослеДобавленияКодовИзКлассификатора")
Процедура ВИЛС_ПослеДобавленияКодовИзКлассификатора(Результат, ДополнительныеПараметры)

	Если Результат <> Неопределено Тогда

		Объект.ОКПДТРКод		 = Результат.ОКПДТРКод;
		Объект.ОКПДТРКЧ			 = Результат.ОКПДТРКЧ;
		Объект.ОКПДТРКатегория	 = Результат.ОКПДТРКатегория;

#Удаление
		Если ЗначениеЗаполнено(Результат.ОКЗКод) Тогда
			Объект.КодПоОКЗ = ЗначениеОКЗПоКоду(Результат.ОКЗКод);
		Иначе
			Объект.КодПоОКЗ = Неопределено;
		КонецЕсли;
#КонецУдаления
#Вставка
		// Здесь заполняем и наименование элемента справочника Ticket#8221319.
		Если ЗначениеЗаполнено(Результат.ОКЗКод) Тогда
	    	ЗнОКЗ = ВИЛС_ЗначениеОКЗПоКоду(Результат.ОКЗКод);
			Объект.КодПоОКЗ 	= ЗнОКЗ.КодПоОКЗ;
			Объект.Наименование = ЗнОКЗ.НаименованиеГруппЗанятий;
		Иначе
			Объект.КодПоОКЗ 	= Неопределено;
			Объект.Наименование = "";
		КонецЕсли;
#КонецВставки

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_КодПоОКЗПриИзмененииПосле(Элемент)
	Если ЗначениеЗаполнено(Объект.КодПоОКЗ) Тогда
		ЗнОКЗ = ВИЛС_ЗначениеОКЗПоКоду(Объект.КодПоОКЗ);
		Объект.Наименование = ЗнОКЗ.НаименованиеГруппЗанятий;
	Иначе
		Объект.Наименование = "";
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВИЛС_ЗначениеОКЗПоКоду(Знач КодОКЗ)
	Если ТипЗнч(КодОКЗ) = Тип("Строка") Тогда
		КодОКЗ = Справочники.КлассификаторЗанятий.НайтиПоКоду(КодОКЗ);
	КонецЕсли; 
	
	Возврат Новый Структура("КодПоОКЗ,НаименованиеГруппЗанятий",КодОКЗ.Ссылка,КодОКЗ.НаименованиеГруппЗанятий);
КонецФункции
