
// Функция формирует таблицу партий производства.
//
// Параметры:
//	Параметры - Структура - Структура отборов.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица партий производства.
//
&ИзменениеИКонтроль("ПартииПроизводстваДляРаспределенияЗатрат")
Функция ВИЛС_ПартииПроизводстваДляРаспределенияЗатрат(Отборы) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
//++ НЕ УТКА
	ПараметрыЗапроса = ОписаниеПараметровПолученияАктивныхПартий();
	ПараметрыЗапроса.НачалоПериода = Отборы.НачалоПериода;
	ПараметрыЗапроса.ОкончаниеПериода = Отборы.ОкончаниеПериода;
	ПараметрыЗапроса.Организации = ОбщегоНазначенияУТКлиентСервер.Массив(Отборы.Организация);
	
	ПоместитьАктивныеПартииБезСпецификаций(ПараметрыЗапроса, МенеджерВременныхТаблиц);
//-- НЕ УТКА
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"
//++ НЕ УТКА
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Реквизиты.ПартияПроизводства	КАК ПартияПроизводства,
	|	ИСТИНА							КАК ЕстьВыпускПродукции
	|ПОМЕСТИТЬ ЭтапыСВыпуском
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК Изделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|			ПО Изделия.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
	|	И Реквизиты.Проведен
	|	И Изделия.Произведено
	|	И НЕ Изделия.Отменено
	|	И Изделия.ДатаПроизводства МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Реквизиты.ПартияПроизводства	КАК ПартияПроизводства,
	|	ИСТИНА							КАК ЕстьВыпускПродукции
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК Изделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|			ПО Изделия.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
	|	И Реквизиты.Проведен
	|	И Изделия.Произведено
	|	И НЕ Изделия.Отменено
	|	И Изделия.ДатаПроизводства МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеквизитыЭтапа.ПартияПроизводства	КАК ПартияПроизводства,
	|	ИСТИНА								КАК ЕстьВыпускПродукции
	|ИЗ
	|	Документ.ОтчетПереработчика.Продукция КАК Изделия
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК РеквизитыЭтапа
	|			ПО РеквизитыЭтапа.Ссылка = Изделия.ЭтапПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК Реквизиты
	|			ПО Изделия.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И Реквизиты.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства
	|
	|;
	|
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Этап,
	|	Реквизиты.Подразделение КАК Подразделение,
	|	Реквизиты.ПартияПроизводства КАК ПартияПроизводства,
	|	Реквизиты.ТипПроизводственногоПроцесса
	|ПОМЕСТИТЬ ЭтапыТекущегоПериода
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.ФактическоеНачалоЭтапа <= &ОкончаниеПериода
	|	И (Реквизиты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	|		ИЛИ Реквизиты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
	|			И Реквизиты.ФактическоеОкончаниеЭтапа >= &НачалоПериода)
	|;
	|
	//-- НЕ УТКА
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрПартииПроизводства.Ссылка							КАК ПартияПроизводства,
	|	ДанныеДокумента.Подразделение							КАК Подразделение,
	|	ДанныеДокумента.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация						КАК Спецификация,
	|	СпрПартииПроизводства.Назначение						КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО											КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ													КАК ЭтапТекущегоМесяца,
	|	ИСТИНА													КАК ЕстьВыпускПродукции,
	|	ЛОЖЬ													КАК ПроизводствоНаСтороне
	|ПОМЕСТИТЬ ВтЭтапы
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ТаблицаВыходныеИзделия.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = ТаблицаВыходныеИзделия.Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаВыходныеИзделия.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(ДобавитьКДате(&ОкончаниеПериода, МЕСЯЦ, 1), МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктивныеПартии.ПартияПроизводства 			КАК ПартияПроизводства,
	|	ЕСТЬNULL(Этапы.Подразделение,
	|		ЗаказНаПроизводство.Подразделение) 		КАК Подразделение,
	|	ЕСТЬNULL(Этапы.Этап, 
	|		НЕОПРЕДЕЛЕНО)							КАК Этап,
	|	РеквизитыПП.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	РеквизитыПП.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	РеквизитыПП.Спецификация					КАК Спецификация,
	|	РеквизитыПП.Назначение						КАК Назначение,
	|	РеквизитыПП.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	ЗаказНаПроизводство.Ссылка 					КАК ЗаказНаПроизводство,
	|	ИСТИНА										КАК ЭтапТекущегоМесяца,
	|	ЛОЖЬ										КАК ЕстьВыпускПродукции,
	|	ЛОЖЬ										КАК ПроизводствоНаСтороне
	|ИЗ
	|	АктивныеПартии КАК АктивныеПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
	|		ПО АктивныеПартии.ПартияПроизводства = ЗаказНаПроизводство.ПартияПроизводства
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК РеквизитыПП
	|		ПО РеквизитыПП.Ссылка = АктивныеПартии.ПартияПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТекущегоПериода КАК Этапы
	|		ПО АктивныеПартии.ПартияПроизводства = Этапы.ПартияПроизводства
	|			И Этапы.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыПП.Ссылка							КАК ПартияПроизводства,
	|	Реквизиты.Подразделение						КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ДетализироватьПоЭтапам
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ										КАК Этап,
	|	РеквизитыПП.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	РеквизитыПП.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	РеквизитыПП.Спецификация					КАК Спецификация,
	|	РеквизитыПП.Назначение						КАК Назначение,
	|	РеквизитыПП.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	Реквизиты.Распоряжение						КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА &НачалоПериода МЕЖДУ Реквизиты.ФактическоеНачалоЭтапа И Реквизиты.ФактическоеОкончаниеЭтапа
	|				ИЛИ &НачалоПериода >= Реквизиты.ФактическоеНачалоЭтапа
	|					И Реквизиты.ФактическоеОкончаниеЭтапа = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &ОкончаниеПериода МЕЖДУ Реквизиты.ФактическоеНачалоЭтапа И Реквизиты.ФактическоеОкончаниеЭтапа
	|				ИЛИ &ОкончаниеПериода >= Реквизиты.ФактическоеНачалоЭтапа
	|					И Реквизиты.ФактическоеОкончаниеЭтапа = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &НачалоПериода <= Реквизиты.ФактическоеНачалоЭтапа
	|					И &ОкончаниеПериода >= Реквизиты.ФактическоеОкончаниеЭтапа
	|				ИЛИ Реквизиты.ПроизводствоНаСтороне И ЕСТЬNULL(ЭтапыСВыпуском.ЕстьВыпускПродукции, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ												КАК ЭтапТекущегоМесяца,
	|	ЕСТЬNULL(ЭтапыСВыпуском.ЕстьВыпускПродукции, ЛОЖЬ)	КАК ЕстьВыпускПродукции,
	|	Реквизиты.ПроизводствоНаСтороне						КАК ПроизводствоНаСтороне
	|ИЗ
	|	ЭтапыТекущегоПериода КАК ЭтапыТекущегоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|		ПО ЭтапыТекущегоПериода.Этап = Реквизиты.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК РеквизитыПП
	|		ПО РеквизитыПП.Ссылка = Реквизиты.ПартияПроизводства

	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыСВыпуском КАК ЭтапыСВыпуском
	|		ПО ЭтапыСВыпуском.ПартияПроизводства = Реквизиты.ПартияПроизводства
	|ГДЕ
	|	НЕ ЭтапыТекущегоПериода.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)
//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	Реквизиты.Подразделение								КАК Подразделение,
	|	Реквизиты.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура	КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация					КАК Спецификация,
	|	СпрПартииПроизводства.Назначение					КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО										КАК ЗаказНаПроизводство,
	|	ИСТИНА												КАК ЭтапТекущегоМесяца,
	|	ИСТИНА												КАК ЕстьВыпускПродукции,
	|	ИСТИНА												КАК ПроизводствоНаСтороне
	|ИЗ
	|	Документ.ОтчетПереработчика КАК Реквизиты
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ТаблицаТовары
	|		ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = ТаблицаТовары.Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.ГруппировкаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтапТекущегоМесяца,
	|	Подразделение,
	|	Назначение,
	|	НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.Подразделение,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.ЭтапТекущегоМесяца
#Вставка	
	//begin fix Клещ А.Н. 07.05.2019  
	|	,ВтЭтапы.Этап КАК ВИЛС_ЭтапПроизводства
	//end fix Клещ А.Н. 07.05.2019
#КонецВставки	
	|ИЗ
	|	ВтЭтапы КАК ВтЭтапы
	|ГДЕ
	|	(ВтЭтапы.ЭтапТекущегоМесяца
	|			ИЛИ &ЭтапыЗаВесьПериод)
	|	И (ВтЭтапы.Подразделение = &Подразделение
	|			ИЛИ &ВсеПодразделения)
	|	И (ВтЭтапы.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|			ИЛИ &ВсеЗаказыНаПроизводство)
	|	И (ВтЭтапы.Назначение = &Назначение
	|			ИЛИ &ВсеНазначения)
	|	И (ВтЭтапы.НаправлениеДеятельности = &НаправлениеДеятельности
	|			ИЛИ &ВсеНаправленияДеятельности)
	|	И (ВтЭтапы.ЕстьВыпускПродукции
	|			ИЛИ НЕ &ТолькоЭтапыСВыпуском)
	|	И (НЕ ВтЭтапы.ПроизводствоНаСтороне
	|			ИЛИ НЕ &ИсключатьПроизводствоНаСтороне)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.ЭтапТекущегоМесяца,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.Подразделение";
	
	Подразделение	= Неопределено;
	Назначение		= Неопределено;
	ЗаказНаПроизводство = Неопределено;

	НаправлениеДеятельности = Неопределено;
	ТолькоЭтапыСВыпуском = Отборы.Свойство("ТолькоЭтапыСВыпуском") И Отборы.ТолькоЭтапыСВыпуском;
	ИсключатьПроизводствоНаСтороне = Отборы.Свойство("ИсключатьПроизводствоНаСтороне") И Отборы.ИсключатьПроизводствоНаСтороне;
	
	Отборы.Свойство("Подразделение",           Подразделение);
	Отборы.Свойство("Назначение",              Назначение);

	Отборы.Свойство("ЗаказНаПроизводство",     ЗаказНаПроизводство);
	Отборы.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	
	Запрос.УстановитьПараметр("НачалоПериода",                Отборы.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",             Отборы.ОкончаниеПериода);
	
	Запрос.УстановитьПараметр("Организация",                  Отборы.Организация);
	Запрос.УстановитьПараметр("ДетализироватьПоЭтапам",       Отборы.ДетализироватьПоЭтапам);
	Запрос.УстановитьПараметр("ЭтапыЗаВесьПериод",            НЕ Отборы.ТолькоТекущийМесяц);
	
	Запрос.УстановитьПараметр("Подразделение",                Подразделение);
	Запрос.УстановитьПараметр("ВсеПодразделения",             Не ЗначениеЗаполнено(Подразделение));
	
	Запрос.УстановитьПараметр("Назначение",                   Назначение);
	Запрос.УстановитьПараметр("ВсеНазначения",                Не ЗначениеЗаполнено(Назначение));

	Запрос.УстановитьПараметр("ЗаказНаПроизводство",          ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("ВсеЗаказыНаПроизводство",      Не ЗначениеЗаполнено(ЗаказНаПроизводство));
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности",      НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ВсеНаправленияДеятельности",   Не ЗначениеЗаполнено(НаправлениеДеятельности));
	
	Запрос.УстановитьПараметр("ТолькоЭтапыСВыпуском",           ТолькоЭтапыСВыпуском);
	Запрос.УстановитьПараметр("ИсключатьПроизводствоНаСтороне", ИсключатьПроизводствоНаСтороне);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства")
Функция ВИЛС_ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                КАК Таблица,
	|	ДД.Содержание                             КАК Содержание,
	|	ДД.ТипЗатрат                              КАК ТипЗатрат,
	|	ДД.ВидЗатрат                              КАК ВидЗатрат,
	|	ДД.Организация                            КАК Организация,
	|	ДД.Подразделение                          КАК Подразделение,
	|	ДД.ПодразделениеОтправитель               КАК ПодразделениеОтправитель,
	|	ДД.Регистратор                            КАК Регистратор,
#Вставка
	|	ДД.ПериодРегистратора                  	  КАК ПериодРегистратора,
#КонецВставки
	|	ДД.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                      КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура                           КАК Номенклатура,
	|	ДД.Характеристика                         КАК Характеристика,
	|	ДД.Серия                                  КАК Серия,
	|	ДД.Назначение                             КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот                               КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов                         КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                      КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции                КАК АналитикаУчетаПродукции,
	|	ДД.Продукция                              КАК Продукция,
	|	ДД.ХарактеристикаПродукции                КАК ХарактеристикаПродукции,
	|	ДД.СерияПродукции                         КАК СерияПродукции,
	|	ДД.НазначениеПродукции                    КАК НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства                     КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                    КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)     КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)      КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)             КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)             КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)   КАК аНачальныйОстатокЗабалансовая,
	|	
	|	СУММА(ДД.гИзрасходованоНаПроизводствоКоличество) КАК гИзрасходованоНаПроизводствоКоличество,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоСтоимость)  КАК гИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоПР)         КАК гИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоВР)         КАК гИзрасходованоНаПроизводствоВР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоЗабалансовая) КАК гИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК гРасходНаПроизводствоКоличество,
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость)  КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР)         КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР)         КАК гРасходНаПроизводствоВР,
	|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая)КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.еКонечныйОстатокКоличество)      КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость)       КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)              КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)              КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая)    КАК еКонечныйОстатокЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|ТипЗатрат.*,
	|ВидЗатрат,
	|Организация.*,
	|Подразделение.*,
	|ПодразделениеОтправитель.*,
	|Регистратор.*,
#Вставка
	|ПериодРегистратора.* КАК ПериодРегистратора,
#КонецВставки
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|АналитикаУчетаНоменклатуры.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|ВидРабот.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|АналитикаУчетаПродукции.*,
	|Продукция.*,
	|ХарактеристикаПродукции.*,
	|СерияПродукции.*,
	|НазначениеПродукции.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|гИзрасходованоНаПроизводствоКоличество,
	|гИзрасходованоНаПроизводствоСтоимость,
	|гИзрасходованоНаПроизводствоПР,
	|гИзрасходованоНаПроизводствоВР,
	|гИзрасходованоНаПроизводствоЗабалансовая,
	|гРасходНаПроизводствоКоличество,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|гРасходНаПроизводствоЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая}
	|ИЗ
	// материалы
	|(ВЫБРАТЬ
	|	""Производство"" КАК Таблица,
	|	""Начальный остаток (материалы)"" КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	ВЫБОР 
	|		КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
	|			ТОГДА ""Материальные""
	|		ИНАЧЕ
	|			""Услуги""
	|	КОНЕЦ КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток        КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                       КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток  КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                       КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК гИзрасходованоНаПроизводствоКоличество,
	|	0 КАК гИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК гИзрасходованоНаПроизводствоПР,
	|	0 КАК гИзрасходованоНаПроизводствоВР,
	|	0 КАК гИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	//++ НЕ УТКА
	|						ИЛИ Партия Ссылка Документ.ЗаказНаПроизводство
	//-- НЕ УТКА
	|			)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (материалы) для 2.2"",
	|	КорАналитика.СтатьяКалькуляции.ТипЗатрат,
	|	""Материальные"",
	|	ДД.Организация,
	|	КорАналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		КорАналитика.Назначение.НаправлениеДеятельности),
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.КорПартия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	И КорАналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (материалы) для 2.1"",
	|	КорАналитика.СтатьяКалькуляции.ТипЗатрат,
	|	""Материальные"",
	|	ДД.Организация,
	|	КорАналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ДД.КорПартия,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ((ДД.Регистратор Ссылка Документ.ВыпускПродукции И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.ВыпускПродукции).ВыпускПоРаспоряжениям)
	|		ИЛИ (ДД.Регистратор Ссылка Документ.РаспределениеПроизводственныхЗатрат И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.РаспределениеПроизводственныхЗатрат).НовоеПроизводство)
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор Ссылка Документ.МаршрутныйЛистПроизводства
	//-- НЕ УТКА
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (отходы по фиксированной стоимости)"",
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	""Материальные"" КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (услуги переработчика) для 2.2"",
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	""Услуги"" КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) 
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (материалы) для 2.2"",
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	""Материальные"" КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (материалы) для 2.1"",
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	""Материальные"" КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ДД.Партия,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.Регистратор Ссылка Документ.ВыпускПродукции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (материалы)"",
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	ВЫБОР 
	|		КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
	|			ТОГДА ""Материальные""
	|		ИНАЧЕ
	|			""Услуги""
	|	КОНЕЦ КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	//++ НЕ УТКА
	|						ИЛИ Партия Ссылка Документ.ЗаказНаПроизводство
	//-- НЕ УТКА
	|			)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// трудозатраты
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (трудозатраты) для 2.2"" КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			(ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (трудозатраты) для 2.1"" КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК Партия,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (трудозатраты) для 2.2"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (трудозатраты) для 2.1"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство.НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (трудозатраты) для 2.2"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (трудозатраты) для 2.1"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство.НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|			ТОГДА ДД.ЗаказНаПроизводство
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ДД.ДокументВыпуска
	|	КОНЕЦ КАК Партия,
	|	ДД.ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (трудозатраты) для 2.2"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (трудозатраты) для 2.1"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Трудозатраты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// постатейные
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (постатейные) для 2.2"" КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			(ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (постатейные) для 2.1"" КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (постатейные) для 2.2"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (постатейные) для 2.1"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (постатейные) для 2.2"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (постатейные) для 2.1"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
#Вставка
	|	ДД.Период КАК ПериодРегистратора,
#КонецВставки
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (постатейные) для 2.2"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (постатейные) для 2.1"",
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	""Постатейные"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
#Вставка
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистратора,
#КонецВставки
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.ТипЗатрат,
	|	ДД.ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ПодразделениеОтправитель,
	|	ДД.Регистратор,
#Вставка
	|	ДД.ПериодРегистратора,
#КонецВставки
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.СерияПродукции,
	|	ДД.НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоКоличество");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоВР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("гРасходНаПроизводствоКоличество");
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	Ресурсы.Добавить("гРасходНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);

КонецФункции
