
&ИзменениеИКонтроль("СформироватьТекстДокументыНаОсновании")
Функция ВИЛС_СформироватьТекстДокументыНаОсновании(Форма)

	Результат = Новый ФорматированнаяСтрока("");

	ИспользуетсяТТН         = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекстТТН");
	ИспользуетсяСчетФактура = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекстСчетФактура")
	Или ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекстСчетаФактурыВыданные");
	ИспользоватьОтступ      = ИспользуетсяТТН
	И ИспользуетсяСчетФактура;

	ТекстТТН         = ?(ИспользуетсяТТН, Форма.ТекстТТН, "");
	ТекстСчетФактура = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекстСчетФактура"),
	Форма.ТекстСчетФактура,
	?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекстСчетаФактурыВыданные"),
	Форма.ТекстСчетаФактурыВыданные,
	""));
	Отступ           = ?(ИспользоватьОтступ, Новый ФорматированнаяСтрока("    "), Новый ФорматированнаяСтрока(""));

	Если Форма.Элементы.Найти("ТекстДокументыНаОсновании") <> Неопределено Тогда

		Форма.ТекстДокументыНаОсновании = Новый ФорматированнаяСтрока(ТекстСчетФактура, Отступ, ТекстТТН);
		Результат = Форма.ТекстДокументыНаОсновании;

	ИначеЕсли Форма.Элементы.Найти("ТекстДокументыНаОснованииПодвал") <> Неопределено Тогда

		Форма.ТекстДокументыНаОснованииПодвал = Новый ФорматированнаяСтрока(ТекстСчетФактура, Отступ, ТекстТТН);
		Результат = Форма.ТекстДокументыНаОснованииПодвал;

#Вставка
	ИначеЕсли Форма.ИмяФормы = "Документ.РеализацияУслугПрочихАктивов.Форма.ФормаДокумента" Тогда
		Форма.ТекстСчетаФактурыВыданные = Новый ФорматированнаяСтрока(ТекстСчетФактура, Отступ, ТекстТТН);
		Результат = Форма.ТекстСчетаФактурыВыданные;
		
#КонецВставки
	КонецЕсли;

	Возврат Результат;

КонецФункции
