Функция СодержимоеВременнойТаблицы(МенеджерВТ,Имя) Экспорт
	
	Если Имя = "" Тогда
		Структура = Новый Структура;
		Для Каждого ТаблицаВТ из МенеджерВТ.Таблицы Цикл
			Имя = ТаблицаВТ.ПолноеИмя;
			Запрос = Новый Запрос;
			Запрос.Текст =
			"Выбрать * ИЗ "+Имя;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
			
			Структура.Вставить(Имя,Запрос.Выполнить().Выгрузить());
			
		КонецЦикла;
		Возврат(Структура);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"Выбрать * ИЗ "+Имя;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Возврат(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
КонецФункции

Функция ИспользуютсяОсобыеУсловияТруда(Организация) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиЗарплатаКадрыРасширенная.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	ИспользоватьОсобыеУсловияТруда = Ложь;
	
	Если НаборЗаписей.Количество() ТОгда
		ИспользоватьОсобыеУсловияТруда = НаборЗаписей[0].ИспользоватьОсобыеУсловияТруда;
	КонецЕсли;
	
	Возврат ИспользоватьОсобыеУсловияТруда;
	
КонецФункции

Функция ВИЛС_ТекстЗапросаПоТаблицеЗначений(ТаблицаЗначений) Экспорт
	
	Если не ТипЗнч(ТаблицаЗначений) = Тип("ТаблицаЗначений") ТОгда
		Возврат "";
	КонецЕсли;
	
	ИмяТаблицы = "ТЗ";
	ИмяВТ = "ВТ";
	ТекстВЫБРАТЬ = "ВЫБРАТЬ";
	ТекстПолей = "";
	
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ТекстПолей = ТекстПолей + ?(ТекстПолей = "", "", ",") + Символы.ПС + "	" + ИмяТаблицы + "." + Колонка.Имя; 
	КонецЦикла;
	
	ТекстХвоста = Символы.ПС + "ПОМЕСТИТЬ " + ИмяВТ + Символы.ПС + "ИЗ" + Символы.ПС + "	&" + ИмяТаблицы + " КАК " + ИмяТаблицы;
	
	ТекстЗапроса = ТекстВЫБРАТЬ + ТекстПолей + ТекстХвоста;
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ДоступныПоля(Пользователь,ИмяПрофиля) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка.Профиль КАК Профиль,
	|	ГруппыДоступаПользователи.Пользователь КАК Пользователь,
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь
	|	И ГруппыДоступаПользователи.Ссылка.Профиль.Наименование = &ИмяПрофиля
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка.Профиль,
	|	ГруппыПользователейСостав.Пользователь,
	|	ГруппыПользователейСостав.Ссылка
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО (ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Ссылка)
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|	И ГруппыДоступаПользователи.Ссылка.Профиль.Наименование = &ИмяПрофиля";
	
	
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Запрос.УстановитьПараметр("ИмяПрофиля",ИмяПрофиля);
	
	Результат = Запрос.Выполнить().Выбрать();
	МожноРедактировать = Результат.Следующий();
	УстановитьПривилегированныйРежим(Истина);
	Возврат МожноРедактировать
КонецФункции