#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда     // begin fix Suetin 29.07.2019 16:01:47

#Область ПрограммныйИнтерфейс

#Область СозданиеНаОсновании

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура ВИЛС_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	Документы.ЗаданиеНаПеревозку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли                                                                        // end fix Suetin 29.07.2019 16:01:52