#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

&Перед("ДобавитьКомандыПечати")
Процедура ВИЛС_ДобавитьКомандыПечати(КомандыПечати)
	// Доверенность
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М2_ВИЛС";
	КомандаПечати.Представление = НСтр("ru = 'Доверенность (унифицированная форма № М-2) (ВИЛС)';
										|en = 'Power of Attorney (Unified Form No. М-2) (VILS)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
КонецПроцедуры

&Перед("Печать")
Процедура ВИЛС_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М2_ВИЛС") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"М2_ВИЛС",
				НСтр("ru = 'Доверенность (унифицированная форма № М-2) (ВИЛС)';
					|en = 'Power of Attorney (Unified Form No. М-2) (VILS)'"),
				ВИЛС_СформироватьПечатнуюФормуМ2(
					МассивОбъектов,
					ОбъектыПечати));
		
	КонецЕсли;
КонецПроцедуры

Функция ВИЛС_СформироватьПечатнуюФормуМ2(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаПеревозку_М2_ВИЛС";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаПеревозку.ПФ_MXL_М2_ВИЛС");
	
	ОбластьОтрезДокумента			= Макет.ПолучитьОбласть("Отрез");
	ОбластьЗаголовокДокумента = ОбластьОтрезДокумента;          //
	ОбластьШапкаДокумента 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвалДокумента 			= Макет.ПолучитьОбласть("Подвал");
	ОбластьДополнительнаяИнформация = ОбластьПодвалДокумента;	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Задание.Ссылка 								КАК Задание,
	|	Задание.Дата		 						КАК Дата,
	|	Задание.Номер								КАК Номер,
	|	Задание.Контрагент 							КАК Контрагент,
	|	Задание.Договор								КАК Договор,
	|	Задание.НаименованиеГруза					КАК НаименованиеГруза,
	|	Задание.НомерЗаявки 						КАК НомерЗаявки,
	|	Задание.ДатаЗаявки 							КАК ДатаЗаявки,  
	|	Задание.ВодительФИО							КАК ВодительФИО,
	|	Задание.Водитель							КАК Водитель,
	|	Задание.УдостоверениеНомер					КАК УдостоверениеНомер,
	|	Задание.УдостоверениеСерия					КАК УдостоверениеСерия,	
	|	Задание.Период                              КАК ПериодДокУдостоверяющийЛичность,
	|	ДокументыФизическихЛиц.Представление 		КАК ДокУдостоверяющийЛичность,
	|	Задание.ДоговорПеревозчикаНомер 			КАК ДоговорПеревозчикаНомер,                //ДоговорКонтрагентаНомер
	|	Задание.ДоговорПеревозчикаДата 				КАК ДоговорПеревозчикаДата,                 //ДоговорКонтрагентаДата
	//|	Задание.Грузополучатель 					КАК Грузополучатель,
	|	Задание.ВесГруза							КАК ВесГруза,
	|	Задание.ДоверенностьНомер 					КАК ДоверенностьНомер,
	|	Задание.ДоверенностьДата					КАК ДоверенностьДата//,
	//|	Задание.ДоверенностьВыдана 					КАК ДоверенностьВыдана,
	//|	Задание.ДоверенностьЛицо					КАК ДоверенностьЛицо
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Задание.Ссылка 								КАК Ссылка,
	|		Задание.Дата 								КАК Дата,
	|		Задание.Номер								КАК Номер,
	|		Задание.Контрагент 							КАК Контрагент,
	|		Задание.ВИЛС_ДоговорПеревозчика				КАК Договор,
	|		ВЫРАЗИТЬ(Задание.ДополнительнаяИнформация КАК СТРОКА(1000))	КАК НаименованиеГруза,
	|		Задание.ВИЛС_НомерЗаявки 					КАК НомерЗаявки,
	|		Задание.ВИЛС_ДатаЗаявки 					КАК ДатаЗаявки,  
	|		Задание.ВодительФИО							КАК ВодительФИО,
	|		Задание.ВИЛС_Водитель 						КАК Водитель,
	|		Задание.УдостоверениеНомер					КАК УдостоверениеНомер,
	|		Задание.УдостоверениеСерия					КАК УдостоверениеСерия,	
	|		МАКСИМУМ(ДокументыФизическихЛиц.Период) 	КАК Период,
	|		Задание.ВИЛС_ДоговорПеревозчика.Номер 		КАК ДоговорПеревозчикаНомер,                //ДоговорКонтрагентаНомер
	|		Задание.ВИЛС_ДоговорПеревозчика.Дата 		КАК ДоговорПеревозчикаДата,                 //ДоговорКонтрагентаДата
	//|		Задание.Грузополучатель.НаименованиеПолное 	КАК Грузополучатель,
	|		Задание.Вес									КАК ВесГруза,
	|		Задание.ВИЛС_ДоверенностьНомер 				КАК ДоверенностьНомер,
	|		Задание.ВИЛС_ДоверенностьДата				КАК ДоверенностьДата//,
	//|		Задание.ВИЛС_ДоверенностьВыдана 			КАК ДоверенностьВыдана//,
	//|		Задание.ВИЛС_ДоверенностьЛицо				КАК ДоверенностьЛицо
	|	ИЗ
	|		Документ.ЗаданиеНаПеревозку КАК Задание
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|			ПО Задание.ВИЛС_Водитель = ДокументыФизическихЛиц.Физлицо
	|				И (ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность)
	|				И (ДокументыФизическихЛиц.Период <= Задание.Дата)
	|	ГДЕ
	|		Задание.Ссылка В (&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Задание.Ссылка,
	|		Задание.Дата,
	|		Задание.ВИЛС_Водитель) КАК Задание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|		ПО Задание.Водитель = ДокументыФизическихЛиц.Физлицо
	|			И Задание.Период = ДокументыФизическихЛиц.Период
	|			И (ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность)";
	А = "
	|
	|//////////////////////////////////////////////////////////////////////////////// 1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряженияЗаданий.Ссылка       КАК Ссылка,
	|	РаспоряженияЗаданий.ПолучательОтправитель КАК Получатель,   // Грузополучатель
	|	РаспоряженияЗаданий.Распоряжение КАК Распоряжение,
	|	РаспоряженияЗаданий.КлючСвязи    КАК КлючСвязи,
	|	РаспоряженияЗаданий.НомерСтроки  КАК НомерСтроки,
	|	РаспоряженияОрдеров.Ссылка       КАК Ордер,
	|	РаспоряженияЗаданий.Вес          КАК Вес,
	|	РаспоряженияЗаданий.Объем        КАК Объем
	|ПОМЕСТИТЬ РаспоряженияОрдеров
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РаспоряженияОрдеров
	|		ПО РаспоряженияЗаданий.Распоряжение = РаспоряженияОрдеров.Распоряжение
	|			И НЕ РаспоряженияОрдеров.Ссылка.ПометкаУдаления
	|ГДЕ
	|	РаспоряженияЗаданий.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РаспоряженияЗаданий.КлючСвязи,
	|	РаспоряженияЗаданий.Распоряжение,
	|	РаспоряженияОрдеров.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 2
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозку.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозку.Номер  КАК НомерЗадания,
	|	ЗаданиеНаПеревозку.Дата   КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.Водитель) КАК Водитель,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.КурьерЭкспедитор) КАК КурьерЭкспедитор,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.ТранспортноеСредство) КАК ТранспортноеСредство,
	|	ЗаданиеНаПеревозку.Приоритет КАК Приоритет,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС  КАК НачалоРейсаПлан,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо КАК ОкончаниеРейсаПлан,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаФактС  КАК НачалоРейсаФакт,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаФактПо КАК ОкончаниеРейсаФакт,
	|	ЗаданиеНаПеревозку.ДополнительнаяИнформация КАК ДопИнформация,
	|	ЗаданиеНаПеревозку.Вес   КАК ИтогоВес,
	|	ЗаданиеНаПеревозку.Объем КАК ИтогоОбъем
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаданиеНаПеревозку.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 3
	|ВЫБРАТЬ
	|	МаршрутЗадания.Ссылка  КАК Ссылка,
	|	МаршрутЗадания.Адрес   КАК Адрес,
	|	МаршрутЗадания.Зона    КАК Зона,
	|	МаршрутЗадания.ВремяС  КАК ВремяС,
	|	МаршрутЗадания.ВремяПо КАК ВремяПо,
	|	ВЫРАЗИТЬ(МаршрутЗадания.ДополнительнаяИнформация КАК СТРОКА(1000)) КАК ДополнительнаяИнформация,
	|	РаспоряженияОрдеров.Получатель   КАК Получатель,
	|	РаспоряженияОрдеров.Распоряжение КАК Распоряжение,
	|	РаспоряженияОрдеров.Распоряжение.Номер КАК НомерРаспоряжения,
	|	РаспоряженияОрдеров.Вес   КАК Вес,
	|	РаспоряженияОрдеров.Объем КАК Объем,
	|	СУММА(ВЫБОР
	|			КОГДА ОтгружаемыеТовары.УпаковочныйЛистРодитель = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|				ТОГДА ЕСТЬNULL(ОтгружаемыеТовары.КоличествоУпаковок, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоМест
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК МаршрутЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияОрдеров КАК РаспоряженияОрдеров
	|		ПО МаршрутЗадания.КлючСвязи = РаспоряженияОрдеров.КлючСвязи
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияОрдеровПоПолучателям КАК РаспоряженияОрдеровПоПолучателям
	|		ПО РаспоряженияОрдеров.Распоряжение = РаспоряженияОрдеровПоПолучателям.Распоряжение
	|			И РаспоряженияОрдеров.Ордер = РаспоряженияОрдеровПоПолучателям.Ордер
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ОтгружаемыеТовары
	|		ПО РаспоряженияОрдеровПоПолучателям.Ордер = ОтгружаемыеТовары.Ссылка
	|ГДЕ
	|	МаршрутЗадания.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаршрутЗадания.Ссылка,
	|	МаршрутЗадания.НомерСтроки,
	|	МаршрутЗадания.КлючСвязи,
	|	МаршрутЗадания.Адрес,
	|	МаршрутЗадания.Зона,
	|	МаршрутЗадания.ВремяС,
	|	МаршрутЗадания.ВремяПо,
	|	ВЫРАЗИТЬ(МаршрутЗадания.ДополнительнаяИнформация КАК СТРОКА(1000)),
	|	РаспоряженияОрдеров.Получатель,
	|	РаспоряженияОрдеров.Распоряжение,
	|	РаспоряженияОрдеров.Вес,
	|	РаспоряженияОрдеров.Объем
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутЗадания.Ссылка,
	|	МаршрутЗадания.НомерСтроки,
	|	МИНИМУМ(РаспоряженияОрдеров.НомерСтроки)
	|
	|ИТОГИ ПО
	|	МаршрутЗадания.Ссылка,
	|	МаршрутЗадания.НомерСтроки,
	|	МаршрутЗадания.КлючСвязи,
	|	РаспоряженияОрдеров.Получатель
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 4
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распоряжения.Склад,
	|	ВЫБОР
	|		КОГДА Распоряжения.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Распоряжения.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= Распоряжения.Распоряжение.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК Распоряжения
	|ГДЕ
	|	Распоряжения.Ссылка В(&МассивОбъектов)
	|	И НЕ Распоряжения.Склад.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапросаПоДокументу = Запрос.ВыполнитьПакет();
	
	РезультатШапкаДокументов = РезультатЗапросаПоДокументу[2].Выбрать();
	ВыборкаПоСсылкам         = РезультатЗапросаПоДокументу[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СкладыПогрузкиВыборка    = РезультатЗапросаПоДокументу[4].Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока РезультатШапкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		РеквизитыДокумента = Новый Структура;
		РеквизитыДокумента.Вставить("Номер", РезультатШапкаДокументов.НомерЗадания);
		РеквизитыДокумента.Вставить("Дата",  РезультатШапкаДокументов.Дата);
		
		НазваниеДокумента = НСтр("ru = 'Маршрутный лист';
								|en = 'Route sheet'");
		
		ЗаголовокДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента,
																							НазваниеДокумента);
		ОбластьЗаголовокДокумента.Параметры.ЗаголовокДокумента = ЗаголовокДокумента;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент,
																		Макет,
																		ОбластьЗаголовокДокумента,
																		РезультатШапкаДокументов.Ссылка);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
		
		ОбластьШапкаДокумента.Параметры.Заполнить(РезультатШапкаДокументов);
		
		СтрокаСкладыПогрузки = "";
		ЕстьОрдерныеСклады   = Ложь;
		
		Пока СкладыПогрузкиВыборка.Следующий() Цикл
			Если СкладыПогрузкиВыборка.ОрдернаяСхемаПриОтгрузке
				И Не ЕстьОрдерныеСклады Тогда
				
				ЕстьОрдерныеСклады = Истина;
				
			КонецЕсли;
			
			СтрокаСкладыПогрузки = СтрокаСкладыПогрузки + СкладыПогрузкиВыборка.Склад + "," + Символы.НПП;
		КонецЦикла;
		
		СуффиксОбласти = ?(Не ЕстьОрдерныеСклады, "БезМест", "");
		
		ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбласти);
		ОбластьСтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбласти);
		ОбластьДопСтрокаТаблицы	= Макет.ПолучитьОбласть("ДопСтрокаТаблицы" + СуффиксОбласти);
		ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбласти);
		ОбластьИтоги 			= Макет.ПолучитьОбласть("Итоги" + СуффиксОбласти);
		
		Если СтрокаСкладыПогрузки <> "" Тогда
			СтрокаСкладыПогрузки = Лев(СтрокаСкладыПогрузки, СтрДлина(СтрокаСкладыПогрузки) - 2);
			
			ОбластьШапкаДокумента.Параметры.СкладыПогрузки = СтрокаСкладыПогрузки;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		
		ОтборПоиска = Новый Структура ("Ссылка", РезультатШапкаДокументов.Ссылка);
		
		Пока ВыборкаПоСсылкам.НайтиСледующий(ОтборПоиска) Цикл
			
			ИмяСтолбцаВес   = НСтр("ru = 'Вес, %ЕдиницаИзмеренияВес%';
									|en = 'Weight, %ЕдиницаИзмеренияВес%'");
			ИмяСтолбцаОбъем = НСтр("ru = 'Объем, %ЕдиницаИзмеренияОбъем%';
									|en = 'Volume, %ЕдиницаИзмеренияОбъем%'");
			
			ИмяСтолбцаВес   = СтрЗаменить(ИмяСтолбцаВес,
										"%ЕдиницаИзмеренияВес%",
										Константы.ЕдиницаИзмеренияВеса.Получить());
			ИмяСтолбцаОбъем = СтрЗаменить(ИмяСтолбцаОбъем,
										"%ЕдиницаИзмеренияОбъем%",
										Константы.ЕдиницаИзмеренияОбъема.Получить());
			
			НаименованияКолонокТаблицы = Новый Структура("ВесШапка, ОбъемШапка", ИмяСтолбцаВес, ИмяСтолбцаОбъем);
			
			ОбластьШапкаТаблицы.Параметры.Заполнить(НаименованияКолонокТаблицы);
			
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			
			ВыборкаПоНомерамСтрок = ВыборкаПоСсылкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			НомерСтроки = 0;
			ИтогоКоличествоМест = 0;
			
			Пока ВыборкаПоНомерамСтрок.Следующий() Цикл
			
				ВыборкаПоКодамСтрок = ВыборкаПоНомерамСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоКодамСтрок.Следующий() Цикл
					
					НомерСтроки = НомерСтроки + 1;
					
					ОбластьСтрокаТаблицы.Параметры.НомерЗаказа = НомерСтроки;
					
					ВыборкаПоПолучателям = ВыборкаПоКодамСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					ПервыйПолучатель = Истина;
					
					КоличествоПолучателей = ВыборкаПоПолучателям.Количество() - 1;
					
					Пока ВыборкаПоПолучателям.Следующий() Цикл
						
						Если ПервыйПолучатель Тогда
							ПервыйПолучатель = Ложь;
							
							ЗаполняемаяОбласть = ОбластьСтрокаТаблицы;
						Иначе
							ЗаполняемаяОбласть = ОбластьДопСтрокаТаблицы;
						КонецЕсли;
						
						ИтогоВес   = 0;
						ИтогоОбъем = 0;
						
						КоличествоМестПоСтроке = 0;
						
						Распоряжения = Новый Соответствие;
						
						Выборка = ВыборкаПоПолучателям.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							ИтогоВес   = ИтогоВес + Выборка.Вес;
							ИтогоОбъем = ИтогоОбъем + Выборка.Объем;
							
							КоличествоМестПоСтроке = КоличествоМестПоСтроке + Выборка.КоличествоМест;
							
							ЗаполняемаяОбласть.Параметры.Заполнить(Выборка);
							
							СтрокаРаспоряжения = Распоряжения.Получить(Выборка.Распоряжение.Метаданные());
							
							Если СтрокаРаспоряжения = Неопределено Тогда
								СтрокаРаспоряжения = Выборка.Распоряжение.Метаданные().ПредставлениеСписка + ": "
													+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.НомерРаспоряжения);
							Иначе
								СтрокаРаспоряжения = СтрокаРаспоряжения + "," + " "
									+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Распоряжение.Номер);
							КонецЕсли;
							
							Распоряжения.Вставить(Выборка.Распоряжение.Метаданные(), СтрокаРаспоряжения);
						КонецЦикла;
						
						ИтогоКоличествоМест = ИтогоКоличествоМест + КоличествоМестПоСтроке;
						
						ИменаРаспоряжений = "";
						
						Для Каждого РаспоряжениеКлючЗначение Из Распоряжения Цикл
							ИменаРаспоряжений = ИменаРаспоряжений + РаспоряжениеКлючЗначение.Значение + Символы.ПС;
						КонецЦикла;
						
						ПараметрыГрузаПолучателя = Новый Структура;
						ПараметрыГрузаПолучателя.Вставить("Распоряжения",   ИменаРаспоряжений);
						ПараметрыГрузаПолучателя.Вставить("Вес",            ИтогоВес);
						ПараметрыГрузаПолучателя.Вставить("Объем",          ИтогоОбъем);
						ПараметрыГрузаПолучателя.Вставить("КоличествоМест", КоличествоМестПоСтроке);
						
						ЗаполняемаяОбласть.Параметры.Заполнить(ПараметрыГрузаПолучателя);
						
						ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
						
					КонецЦикла;
					
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"НомерЗаказа" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"Адрес" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"Зона" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"ВремяС" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"ВремяПо" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"ДополнительнаяИнформацияСтрока" + СуффиксОбласти,
													КоличествоПолучателей);
					
				КонецЦикла;
			
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
			ВесПоДокументу   = РезультатШапкаДокументов.ИтогоВес
								/ НоменклатураСервер.КоэффициентПересчетаВТонны(Константы.ЕдиницаИзмеренияВеса.Получить());
			ОбъемПоДокументу = РезультатШапкаДокументов.ИтогоОбъем
								/ НоменклатураСервер.КоэффициентПересчетаВКубическиеМетры(Константы.ЕдиницаИзмеренияОбъема.Получить());
			
			ПараметрыИтогов = Новый Структура;
			ПараметрыИтогов.Вставить("ИтогоВес",   ВесПоДокументу);
			ПараметрыИтогов.Вставить("ИтогоОбъем", ОбъемПоДокументу);
			
			Если ЕстьОрдерныеСклады Тогда
				ПараметрыИтогов.Вставить("ИтогоКоличествоМест", ИтогоКоличествоМест);
			КонецЕсли;
			
			ОбластьИтоги.Параметры.Заполнить(ПараметрыИтогов);
			
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			
			Если ЗначениеЗаполнено(РезультатШапкаДокументов.ДопИнформация) Тогда
				ОбластьДополнительнаяИнформация.Параметры.ДопИнформация = СокрЛП(РезультатШапкаДокументов.ДопИнформация);
				
				ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
														НомерСтрокиНачало,
														ОбъектыПечати,
														РезультатШапкаДокументов.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли