&Вместо("ДанныеОНачисленияхВФорме")
Функция ВИЛС_ДанныеОНачисленияхВФорме(Форма, Начисления, Показатели, ОписаниеТаблицыВидовРасчета) Экспорт
	
	МаксимальноеКоличествоПоказателей = ЗарплатаКадрыРасширенныйКлиентСервер.МаксимальноеКоличествоПоказателейПоОписаниюТаблицы(
		Форма, ОписаниеТаблицыВидовРасчета);
	
	ДанныеОНачислениях = Новый Массив;
	Для Каждого СтрокаНачислений Из Начисления Цикл
		Если СтрокаНачислений.Свойство("Действие")
			И СтрокаНачислений.Действие = ПредопределенноеЗначение("Перечисление.ДействияСНачислениямиИУдержаниями.Отменить") Тогда
			Продолжить;
		КонецЕсли;
		//begin fix Зимин проверяем по штатке только тариф и оклад
		Если Форма.ИмяФормы="Документ.ПриемНаРаботу.Форма.ФормаДокумента" Тогда
			Если СтрокаНачислений.Показатель1<>ПредопределенноеЗначение("Справочник.ПоказателиРасчетаЗарплаты.Оклад") и СтрокаНачислений.Показатель1<>ПредопределенноеЗначение("Справочник.ПоказателиРасчетаЗарплаты.ТарифнаяСтавкаЧасовая") Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//end fix зимин
		УНачисленияЕстьПоказатели = Ложь;
		Для НомерПоказателя = 1 По МаксимальноеКоличествоПоказателей Цикл
			Если СтрокаНачислений["Показатель" + НомерПоказателя].Пустая() Тогда
				Прервать;
			КонецЕсли;
			УНачисленияЕстьПоказатели = Истина;
			СтруктураНачисления = Новый Структура("Начисление,Показатель,Значение", СтрокаНачислений.Начисление, СтрокаНачислений["Показатель" + НомерПоказателя], СтрокаНачислений["Значение" + НомерПоказателя]);
			ДанныеОНачислениях.Добавить(СтруктураНачисления);
		КонецЦикла;
		Если Не УНачисленияЕстьПоказатели Тогда
			СтруктураНачисления = Новый Структура("Начисление,Показатель,Значение", СтрокаНачислений.Начисление);
			Если СтрокаНачислений.Свойство("ФиксированнаяСумма") И СтрокаНачислений.ФиксированнаяСумма Тогда 
				СтруктураНачисления.Значение = СтрокаНачислений.Значение1;
			КонецЕсли;
			ДанныеОНачислениях.Добавить(СтруктураНачисления);
		КонецЕсли; 
	КонецЦикла;
	
	Если ЗарплатаКадрыРасширенныйКлиентСервер.РедактироватьНачисленияВОтдельныхПолях(1, ОписаниеТаблицыВидовРасчета) Тогда

		// Районный коэффициент
		Если ЗарплатаКадрыРасширенныйКлиентСервер.РайонныйКоэффициентПрименяется(Форма) Тогда
				
			СтруктураНачисления = Новый Структура;
			СтруктураНачисления.Вставить("Начисление", ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "НачислениеРайонныйКоэффициент"));
			СтруктураНачисления.Вставить("Показатель", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РайонныйКоэффициент"));
			СтруктураНачисления.Вставить("Значение", ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "ЗначениеПоказателяРайонныйКоэффициент"));
			
			ДанныеОНачислениях.Добавить(СтруктураНачисления);
				
		КонецЕсли; 
			
		// Северная надбавка
		Если ЗарплатаКадрыРасширенныйКлиентСервер.СевернаяНадбавкаПрименяется(Форма) Тогда
				
			СтруктураНачисления = Новый Структура;
			СтруктураНачисления.Вставить("Начисление", ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "НачислениеСевернаяНадбавка"));
			СтруктураНачисления.Вставить("Показатель");
			СтруктураНачисления.Вставить("Значение");
			
			ДанныеОНачислениях.Добавить(СтруктураНачисления);
				
		КонецЕсли; 
		
	КонецЕсли;
		
	НезависимыеПоказатели = Показатели.НайтиСтроки(Новый Структура("ИдентификаторСтрокиВидаРасчета", 0));
	Для Каждого СтрокаПоказателя Из НезависимыеПоказатели Цикл 
		СтруктураПоказателя = Новый Структура("Начисление,Показатель,Значение", ПредопределенноеЗначение("ПланВидовРасчета.Начисления.ПустаяСсылка"), СтрокаПоказателя.Показатель, СтрокаПоказателя.Значение);
		ДанныеОНачислениях.Добавить(СтруктураПоказателя);
	КонецЦикла; 
	Возврат ДанныеОНачислениях;
КонецФункции