
&НаКлиенте
Процедура ВИЛС_ЗаполнитьТоварамиИзЗаказаПосле(Команда)
	ПараметрДляПодбора = Новый Структура("Основание",Объект.ДокументОснование);
	ТекФорма = ПолучитьФорму("Документ.СчетНаОплатуКлиенту.Форма.ВИЛС_ФормаПодбора",ПараметрДляПодбора,ЭтаФорма);
	ТекФорма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = тип("УправляемаяФорма") и  ИсточникВыбора.ИмяФормы = "Документ.СчетНаОплатуКлиенту.Форма.ВИЛС_ФормаПодбора" Тогда 
		Для Каждого строкамассива Из выбранноезначение Цикл
			Отбор = Новый Структура("КлючСвязи",строкамассива.КлючСвязи);
			НайденныеСтроки = Объект.ВИЛС_ТоварыЗаказа.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() Тогда
				РедактируемаяСтрока = НайденныеСтроки[0];
				РедактируемаяСтрока.Количество = РедактируемаяСтрока.Количество + строкамассива.Количество;
				РедактируемаяСтрока.КоличествоУпаковок = РедактируемаяСтрока.КоличествоУпаковок + строкамассива.КоличествоУпаковок;
				
			Иначе
				РедактируемаяСтрока = Объект.ВИЛС_ТоварыЗаказа.Добавить();
				ЗаполнитьЗначенияСвойств(РедактируемаяСтрока,строкамассива);
				
			КонецЕсли;
			
			ПересчитатьСтроку(РедактируемаяСтрока,"");
			
		КонецЦикла;
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект)
	
	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект.ДокументОснование);
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Основание)
	
	СтруктураЗаполненияЦены = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Основание,"ЦенаВключаетНДС") Тогда    	// begin fix Suetin 19.06.2019 14:33:52
		СтруктураЗаполненияЦены.Вставить("ЦенаВключаетНДС", Основание.ЦенаВключаетНДС);
	Иначе	
		СтруктураЗаполненияЦены.Вставить("ЦенаВключаетНДС", Ложь);
	КонецЕсли;      																						// end fix Suetin 19.06.2019 14:34:08
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Основание,"НалогообложениеНДС") Тогда
		СтруктураЗаполненияЦены.Вставить("НалогообложениеНДС", Основание.НалогообложениеНДС);
	КонецЕсли;
	
	Возврат СтруктураЗаполненияЦены;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСтроку(РедактируемаяСтрока,ИмяКолонки = "Сумма")
	
	СтруктураДействий = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);	
	
	СуммаВключаетНДС = СтруктураДействий.ПересчитатьСуммуНДС.ЦенаВключаетНДС;
	Если ИмяКолонки = "Сумма" Тогда
		
	Иначе
		Сумма = РедактируемаяСтрока.Цена * ?(РедактируемаяСтрока.КоличествоУпаковок = 0,РедактируемаяСтрока.Количество,РедактируемаяСтрока.КоличествоУпаковок);   // fix Suetin 19.06.2019 14:41:02 (Убрал Не)  ?(не РедактируемаяСтрока.КоличествоУпаковок = 0
		РедактируемаяСтрока.Сумма = Сумма;// * ВИЛС_ПроцентОплаты/100;
	КонецЕсли; 
	СтавкаНДС = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(РедактируемаяСтрока.СтавкаНДС);
	Если СуммаВключаетНДС Тогда
		РедактируемаяСтрока.СуммаНДС = РедактируемаяСтрока.Сумма - 100 * РедактируемаяСтрока.Сумма / (100 + СтавкаНДС);
		РедактируемаяСтрока.СуммаСНДС = РедактируемаяСтрока.Сумма;
	Иначе
		РедактируемаяСтрока.СуммаНДС = РедактируемаяСтрока.Сумма * СтавкаНДС / 100;
		РедактируемаяСтрока.СуммаСНДС = РедактируемаяСтрока.Сумма+РедактируемаяСтрока.СуммаНДС;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ТоварыСуммаПриИзмененииПосле(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	Если не ТекДанные = Неопределено Тогда
		
		ПересчитатьСтроку(ТекДанные);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Объект.ДокументОснование) = тип("ДокументСсылка.ЗаказКлиента")
		или ТипЗнч(Объект.ДокументОснование) = тип("ДокументСсылка.ЗаказДавальца") Тогда
		ВИЛС_ПроцентОплаты = Объект.СуммаДокумента *100 / Объект.ДокументОснование.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ВИЛС_СодержаниеОбщееПриИзмененииПосле(Элемент)
	Для Каждого СтрокаТовара из Объект.ВИЛС_ТоварыЗаказа Цикл
		СтрокаТовара.Содержание = ВИЛС_СодержаниеОбщее;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьНазначениеПлатежа")
Процедура ВИЛС_ЗаполнитьНазначениеПлатежа()
	
	ДокументОснование = ?(Объект.ВИЛС_ТоварыЗаказа.Количество(),"",Объект.ДокументОснование);
	
	Если НЕ ПустаяСтрока(ДокументОснование) Тогда
		Объект.НазначениеПлатежа = Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
			ДокументОснование.Номер,
			ДокументОснование);
	Иначе
		НазначениеПлатежа = НСтр("ru='По счету № %НомерСчета% от %ДатаСчета%'");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, 
			"%НомерСчета%", 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "%ДатаСчета%", Формат(Объект.Дата, "ДЛФ=DD"));
		Объект.НазначениеПлатежа = НазначениеПлатежа + " ("+Объект.Договор+")";
	КонецЕсли;
	
КонецПроцедуры

// begin fix Suetin 19.06.2019 14:18:37
&НаКлиенте
Процедура ВИЛС_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ПересчитатьСтроку(ТекДанные, "КоличествоУпаковок");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ТоварыЦенаПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ПересчитатьСтроку(ТекДанные, "Цена");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ТоварыСтавкаНДСПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ПересчитатьСтроку(ТекДанные, "СтавкаНДС");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ТоварыСуммаНДСПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ПересчитатьСтроку(ТекДанные, "СуммаНДС");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ЗаполнитьСуммуПоТЧПосле(Команда)
	Объект.СуммаДокумента = Объект.ВИЛС_ТоварыЗаказа.Итог("СуммаСНДС");
КонецПроцедуры
// end fix Suetin 19.06.2019 14:22:16