
&НаКлиенте
Процедура ВИЛС_СписокВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//begin fix Клещ А.Н. 12.07.2019
	Если НельзяРаботатьСФайлом() Тогда 
		Возврат;
	КонецЕсли;
	//end fix Клещ А.Н. 12.07.2019
	
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьЗначение(, ВыбраннаяСтрока);
		Возврат;
	КонецЕсли;
	
	КакОткрывать = РаботаСФайламиСлужебныйКлиент.ПерсональныеНастройкиРаботыСФайлами().ДействиеПоДвойномуЩелчкуМыши;
	
	Если КакОткрывать = "ОткрыватьКарточку" Тогда
		ПоказатьЗначение(, ВыбраннаяСтрока);
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ВыбраннаяСтрока,
	Неопределено, УникальныйИдентификатор, Неопределено, ПредыдущийАдресФайла);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	Обработчик = Новый ОписаниеОповещения("СписокВыборПослеВыбораРежимаРедактирования", ЭтотОбъект, ПараметрыОбработчика);
	
	РаботаСФайламиСлужебныйКлиент.ВыбратьРежимИРедактироватьФайл(Обработчик, ДанныеФайла, Не ДанныеФайла.Служебный);
	
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_СписокПриИзмененииВместо(Элемент)
	
	//begin fix Клещ А.Н. 12.07.2019
	Если НельзяРаботатьСФайлом() Тогда 
		Возврат;
	КонецЕсли;
	//end fix Клещ А.Н. 12.07.2019
	Оповестить("Запись_Файл", Новый Структура("Событие", "ДанныеФайлаИзменены"), Элемент.ВыделенныеСтроки);
	
КонецПроцедуры

&Вместо("Печать")
&НаКлиенте
Процедура ВИЛС_Печать(Команда)
	
	Если Не ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Печать файлов возможна только в Windows.';
										|en = 'Printing files is available only in Windows.'"));
		Возврат;
	КонецЕсли;
	
	//begin fix Клещ А.Н. 12.07.2019
	Если НельзяРаботатьСФайлом() Тогда 
		Возврат;
	КонецЕсли;
	//end fix Клещ А.Н. 12.07.2019
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		РаботаСФайламиКлиент.НапечататьФайлы(ВыделенныеСтроки, ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("Редактировать")
&НаКлиенте
Процедура ВИЛС_Редактировать(Команда)
	
	Если НЕ ФайловыеКомандыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	//begin fix Клещ А.Н. 12.07.2019
	Если НельзяРаботатьСФайлом() Тогда 
		Возврат;
	КонецЕсли;
	//end fix Клещ А.Н. 12.07.2019
	
	Если (ТекущиеДанные.ФайлРедактируется И НЕ ТекущиеДанные.ФайлРедактируетТекущийПользователь)
		ИЛИ ТекущиеДанные.Зашифрован
		ИЛИ ТекущиеДанные.ПодписанЭП Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиСлужебныйКлиент.РедактироватьСОповещением(Неопределено, ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&Вместо("Отправить")
&НаКлиенте
Процедура ВИЛС_Отправить(Команда)
	
	//begin fix Клещ А.Н. 12.07.2019
	Если НельзяРаботатьСФайлом() Тогда 
		Возврат;
	КонецЕсли;
	//end fix Клещ А.Н. 12.07.2019

	
	ПриОтправкеФайловПочтой(ПараметрыОтправки, Элементы.Список.ВыделенныеСтроки, ВладелецФайла, УникальныйИдентификатор);
	
	РаботаСФайламиСлужебныйКлиент.ОтправитьФайлыПоПочте(
		Элементы.Список.ВыделенныеСтроки, УникальныйИдентификатор, ПараметрыОтправки);
	
КонецПроцедуры
	
&Вместо("ОткрытьФайлДляПросмотра")	
&НаКлиенте
Процедура ВИЛС_ОткрытьФайлДляПросмотра(Команда)
	//begin fix Клещ А.Н. 12.07.2019
	Если НельзяРаботатьСФайлом() Тогда 
		Возврат;
	КонецЕсли;
	//end fix Клещ А.Н. 12.07.2019
	ОткрытьФайл();
	
КонецПроцедуры

&НаКлиенте
Функция НельзяРаботатьСФайлом()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	
	Если не СтрНайти(СокрЛП(ТекущиеДанные.ВладелецФайла),"Заявка на расходование")=0
		и ТекущиеДанные.Расширение = "xml" Тогда 
		Возврат Истина;
	КонецЕсли;
	
	
	Возврат Ложь;
	
КонецФункции


