
&После("ПередЗаписью")
Процедура ВИЛС_ПередЗаписью(Отказ, Замещение)
	СписокТипов = Новый СписокЗначений();
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаказДавальца"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаказПереработчику"));
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(СтрокаНабора.Подразделение) Тогда Продолжить; КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНабора.ИсточникГФУРасчетов) 
			и Не СписокТипов.НайтиПоЗначению(ТипЗнч(СтрокаНабора.ИсточникГФУРасчетов)) = Неопределено 
			и ЗначениеЗаполнено(СтрокаНабора.ИсточникГФУРасчетов.Подразделение) Тогда 
			СтрокаНабора.Подразделение = СтрокаНабора.ИсточникГФУРасчетов.Подразделение;	
		ИначеЕсли ЗначениеЗаполнено(СтрокаНабора.ОбъектРасчетов) 
			и Не СписокТипов.НайтиПоЗначению(ТипЗнч(СтрокаНабора.ОбъектРасчетов)) = Неопределено 
			и ЗначениеЗаполнено(СтрокаНабора.ОбъектРасчетов.Подразделение) Тогда 
			СтрокаНабора.Подразделение = СтрокаНабора.ОбъектРасчетов.Подразделение;
		ИначеЕсли ЗначениеЗаполнено(СтрокаНабора.РасчетныйДокумент) 
			и Не СписокТипов.НайтиПоЗначению(ТипЗнч(СтрокаНабора.РасчетныйДокумент)) = Неопределено 
			и ЗначениеЗаполнено(СтрокаНабора.РасчетныйДокумент.Подразделение) Тогда 
			СтрокаНабора.Подразделение = СтрокаНабора.РасчетныйДокумент.Подразделение;
		ИначеЕсли ЗначениеЗаполнено(СтрокаНабора.Договор) 
			и ЗначениеЗаполнено(СтрокаНабора.Договор.Подразделение) Тогда 
			СтрокаНабора.Подразделение = СтрокаНабора.Договор.Подразделение;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
