#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

&Вместо("ЗаполнитьЗадолженностьПоОстаткам")
Процедура ВИЛС_ЗаполнитьЗадолженностьПоОстаткам(ПараметрыЗаполнения, АдресХранилища)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(ПараметрыЗаполнения.Дата), ВидГраницы.Включая));
	// begin fix Suetin 17.01.2019 16:46:39
	Запрос.УстановитьПараметр("Дата1Месяц",Новый Граница(КонецДня(ДобавитьМесяц(ПараметрыЗаполнения.Дата, -1)), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Дата2Месяц",Новый Граница(КонецДня(ДобавитьМесяц(ПараметрыЗаполнения.Дата, -2)), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОпределенияСрокаИстеченияСрокаДавности", Новый Граница(?(ДобавитьМесяц(КонецДня(ПараметрыЗаполнения.Дата), -36) < Дата(2005,12,31,23,59,59), Дата(2005,12,31,23,59,59), ДобавитьМесяц(КонецДня(ПараметрыЗаполнения.Дата), -36)), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("ДатаОпределенияСрокаИстеченияСрокаДавности1Месяц",Новый Граница(?(ДобавитьМесяц(КонецДня(ПараметрыЗаполнения.Дата), -37) < Дата(2005,12,31,23,59,59), Дата(2005,12,31,23,59,59), ДобавитьМесяц(КонецДня(ПараметрыЗаполнения.Дата), -37)), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("ДатаОпределенияСрокаИстеченияСрокаДавности2Месяц",Новый Граница(?(ДобавитьМесяц(КонецДня(ПараметрыЗаполнения.Дата), -38) < Дата(2005,12,31,23,59,59), Дата(2005,12,31,23,59,59), ДобавитьМесяц(КонецДня(ПараметрыЗаполнения.Дата), -38)), ВидГраницы.Включая) );
	// end fix Suetin 17.01.2019 16:46:18
	Запрос.УстановитьПараметр("Организация", ПараметрыЗаполнения.Организация);
	Запрос.УстановитьПараметр("МассивСчетов", ПараметрыЗаполнения.СчетаРасчетов);
	Запрос.УстановитьПараметр("ТаблицаЗадолженности", ПараметрыЗаполнения.ТаблицаЗадолженности);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентаризацияРасчетовЗадолженность.СчетРасчетов,
	|	ИнвентаризацияРасчетовЗадолженность.ДебиторКредитор,
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_Договор,   				// fix Suetin 17.01.2019 13:02:14
	|	ИнвентаризацияРасчетовЗадолженность.Подтверждено,
	|	ИнвентаризацияРасчетовЗадолженность.НеПодтверждено,
	|	ИнвентаризацияРасчетовЗадолженность.ИстекСрокДавности,
	|	ИнвентаризацияРасчетовЗадолженность.ВидЗадолженности,
	|	ИнвентаризацияРасчетовЗадолженность.ВсегоДебиторская,
	|	ИнвентаризацияРасчетовЗадолженность.ВсегоКредиторская,        		// begin fix Suetin 06.02.2019 15:50:43
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_Подтверждено1Месяц,
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_НеПодтверждено1Месяц,
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_ИстекСрокДавности1Месяц,
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_Подтверждено2Месяц,
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_НеПодтверждено2Месяц,
	|	ИнвентаризацияРасчетовЗадолженность.ВИЛС_ИстекСрокДавности2Месяц   	// end fix Suetin 06.02.2019 15:50:48
	|ПОМЕСТИТЬ ЗадолженностьСтарая
	|ИЗ
	|	&ТаблицаЗадолженности КАК ИнвентаризацияРасчетовЗадолженность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ КАК ДебиторКредитор,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадолженности,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоДебиторская,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоКредиторская
	|ПОМЕСТИТЬ ЗадолженностьНовая
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет В (&МассивСчетов), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ, 					// end fix Suetin 17.01.2019 12:58:17
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|
	// begin fix Suetin 17.01.2019 12:58:11	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ КАК ДебиторКредитор,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадолженности,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено	//ИстекСрокДавности	//,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	//|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	//|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ВсегоДебиторская,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	//|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	//|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокКт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ВсегоКредиторская
	|ПОМЕСТИТЬ ЗадолженностьНоваяИстечениеСрокаДавности
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОпределенияСрокаИстеченияСрокаДавности, Счет В (&МассивСчетов), , Организация = &Организация
	|	И ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДебиторКредитор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ВИЛС_Договор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)                   // end fix Suetin 17.01.2019 12:58:11
	|	) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,                  // end fix Suetin 17.01.2019 12:58:17
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ КАК ДебиторКредитор,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадолженности,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоДебиторская,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоКредиторская
	|ПОМЕСТИТЬ ЗадолженностьНовая1Месяц
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата1Месяц, Счет В (&МассивСчетов), , Организация = &Организация
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДебиторКредитор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ВИЛС_Договор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ, 					// end fix Suetin 17.01.2019 12:58:17
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ КАК ДебиторКредитор,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадолженности,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено	//ИстекСрокДавности	//,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	//|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	//|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ВсегоДебиторская,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	//|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	//|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокКт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ВсегоКредиторская
	|ПОМЕСТИТЬ ЗадолженностьНоваяИстечениеСрокаДавности1Месяц
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОпределенияСрокаИстеченияСрокаДавности1Месяц, Счет В (&МассивСчетов), , Организация = &Организация
	|	И ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДебиторКредитор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ВИЛС_Договор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)                   // end fix Suetin 17.01.2019 12:58:11
	|	) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,                  // end fix Suetin 17.01.2019 12:58:17
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ КАК ДебиторКредитор,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадолженности,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоДебиторская,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоКредиторская
	|ПОМЕСТИТЬ ЗадолженностьНовая2Месяц
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата2Месяц, Счет В (&МассивСчетов), , Организация = &Организация
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДебиторКредитор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ВИЛС_Договор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ, 					// end fix Suetin 17.01.2019 12:58:17
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ КАК ДебиторКредитор,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадолженности,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено	//ИстекСрокДавности	//,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	//|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	//|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ВсегоДебиторская,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	//|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	//|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокКт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ВсегоКредиторская
	|ПОМЕСТИТЬ ЗадолженностьНоваяИстечениеСрокаДавности2Месяц
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОпределенияСрокаИстеченияСрокаДавности2Месяц, Счет В (&МассивСчетов), , Организация = &Организация
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДебиторКредитор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ВИЛС_Договор ИЗ ЗадолженностьНовая КАК ЗадолженностьНовая)
	|	) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,                  // end fix Suetin 17.01.2019 12:58:17
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРасчетов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// end fix Suetin 17.01.2019 12:58:17
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьНовая.ДебиторКредитор КАК ДебиторКредитор,
	|	ЗадолженностьНовая.ВИЛС_Договор КАК ВИЛС_Договор,        // fix Suetin 17.01.2019 14:35:22
	|	ЗадолженностьНовая.СчетРасчетов КАК СчетРасчетов,
	|	ЗадолженностьНовая.ВидЗадолженности,
	|	ЕСТЬNULL(ЗадолженностьСтарая.Подтверждено, ЗадолженностьНовая.Подтверждено) КАК Подтверждено,
	|	ЕСТЬNULL(ЗадолженностьСтарая.НеПодтверждено, 0) КАК НеПодтверждено,        
	// begin fix Suetin 06.02.2019 15:44:57
	//|	ЕСТЬNULL(ЗадолженностьСтарая.ИстекСрокДавности, 0) КАК ИстекСрокДавности,  
	|   ВЫБОР КОГДА ЕСТЬNULL(ЗадолженностьСтарая.Подтверждено, ЗадолженностьНовая.Подтверждено) < ЕСТЬNULL(ЗадолженностьНоваяИстечениеСрокаДавности.Подтверждено, 0) ТОГДА ЕСТЬNULL(ЗадолженностьСтарая.Подтверждено, ЗадолженностьНовая.Подтверждено) ИНАЧЕ ЕСТЬNULL(ЗадолженностьНоваяИстечениеСрокаДавности.Подтверждено, 0) КОНЕЦ КАК ИстекСрокДавности,
	
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_Подтверждено1Месяц, ЗадолженностьНовая1Месяц.Подтверждено) КАК ВИЛС_Подтверждено1Месяц,
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_НеПодтверждено1Месяц, 0) КАК ВИЛС_НеПодтверждено1Месяц,
	|   ВЫБОР КОГДА ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_Подтверждено1Месяц, ЗадолженностьНовая1Месяц.Подтверждено) < ЕСТЬNULL(ЗадолженностьНоваяИстечениеСрокаДавности1Месяц.Подтверждено, 0) ТОГДА ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_Подтверждено1Месяц, ЗадолженностьНовая1Месяц.Подтверждено) ИНАЧЕ ЕСТЬNULL(ЗадолженностьНоваяИстечениеСрокаДавности1Месяц.Подтверждено, 0) КОНЕЦ КАК ВИЛС_ИстекСрокДавности1Месяц,
	
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_Подтверждено2Месяц, ЗадолженностьНовая2Месяц.Подтверждено) КАК ВИЛС_Подтверждено2Месяц,
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_НеПодтверждено2Месяц, 0) КАК ВИЛС_НеПодтверждено2Месяц,
	|   ВЫБОР КОГДА ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_Подтверждено2Месяц, ЗадолженностьНовая2Месяц.Подтверждено) < ЕСТЬNULL(ЗадолженностьНоваяИстечениеСрокаДавности2Месяц.Подтверждено, 0) ТОГДА ЕСТЬNULL(ЗадолженностьСтарая.ВИЛС_Подтверждено2Месяц, ЗадолженностьНовая2Месяц.Подтверждено) ИНАЧЕ ЕСТЬNULL(ЗадолженностьНоваяИстечениеСрокаДавности2Месяц.Подтверждено, 0) КОНЕЦ КАК ВИЛС_ИстекСрокДавности2Месяц,
	// end fix Suetin 06.02.2019 15:57:38
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВсегоДебиторская, ЗадолженностьНовая.ВсегоДебиторская) КАК ВсегоДебиторская,
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВсегоКредиторская, ЗадолженностьНовая.ВсегоКредиторская) КАК ВсегоКредиторская,
	|	ЕСТЬNULL(ЗадолженностьСтарая.ВсегоДебиторская, ЗадолженностьНовая.ВсегоДебиторская) + ЕСТЬNULL(ЗадолженностьСтарая.ВсегоКредиторская, ЗадолженностьНовая.ВсегоКредиторская) = ЕСТЬNULL(ЗадолженностьСтарая.Подтверждено, ЗадолженностьНовая.Подтверждено) КАК ЕстьПодтвержденнаяСумма,
	|	ЕСТЬNULL(ЗадолженностьСтарая.НеПодтверждено, 0) > 0 КАК ЕстьНеПодтвержденнаяСумма,
	|	ЕСТЬNULL(ЗадолженностьСтарая.ИстекСрокДавности, 0) > 0 КАК ЕстьИстекСрокДавности,
	|	ЕСТЬNULL(ЗадолженностьСтарая.Подтверждено, ЗадолженностьНовая.Подтверждено) > 0
	|		И ЕСТЬNULL(ЗадолженностьСтарая.НеПодтверждено, 0) > 0 КАК ЕстьЧастичноПодтвержденнаяСумма
	|ИЗ
	|	ЗадолженностьНовая КАК ЗадолженностьНовая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗадолженностьСтарая КАК ЗадолженностьСтарая
	|		ПО ЗадолженностьНовая.СчетРасчетов = ЗадолженностьСтарая.СчетРасчетов
	|			И ЗадолженностьНовая.ДебиторКредитор = ЗадолженностьСтарая.ДебиторКредитор        
	|			И ЗадолженностьНовая.ВИЛС_Договор = ЗадолженностьСтарая.ВИЛС_Договор
	|			И ЗадолженностьНовая.ВидЗадолженности = ЗадолженностьСтарая.ВидЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗадолженностьНоваяИстечениеСрокаДавности КАК ЗадолженностьНоваяИстечениеСрокаДавности
	|		ПО ЗадолженностьНовая.СчетРасчетов = ЗадолженностьНоваяИстечениеСрокаДавности.СчетРасчетов
	|			И ЗадолженностьНовая.ДебиторКредитор = ЗадолженностьНоваяИстечениеСрокаДавности.ДебиторКредитор      
	|			И ЗадолженностьНовая.ВИЛС_Договор = ЗадолженностьНоваяИстечениеСрокаДавности.ВИЛС_Договор
	|			И ЗадолженностьНовая.ВидЗадолженности = ЗадолженностьНоваяИстечениеСрокаДавности.ВидЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗадолженностьНовая1Месяц КАК ЗадолженностьНовая1Месяц
	|		ПО ЗадолженностьНовая.СчетРасчетов = ЗадолженностьНовая1Месяц.СчетРасчетов
	|			И ЗадолженностьНовая.ДебиторКредитор = ЗадолженностьНовая1Месяц.ДебиторКредитор   
	|			И ЗадолженностьНовая.ВИЛС_Договор = ЗадолженностьНовая1Месяц.ВИЛС_Договор
	|			И ЗадолженностьНовая.ВидЗадолженности = ЗадолженностьНовая1Месяц.ВидЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗадолженностьНоваяИстечениеСрокаДавности1Месяц КАК ЗадолженностьНоваяИстечениеСрокаДавности1Месяц
	|		ПО ЗадолженностьНовая.СчетРасчетов = ЗадолженностьНоваяИстечениеСрокаДавности1Месяц.СчетРасчетов
	|			И ЗадолженностьНовая.ДебиторКредитор = ЗадолженностьНоваяИстечениеСрокаДавности1Месяц.ДебиторКредитор      
	|			И ЗадолженностьНовая.ВИЛС_Договор = ЗадолженностьНоваяИстечениеСрокаДавности1Месяц.ВИЛС_Договор
	|			И ЗадолженностьНовая.ВидЗадолженности = ЗадолженностьНоваяИстечениеСрокаДавности1Месяц.ВидЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗадолженностьНовая2Месяц КАК ЗадолженностьНовая2Месяц
	|		ПО ЗадолженностьНовая.СчетРасчетов = ЗадолженностьНовая2Месяц.СчетРасчетов
	|			И ЗадолженностьНовая.ДебиторКредитор = ЗадолженностьНовая2Месяц.ДебиторКредитор    
	|			И ЗадолженностьНовая.ВИЛС_Договор = ЗадолженностьНовая2Месяц.ВИЛС_Договор
	|			И ЗадолженностьНовая.ВидЗадолженности = ЗадолженностьНовая2Месяц.ВидЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗадолженностьНоваяИстечениеСрокаДавности2Месяц КАК ЗадолженностьНоваяИстечениеСрокаДавности2Месяц
	|		ПО ЗадолженностьНовая.СчетРасчетов = ЗадолженностьНоваяИстечениеСрокаДавности2Месяц.СчетРасчетов
	|			И ЗадолженностьНовая.ДебиторКредитор = ЗадолженностьНоваяИстечениеСрокаДавности2Месяц.ДебиторКредитор  
	|			И ЗадолженностьНовая.ВИЛС_Договор = ЗадолженностьНоваяИстечениеСрокаДавности2Месяц.ВИЛС_Договор
	|			И ЗадолженностьНовая.ВидЗадолженности = ЗадолженностьНоваяИстечениеСрокаДавности2Месяц.ВидЗадолженности
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадолженностьНовая.СчетРасчетов.Порядок,
	|	ДебиторКредитор, ВИЛС_Договор      // fix Suetin 06.02.2019 14:13:32
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

Процедура КонвертироватьДанныеФормыДеревоВДеревоЗначений(ДеревоЗначений, Родитель,ЕстьПометка=Ложь) Экспорт
	
	Если Родитель.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементДерева Из Родитель.Строки Цикл
		НоваяСтрокаДерева = ДеревоЗначений.Строки.Найти(ЭлементДерева.Счет,"Счет",Ложь);
		Если НоваяСтрокаДерева = Неопределено Тогда
			НоваяСтрокаДерева 					= ДеревоЗначений.Строки.Добавить();
			НоваяСтрокаДерева["Счет"]     		= ЭлементДерева["Счет"];
			НоваяСтрокаДерева["КодСчета"]    	= ЭлементДерева["КодСчета"];
			НоваяСтрокаДерева["Наименование"]   = ЭлементДерева["Наименование"];
			Если ЕстьПометка Тогда
				НоваяСтрокаДерева["Пометка"]   		= ЭлементДерева["Пометка"];
			Иначе
			    НоваяСтрокаДерева["КоличествоСтрок"] 			= ЭлементДерева["КоличествоСтрок"];
				НоваяСтрокаДерева["ДебиторскаяЗадолженность"] 	= ЭлементДерева["ДебиторскаяЗадолженность"];
			    НоваяСтрокаДерева["КредиторскаяЗадолженность"] 	= ЭлементДерева["КредиторскаяЗадолженность"];
				НоваяСтрокаДерева["Подтверждено"] 				= ЭлементДерева["Подтверждено"];    
				НоваяСтрокаДерева["НеПодтверждено"] 			= ЭлементДерева["НеПодтверждено"];
				НоваяСтрокаДерева["ИстекСрокДавности"] 			= ЭлементДерева["ИстекСрокДавности"];
			КонецЕсли; 
		ИначеЕсли Не ЕстьПометка Тогда
			НоваяСтрокаДерева["КоличествоСтрок"] 			= НоваяСтрокаДерева["КоличествоСтрок"] 				+ ЭлементДерева["КоличествоСтрок"];
			НоваяСтрокаДерева["ДебиторскаяЗадолженность"] 	= НоваяСтрокаДерева["ДебиторскаяЗадолженность"] 	+ ЭлементДерева["ДебиторскаяЗадолженность"];
		    НоваяСтрокаДерева["КредиторскаяЗадолженность"] 	= НоваяСтрокаДерева["КредиторскаяЗадолженность"] 	+ ЭлементДерева["КредиторскаяЗадолженность"];
			НоваяСтрокаДерева["Подтверждено"] 				= НоваяСтрокаДерева["Подтверждено"] 				+ ЭлементДерева["Подтверждено"];    
			НоваяСтрокаДерева["НеПодтверждено"] 			= НоваяСтрокаДерева["НеПодтверждено"] 				+ ЭлементДерева["НеПодтверждено"];
			НоваяСтрокаДерева["ИстекСрокДавности"] 			= Макс(
				?(ЗначениеЗаполнено(НоваяСтрокаДерева["ИстекСрокДавности"]),НоваяСтрокаДерева["ИстекСрокДавности"],0),
				?(ЗначениеЗаполнено(ЭлементДерева["ИстекСрокДавности"]),ЭлементДерева["ИстекСрокДавности"],0));	
		КонецЕсли; 
		
		КонвертироватьДанныеФормыДеревоВДеревоЗначений(НоваяСтрокаДерева, ЭлементДерева, ЕстьПометка);
		
	КонецЦикла;
	ДеревоЗначений.Строки.Сортировать("КодСчета");			
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

&После("ДобавитьКомандыПечати")
Процедура ВИЛС_ДобавитьКомандыПечати(КомандыПечати)
	// Акт инвентаризации расчетов (ИНВ-17) (ВИЛС) С подразделениями
	КомандаПечати = КомандыПечати.Вставить(1);
	КомандаПечати.Идентификатор = "ИНВ17_ВИЛС";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17) (ВИЛС)';
										|en = 'Settlement inventory report (INV-17) (VILS)'");

	// Акт инвентаризации расчетов (ИНВ-17) (ВИЛС) С подразделениями
	КомандаПечати = КомандыПечати.Вставить(2);
	КомандаПечати.Идентификатор = "ИНВ17_ПоПодразделениям_ВИЛС";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17) (ВИЛС по подразделениям)';
										|en = 'Settlement inventory report (INV-17) (VILS for structure)'");

	// Акт инвентаризации расчетов (ИНВ-17) (ВИЛС) С подразделениями
	КомандаПечати = КомандыПечати.Вставить(3);
	КомандаПечати.Идентификатор = "ИНВ17_СПодразделениями_ВИЛС";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17) (ВИЛС с сортировкой)';
										|en = 'Settlement inventory report (INV-17) (VILS with sort)'");

	Порядок = 3;
	Для Каждого ЭлСпискаКП Из КомандыПечати Цикл
		ЭлСпискаКП.Порядок = Порядок;
		Порядок = Порядок + 1;
	КонецЦикла;	
	// РеестрДебиторскойЗадолженностиПриложение_7_1_180510
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрДебиторскойЗадолженностиПриложение_7_1";
	КомандаПечати.Представление = НСтр("ru = 'Реестр дебиторской задолженности. Приложение 7.1.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	// РеестрДебиторскойЗадолженностиПриложение_7_1_180510
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрДебиторскойЗадолженностиСЗаказамиПриложение_7_1";
	КомандаПечати.Представление = НСтр("ru = 'Реестр дебиторской задолженности (с заказами). Приложение 7.1.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	// РеестрКредиторскойЗадолженностиПриложение_7_1_180517
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрКредиторскойЗадолженностиПриложение_7_1";
	КомандаПечати.Представление = НСтр("ru = 'Реестр кредиторской задолженности. Приложение 7.1.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	// РеестрКредиторскойЗадолженностиПриложение_7_1_180517
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрКредиторскойЗадолженностиСЗаказамиПриложение_7_1";
	КомандаПечати.Представление = НСтр("ru = 'Реестр кредиторской задолженности (с заказами). Приложение 7.1.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	// РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2_180523
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2";
	КомандаПечати.Представление = НСтр("ru = 'Реестр просроченной дебиторской задолженности. Приложение 7.2.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрПросроченнойДебиторскойЗадолженностиСЗаказамиПриложение_7_2";
	КомандаПечати.Представление = НСтр("ru = 'Реестр просроченной дебиторской задолженности (с заказами). Приложение 7.2.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	// РеестрПросроченнойКредиторскойЗадолженностиПриложение_7_2_180523
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрПросроченнойКредиторскойЗадолженностиПриложение_7_2";
	КомандаПечати.Представление = НСтр("ru = 'Реестр просроченной кредиторской задолженности. Приложение 7.2.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;   
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрПросроченнойКредиторскойЗадолженностиСЗаказамиПриложение_7_2";
	КомандаПечати.Представление = НСтр("ru = 'Реестр просроченной кредиторской задолженности (с заказами). Приложение 7.2.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;   
	КомандаПечати.Порядок = Порядок;
	Порядок = Порядок + 1;
	
	
	//// РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2_180523
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2_180523";
	//КомандаПечати.Представление = НСтр("ru = 'Реестр просроченной дебиторской задолженности. Приложение 7.2. ТЕСТ'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//// РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2_180702
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2_180702";
	//КомандаПечати.Представление = НСтр("ru = 'Реестр просроченной дебиторской задолженности. Приложение 7.2. ТЕСТ по заказам'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
КонецПроцедуры

&После("Печать")
Процедура ВИЛС_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ17_ВИЛС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ17_ВИЛС", НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17) (ВИЛС)'"), 
			ВИЛС_ПечатьИНВ17(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_Инв17_ВИЛС");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ17_ПоПодразделениям_ВИЛС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ17_ПоПодразделениям_ВИЛС", НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17) (ВИЛС по подразделениям)'"), 
			ВИЛС_ПечатьИНВ17_ПоПодразделениям(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_Инв17");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ17_СПодразделениями_ВИЛС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ17_СПодразделениями_ВИЛС", НСтр("ru = 'Акт инвентаризации расчетов (ИНВ-17) (ВИЛС с сортировкой)'"), 
			ВИЛС_ПечатьИНВ17_СПодразделениями(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_Инв17_ВИЛС");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДебиторскойЗадолженностиПриложение_7_1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрДебиторскойЗадолженностиПриложение_7_1", НСтр("ru = 'Реестр дебиторской задолженности. Приложение 7.1.'"), 
			ПечатьРеестрДебиторскойЗадолженностиПриложение_7_1(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрКредиторскойЗадолженностиПриложение_7_1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрКредиторскойЗадолженностиПриложение_7_1", НСтр("ru = 'Реестр кредиторской задолженности. Приложение 7.1.'"), 
			ПечатьРеестрКредиторскойЗадолженностиПриложение_7_1(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2", НСтр("ru = 'Реестр просроченной дебиторской задолженности. Приложение 7.2.'"), 
			ПечатьРеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрПросроченнойКредиторскойЗадолженностиПриложение_7_2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрПросроченнойКредиторскойЗадолженностиПриложение_7_2", НСтр("ru = 'Реестр просроченной кредиторской задолженности. Приложение 7.2.'"), 
			ПечатьРеестрПросроченнойКредиторскойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДебиторскойЗадолженностиСЗаказамиПриложение_7_1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрДебиторскойЗадолженностиСЗаказамиПриложение_7_1", НСтр("ru = 'Реестр дебиторской задолженности (с заказами). Приложение 7.1.'"), 
			ПечатьРеестрДебиторскойЗадолженностиСЗаказамиПриложение_7_1(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрКредиторскойЗадолженностиСЗаказамиПриложение_7_1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрКредиторскойЗадолженностиСЗаказамиПриложение_7_1", НСтр("ru = 'Реестр кредиторской задолженности. (с заказами) Приложение 7.1.'"), 
			ПечатьРеестрКредиторскойЗадолженностиСЗаказамиПриложение_7_1(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрПросроченнойДебиторскойЗадолженностиСЗаказамиПриложение_7_2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрПросроченнойДебиторскойЗадолженностиСЗаказамиПриложение_7_2", НСтр("ru = 'Реестр просроченной дебиторской задолженности (с заказами). Приложение 7.2.'"), 
			ПечатьРеестрПросроченнойДебиторскойЗадолженностиСЗаказамиПриложение_7_2(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрПросроченнойКредиторскойЗадолженностиСЗаказамиПриложение_7_2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрПросроченнойКредиторскойЗадолженностиСЗаказамиПриложение_7_2", НСтр("ru = 'Реестр просроченной кредиторской задолженности. (с заказами) Приложение 7.2.'"), 
			ПечатьРеестрПросроченнойКредиторскойЗадолженностиСЗаказамиПриложение_7_2(МассивОбъектов, ОбъектыПечати), , "Документ.ИнвентаризацияРасчетовСКонтрагентами.ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	КонецЕсли;
КонецПроцедуры

Функция ВИЛС_ПечатьИНВ17(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСКонтрагентами_ИНВ17_ВИЛС";

	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДебиторыКредиторы.ВИЛС_Договор 	КАК Договор,		                        // begin fix Suetin 05.12.2019 18:23:30
	|	Договоры.Наименование			КАК НаименованиеДоговора,
	|	Договоры.НаименованиеДляПечати 	КАК НаименованиеПолноеДоговора,
	|	Договоры.Подразделение 			КАК Подразделение,							// end fix Suetin 05.12.2019 18:23:35
	|	ДебиторыКредиторы.ДебиторКредитор КАК Ссылка,                                 
	|	Контрагенты.Наименование,
	|	Контрагенты.НаименованиеПолное
	|ПОМЕСТИТЬ ДебиторыКредиторы
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДебиторыКредиторы.ДебиторКредитор = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры      // begin fix Suetin 05.12.2019 17:24:42
	|		ПО ДебиторыКредиторы.ВИЛС_Договор = Договоры.Ссылка                     // fix Suetin 05.12.2019 17:24:47
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	Организации.Наименование,
	|	Организации.НаименованиеПолное
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДебиторыКредиторы.ДебиторКредитор = Организации.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	НалоговыеОрганы.Наименование,
	|	НалоговыеОрганы.НаименованиеИФНС
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК НалоговыеОрганы
	|		ПО ДебиторыКредиторы.ДебиторКредитор = НалоговыеОрганы.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.УточнениеНаименования
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ДебиторыКредиторы.ДебиторКредитор = ФизическиеЛица.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инвентаризация.ВидЗадолженности КАК ВидЗадолженности,
	|	Инвентаризация.ДебиторКредитор КАК Контрагент,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолное, Инвентаризация.ДебиторКредитор) КАК КонтрагентНаименованиеПолное,
	|	ЕСТЬNULL(ДебиторыКредиторы.Наименование, Инвентаризация.ДебиторКредитор) КАК КонтрагентНаименование,
	|	Инвентаризация.ВИЛС_Договор КАК Договор,           							// begin fix Suetin 05.12.2019 18:31:08
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолноеДоговора, Инвентаризация.ВИЛС_Договор) КАК ДоговорНаименованиеПолное,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеДоговора, Инвентаризация.ВИЛС_Договор) КАК ДоговорНаименование,
	|   ДебиторыКредиторы.Подразделение КАК Подразделение, 							// end fix Suetin 05.12.2019 18:31:13
	|	Инвентаризация.СчетРасчетов КАК СчетРасчетов,
	|	ПРЕДСТАВЛЕНИЕ(Инвентаризация.СчетРасчетов) КАК СчетРасчетовПредставление,
	|	МИНИМУМ(Инвентаризация.НомерСтроки) КАК НомерСтроки,
	|	СУММА(Инвентаризация.Подтверждено + Инвентаризация.НеПодтверждено) КАК Всего,
	|	СУММА(Инвентаризация.Подтверждено) КАК Подтверждено,
	|	СУММА(Инвентаризация.НеПодтверждено) КАК НеПодтверждено,
	|	СУММА(Инвентаризация.ИстекСрокДавности) КАК ИстекСрокДавности,
	|	Инвентаризация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Инвентаризация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДебиторыКредиторы КАК ДебиторыКредиторы
	|		ПО (ДебиторыКредиторы.Ссылка = Инвентаризация.ДебиторКредитор)
	|       	И (ДебиторыКредиторы.Договор = Инвентаризация.ВИЛС_Договор)
	|ГДЕ
	|	Инвентаризация.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Инвентаризация.Ссылка,
	|	Инвентаризация.ВидЗадолженности,
	|	Инвентаризация.ДебиторКредитор,
	|	Инвентаризация.ВИЛС_Договор,           										// begin fix Suetin 05.12.2019 18:31:08
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолноеДоговора, Инвентаризация.ВИЛС_Договор),
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеДоговора, Инвентаризация.ВИЛС_Договор),
	|   ДебиторыКредиторы.Подразделение, 											// end fix Suetin 05.12.2019 18:31:13
	|	Инвентаризация.СчетРасчетов,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолное, Инвентаризация.ДебиторКредитор),
	|	ЕСТЬNULL(ДебиторыКредиторы.Наименование, Инвентаризация.ДебиторКредитор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Инвентаризация.СчетРасчетов.Порядок,
	|	Инвентаризация.ДебиторКредитор,
	|	Инвентаризация.ВИЛС_Договор    												// fix Suetin 05.12.2019 18:32:44
	|АВТОУПОРЯДОЧИВАНИЕ
	|ИТОГИ
	|	СУММА(Всего),
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ИстекСрокДавности)
	|ПО
	|	Ссылка,
	|	ВидЗадолженности";
	
	РезультатКонтрагенты = ЗапросКонтрагенты.Выполнить();
	ВыборкаПоВидуДокумента = РезультатКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияРасчетов.ПФ_MXL_Инв17_ВИЛС");
	ПервыйДокумент = Истина;

	ВыборкаШапок = ПолучитьВыборкуШапок(МассивОбъектов).Выбрать();
	
	Пока ВыборкаШапок.Следующий() Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
				
		// Варианты заголовков разделов с подписями печатной формы	
		ЗаголовокРазделаПодписей = Новый Структура();
		ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", НСтр("ru = 'Председатель комиссии';
																		|en = 'Commission chairperson'"));
		ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии",        НСтр("ru = 'Члены комиссии';
																		|en = 'Commission members'"));
		
		// Формирование шапки
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Заполнить(ВыборкаШапок);
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаШапок.Организация, ВыборкаШапок.Дата);
		Шапка.Параметры.Организация          = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации);
		Шапка.Параметры.ОрганизацияКодПоОКПО = СведенияОбОрганизации.КодПоОКПО;
		
		Шапка.Параметры.НомерДокумента = ВыборкаШапок.Номер;
		Шапка.Параметры.ДеньДокумента  = День(ВыборкаШапок.Дата);
		Шапка.Параметры.МесяцДокумента = Сред(Формат(ВыборкаШапок.Дата, "ДЛФ=ДД"), 
														 СтрНайти(Формат(ВыборкаШапок.Дата, "ДЛФ=ДД"), " "));
														 
		ТабДокумент.Вывести(Шапка);

		// Формирование строк дебиторской задолженности
		ПодвалТаблицыДт = Макет.ПолучитьОбласть("ПодвалТаблицыДт");
		СтрокаТаблицыДт = Макет.ПолучитьОбласть("СтрокаТаблицыДт");
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапок.Ссылка);
		
		Если ВыборкаПоВидуДокумента.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаПоВидуЗадолженности = ВыборкаПоВидуДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			Продолжить;
		КонецЕсли;
					
		СтруктураПоиска = Новый Структура("ВидЗадолженности", Перечисления.ТипыЗадолженности.Дебиторская);
				
		Если ВыборкаПоВидуЗадолженности.НайтиСледующий(СтруктураПоиска) Тогда

			ПодвалТаблицыДт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
			
			ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
			Пока ВыборкаПоКонтрагенту.Следующий() Цикл
				СтрокаТаблицыДт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
				// begin fix Suetin 06.12.2019 12:08:40
				//СтрокаТаблицыДт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
				//													ВыборкаПоКонтрагенту.КонтрагентНаименование, 
				//													ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
				СтрокаТаблицыДт.Параметры.КонтрагентПредставление =  
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1%2%3%4%5'"),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
						ВыборкаПоКонтрагенту.КонтрагентНаименование,ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",Символы.ПС),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"","("),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",")"));
				// end fix Suetin 06.12.2019 12:16:47	
				ТабДокумент.Вывести(СтрокаТаблицыДт);
			КонецЦикла;
			
		КонецЕсли;
	
		ТабДокумент.Вывести(ПодвалТаблицыДт);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка оборотной стороны Акта
		ШапкаОборот = Макет.ПолучитьОбласть("ШапкаОборот");
		ТабДокумент.Вывести(ШапкаОборот);
		
		// Формирование строк кредиторской задолженности
		ПодвалТаблицыКт = Макет.ПолучитьОбласть("ПодвалТаблицыКт");
		СтрокаТаблицыКт = Макет.ПолучитьОбласть("СтрокаТаблицыКт");
				
		ВыборкаПоВидуЗадолженности.Сбросить();
		
		СтруктураПоиска = Новый Структура("ВидЗадолженности", Перечисления.ТипыЗадолженности.Кредиторская);
		
		Если ВыборкаПоВидуЗадолженности.НайтиСледующий(СтруктураПоиска) Тогда
								
			ПодвалТаблицыКт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
			
			ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
			Пока ВыборкаПоКонтрагенту.Следующий() Цикл
				СтрокаТаблицыКт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
				СтрокаТаблицыКт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
																		ВыборкаПоКонтрагенту.КонтрагентНаименование, 
																		ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
				ТабДокумент.Вывести(СтрокаТаблицыКт);
			КонецЦикла;
				
		КонецЕсли;
				
		ТабДокумент.Вывести(ПодвалТаблицыКт);
		
		// Подвал печатной формы
		Подвал = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
		Подпись = Макет.ПолучитьОбласть("Подпись");
		ТаблицаИнвентаризационнаяКомиссия = ВыборкаШапок.ИнвентаризационнаяКомиссия.Выгрузить();
		
		// Выведем подпись председателя инвентаризационной комиссии
		ПредседательКомиссии = ТаблицаИнвентаризационнаяКомиссия.Найти(Истина, "Председатель");
		
		Если ПредседательКомиссии <> Неопределено Тогда
							
			Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
			Подпись.Параметры.Должность                = ПредседательКомиссии.Должность;
			Подпись.Параметры.РасшифровкаПодписи       = ПредседательКомиссии.ФИОПолные;
			
		Иначе
			
			Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
			Подпись.Параметры.Должность                = "";
			Подпись.Параметры.РасшифровкаПодписи       = "";
			
		КонецЕсли;
			
		ТабДокумент.Вывести(Подпись);
		
		// Выведем подписи членов комиссии
		ВыводитьЗаголовок = Истина;
		
		// Сначала выведем членов комиссии из выборки
		ЧислоЧленовКомиссии = 0;
		Для Каждого ЧленКомиссии Из ТаблицаИнвентаризационнаяКомиссия Цикл
			
			Если ЧленКомиссии.Председатель Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
				
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
			КонецЕсли;
			
			Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
			                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
														   "");
			Подпись.Параметры.Должность                = ЧленКомиссии.Должность;
			Подпись.Параметры.РасшифровкаПодписи       = ЧленКомиссии.ФИОПолные;
			
			ТабДокумент.Вывести(Подпись);
			
			ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
			ЧислоЧленовКомиссии = ЧислоЧленовКомиссии + 1;
			
		КонецЦикла;
		
		// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х
		// подписей, как в форме, утвержденной Госкомстатом).
		Если ЧислоЧленовКомиссии < 3 Тогда
			
			Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
				
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
			КонецЕсли;
			
			Для Итератор = (ЧислоЧленовКомиссии + 1) По 3 Цикл
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
															   "");
				Подпись.Параметры.Должность                = "";
				Подпись.Параметры.РасшифровкаПодписи       = "";
				
				ТабДокумент.Вывести(Подпись);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;
		
		КонецЕсли;

	
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);

	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВИЛС_ПечатьИНВ17_ПоПодразделениям(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСКонтрагентами_ИНВ17_ВИЛС_ПоПодразделениям";

	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДебиторыКредиторы.ВИЛС_Договор 	КАК Договор,		                        // begin fix Suetin 05.12.2019 18:23:30
	|	Договоры.Наименование			КАК НаименованиеДоговора,
	|	Договоры.НаименованиеДляПечати 	КАК НаименованиеПолноеДоговора,
	|	Договоры.Подразделение 			КАК Подразделение,							// end fix Suetin 05.12.2019 18:23:35
	|	ДебиторыКредиторы.ДебиторКредитор КАК Ссылка,                                 
	|	Контрагенты.Наименование,
	|	Контрагенты.НаименованиеПолное
	|ПОМЕСТИТЬ ДебиторыКредиторы
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДебиторыКредиторы.ДебиторКредитор = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры      // begin fix Suetin 05.12.2019 17:24:42
	|		ПО ДебиторыКредиторы.ВИЛС_Договор = Договоры.Ссылка                     // fix Suetin 05.12.2019 17:24:47
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	Организации.Наименование,
	|	Организации.НаименованиеПолное
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДебиторыКредиторы.ДебиторКредитор = Организации.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	НалоговыеОрганы.Наименование,
	|	НалоговыеОрганы.НаименованиеИФНС
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК НалоговыеОрганы
	|		ПО ДебиторыКредиторы.ДебиторКредитор = НалоговыеОрганы.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.УточнениеНаименования
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ДебиторыКредиторы.ДебиторКредитор = ФизическиеЛица.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	| 
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инвентаризация.ВидЗадолженности КАК ВидЗадолженности,
	|	Инвентаризация.ДебиторКредитор КАК Контрагент,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолное, Инвентаризация.ДебиторКредитор) КАК КонтрагентНаименованиеПолное,
	|	ЕСТЬNULL(ДебиторыКредиторы.Наименование, Инвентаризация.ДебиторКредитор) КАК КонтрагентНаименование,
	|	Инвентаризация.ВИЛС_Договор КАК Договор,           							// begin fix Suetin 05.12.2019 18:31:08
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолноеДоговора, Инвентаризация.ВИЛС_Договор) КАК ДоговорНаименованиеПолное,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеДоговора, Инвентаризация.ВИЛС_Договор) КАК ДоговорНаименование,
	|   ДебиторыКредиторы.Подразделение КАК Подразделение, 							// end fix Suetin 05.12.2019 18:31:13
	|	Инвентаризация.СчетРасчетов КАК СчетРасчетов,
	|	ПРЕДСТАВЛЕНИЕ(Инвентаризация.СчетРасчетов) КАК СчетРасчетовПредставление,
	|	МИНИМУМ(Инвентаризация.НомерСтроки) КАК НомерСтроки,
	|	СУММА(Инвентаризация.Подтверждено + Инвентаризация.НеПодтверждено) КАК Всего,
	|	СУММА(Инвентаризация.Подтверждено) КАК Подтверждено,
	|	СУММА(Инвентаризация.НеПодтверждено) КАК НеПодтверждено,
	|	СУММА(Инвентаризация.ИстекСрокДавности) КАК ИстекСрокДавности,
	|	Инвентаризация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Инвентаризация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДебиторыКредиторы КАК ДебиторыКредиторы
	|		ПО (ДебиторыКредиторы.Ссылка = Инвентаризация.ДебиторКредитор)
	|       	И (ДебиторыКредиторы.Договор = Инвентаризация.ВИЛС_Договор)
	|ГДЕ
	|	Инвентаризация.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Инвентаризация.Ссылка,
	|	Инвентаризация.ВидЗадолженности,
	|	Инвентаризация.ДебиторКредитор,
	|	Инвентаризация.ВИЛС_Договор,           										// begin fix Suetin 05.12.2019 18:31:08
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолноеДоговора, Инвентаризация.ВИЛС_Договор),
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеДоговора, Инвентаризация.ВИЛС_Договор),
	|   ДебиторыКредиторы.Подразделение, 											// end fix Suetin 05.12.2019 18:31:13
	|	Инвентаризация.СчетРасчетов,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолное, Инвентаризация.ДебиторКредитор),
	|	ЕСТЬNULL(ДебиторыКредиторы.Наименование, Инвентаризация.ДебиторКредитор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДебиторыКредиторы.Подразделение,
	|	Инвентаризация.СчетРасчетов.Порядок,                                    // begin fix Suetin 24.12.2019 14:36:40
	|	СУММА(Инвентаризация.Подтверждено + Инвентаризация.НеПодтверждено)		// fix Suetin 05.12.2019 18:32:44
	|АВТОУПОРЯДОЧИВАНИЕ
	|ИТОГИ
	|	СУММА(Всего),
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ИстекСрокДавности)
	|ПО
	|	Ссылка,
	|	Подразделение,
	|	ВидЗадолженности";
	
	РезультатКонтрагенты 	= ЗапросКонтрагенты.Выполнить();
	ВыборкаПоВидуДокумента 	= РезультатКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияРасчетов.ПФ_MXL_Инв17");
	ПервыйДокумент = Истина;

	ВыборкаШапок = ПолучитьВыборкуШапок(МассивОбъектов).Выбрать();
	
	Пока ВыборкаШапок.Следующий() Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапок.Ссылка);
		
		Если ВыборкаПоВидуДокумента.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаПоПодразделению = ВыборкаПоВидуДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
		Иначе
			Продолжить;
		КонецЕсли;
		
		Пока ВыборкаПоПодразделению.Следующий() Цикл
		
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
					
			// Варианты заголовков разделов с подписями печатной формы	
			ЗаголовокРазделаПодписей = Новый Структура();
			ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", НСтр("ru = 'Председатель комиссии';
																			|en = 'Commission chairperson'"));
			ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии",        НСтр("ru = 'Члены комиссии';
																			|en = 'Commission members'"));
			
			// Формирование шапки
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Заполнить(ВыборкаШапок);
			
			СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаШапок.Организация, ВыборкаШапок.Дата);
			Шапка.Параметры.Организация          = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации);
			Шапка.Параметры.ОрганизацияКодПоОКПО = СведенияОбОрганизации.КодПоОКПО;
			
			Шапка.Параметры.НомерДокумента = ВыборкаШапок.Номер;
			Шапка.Параметры.ДеньДокумента  = День(ВыборкаШапок.Дата);
			Шапка.Параметры.МесяцДокумента = Сред(Формат(ВыборкаШапок.Дата, "ДЛФ=ДД"), 
															 СтрНайти(Формат(ВыборкаШапок.Дата, "ДЛФ=ДД"), " "));
			Шапка.Параметры.Подразделение  = ВыборкаПоПодразделению.Подразделение;    // fix Suetin 24.12.2019 15:33:42
			
			ТабДокумент.Вывести(Шапка);

			// Формирование строк дебиторской задолженности
			ПодвалТаблицыДт = Макет.ПолучитьОбласть("ПодвалТаблицыДт");
			СтрокаТаблицыДт = Макет.ПолучитьОбласть("СтрокаТаблицыДт");
			
			ВыборкаПоВидуЗадолженности = ВыборкаПоПодразделению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		// end fix Suetin 24.12.2019 15:35:09
			
			СтруктураПоиска = Новый Структура("ВидЗадолженности", Перечисления.ТипыЗадолженности.Дебиторская);
					
			Если ВыборкаПоВидуЗадолженности.НайтиСледующий(СтруктураПоиска) Тогда

				ПодвалТаблицыДт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
				
				ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
				Пока ВыборкаПоКонтрагенту.Следующий() Цикл
					СтрокаТаблицыДт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
					// begin fix Suetin 06.12.2019 12:08:40
					//СтрокаТаблицыДт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
					//													ВыборкаПоКонтрагенту.КонтрагентНаименование, 
					//													ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
					СтрокаТаблицыДт.Параметры.КонтрагентПредставление =  
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1%2%3%4%5'"),
						?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
							ВыборкаПоКонтрагенту.КонтрагентНаименование,ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
						?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",Символы.ПС),
						?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"","("),
						?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),
						?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",")"));
					// end fix Suetin 06.12.2019 12:16:47	
					ТабДокумент.Вывести(СтрокаТаблицыДт);
				КонецЦикла;
				
			КонецЕсли;
		
			ТабДокумент.Вывести(ПодвалТаблицыДт);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			// Шапка оборотной стороны Акта
			ШапкаОборот = Макет.ПолучитьОбласть("ШапкаОборот");
			ТабДокумент.Вывести(ШапкаОборот);
			
			// Формирование строк кредиторской задолженности
			ПодвалТаблицыКт = Макет.ПолучитьОбласть("ПодвалТаблицыКт");
			СтрокаТаблицыКт = Макет.ПолучитьОбласть("СтрокаТаблицыКт");
					
			ВыборкаПоВидуЗадолженности.Сбросить();
			
			СтруктураПоиска = Новый Структура("ВидЗадолженности", Перечисления.ТипыЗадолженности.Кредиторская);
			
			Если ВыборкаПоВидуЗадолженности.НайтиСледующий(СтруктураПоиска) Тогда
									
				ПодвалТаблицыКт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
				
				ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
				Пока ВыборкаПоКонтрагенту.Следующий() Цикл
					СтрокаТаблицыКт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
					СтрокаТаблицыКт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
																			ВыборкаПоКонтрагенту.КонтрагентНаименование, 
																			ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
					ТабДокумент.Вывести(СтрокаТаблицыКт);
				КонецЦикла;
					
			КонецЕсли;
					
			ТабДокумент.Вывести(ПодвалТаблицыКт);
			
			// Подвал печатной формы
			Подвал = Макет.ПолучитьОбласть("Подвал");
			ТабДокумент.Вывести(Подвал);
			
			Подпись = Макет.ПолучитьОбласть("Подпись");
			ТаблицаИнвентаризационнаяКомиссия = ВыборкаШапок.ИнвентаризационнаяКомиссия.Выгрузить();
			
			// Выведем подпись председателя инвентаризационной комиссии
			ПредседательКомиссии = ТаблицаИнвентаризационнаяКомиссия.Найти(Истина, "Председатель");
			
			Если ПредседательКомиссии <> Неопределено Тогда
								
				Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
				Подпись.Параметры.Должность                = ПредседательКомиссии.Должность;
				Подпись.Параметры.РасшифровкаПодписи       = ПредседательКомиссии.ФИОПолные;
				
			Иначе
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
				Подпись.Параметры.Должность                = "";
				Подпись.Параметры.РасшифровкаПодписи       = "";
				
			КонецЕсли;
				
			ТабДокумент.Вывести(Подпись);
			
			// Выведем подписи членов комиссии
			ВыводитьЗаголовок = Истина;
			
			// Сначала выведем членов комиссии из выборки
			ЧислоЧленовКомиссии = 0;
			Для Каждого ЧленКомиссии Из ТаблицаИнвентаризационнаяКомиссия Цикл
				
				Если ЧленКомиссии.Председатель Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
															   "");
				Подпись.Параметры.Должность                = ЧленКомиссии.Должность;
				Подпись.Параметры.РасшифровкаПодписи       = ЧленКомиссии.ФИОПолные;
				
				ТабДокумент.Вывести(Подпись);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				ЧислоЧленовКомиссии = ЧислоЧленовКомиссии + 1;
				
			КонецЦикла;
			
			// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х
			// подписей, как в форме, утвержденной Госкомстатом).
			Если ЧислоЧленовКомиссии < 3 Тогда
				
				Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Для Итератор = (ЧислоЧленовКомиссии + 1) По 3 Цикл
					
					Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
					                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
																   "");
					Подпись.Параметры.Должность                = "";
					Подпись.Параметры.РасшифровкаПодписи       = "";
					
					ТабДокумент.Вывести(Подпись);
					
					ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
					
				КонецЦикла;
			
			КонецЕсли;

		
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
				НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);
				
		КонецЦикла; 

	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВИЛС_ПечатьИНВ17_СПодразделениями(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСКонтрагентами_ИНВ17_СПодразделениями_ВИЛС";

	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДебиторыКредиторы.ВИЛС_Договор 	КАК Договор,		                        // begin fix Suetin 05.12.2019 18:23:30
	|	Договоры.Наименование			КАК НаименованиеДоговора,
	|	Договоры.НаименованиеДляПечати 	КАК НаименованиеПолноеДоговора,
	|	Договоры.Подразделение 			КАК Подразделение,							// end fix Suetin 05.12.2019 18:23:35
	|	ДебиторыКредиторы.ДебиторКредитор КАК Ссылка,                                 
	|	Контрагенты.Наименование,
	|	Контрагенты.НаименованиеПолное
	|ПОМЕСТИТЬ ДебиторыКредиторы
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДебиторыКредиторы.ДебиторКредитор = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры      // begin fix Suetin 05.12.2019 17:24:42
	|		ПО ДебиторыКредиторы.ВИЛС_Договор = Договоры.Ссылка                     // fix Suetin 05.12.2019 17:24:47
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	Организации.Наименование,
	|	Организации.НаименованиеПолное
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДебиторыКредиторы.ДебиторКредитор = Организации.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	НалоговыеОрганы.Наименование,
	|	НалоговыеОрганы.НаименованиеИФНС
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК НалоговыеОрганы
	|		ПО ДебиторыКредиторы.ДебиторКредитор = НалоговыеОрганы.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL,  																		// begin fix Suetin 05.12.2019 18:23:49
	|	NULL,
	|	NULL,
	|	NULL,  																		// end fix Suetin 05.12.2019 18:23:53
	|	ДебиторыКредиторы.ДебиторКредитор,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.УточнениеНаименования
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК ДебиторыКредиторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ДебиторыКредиторы.ДебиторКредитор = ФизическиеЛица.Ссылка
	|ГДЕ
	|	ДебиторыКредиторы.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инвентаризация.ВидЗадолженности КАК ВидЗадолженности,
	|	Инвентаризация.ДебиторКредитор КАК Контрагент,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолное, Инвентаризация.ДебиторКредитор) КАК КонтрагентНаименованиеПолное,
	|	ЕСТЬNULL(ДебиторыКредиторы.Наименование, Инвентаризация.ДебиторКредитор) КАК КонтрагентНаименование,
	|	Инвентаризация.ВИЛС_Договор КАК Договор,           							// begin fix Suetin 05.12.2019 18:31:08
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолноеДоговора, Инвентаризация.ВИЛС_Договор) КАК ДоговорНаименованиеПолное,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеДоговора, Инвентаризация.ВИЛС_Договор) КАК ДоговорНаименование,
	|   ДебиторыКредиторы.Подразделение КАК Подразделение, 							// end fix Suetin 05.12.2019 18:31:13
	|	Инвентаризация.СчетРасчетов КАК СчетРасчетов,
	|	ПРЕДСТАВЛЕНИЕ(Инвентаризация.СчетРасчетов) КАК СчетРасчетовПредставление,
	|	МИНИМУМ(Инвентаризация.НомерСтроки) КАК НомерСтроки,
	|	СУММА(Инвентаризация.Подтверждено + Инвентаризация.НеПодтверждено) КАК Всего,
	|	СУММА(Инвентаризация.Подтверждено) КАК Подтверждено,
	|	СУММА(Инвентаризация.НеПодтверждено) КАК НеПодтверждено,
	|	СУММА(Инвентаризация.ИстекСрокДавности) КАК ИстекСрокДавности,
	|	Инвентаризация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Инвентаризация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДебиторыКредиторы КАК ДебиторыКредиторы
	|		ПО (ДебиторыКредиторы.Ссылка = Инвентаризация.ДебиторКредитор)
	|       	И (ДебиторыКредиторы.Договор = Инвентаризация.ВИЛС_Договор)
	|ГДЕ
	|	Инвентаризация.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Инвентаризация.Ссылка,
	|	Инвентаризация.ВидЗадолженности,
	|	Инвентаризация.ДебиторКредитор,
	|	Инвентаризация.ВИЛС_Договор,           										// begin fix Suetin 05.12.2019 18:31:08
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолноеДоговора, Инвентаризация.ВИЛС_Договор),
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеДоговора, Инвентаризация.ВИЛС_Договор),
	|   ДебиторыКредиторы.Подразделение, 											// end fix Suetin 05.12.2019 18:31:13
	|	Инвентаризация.СчетРасчетов,
	|	ЕСТЬNULL(ДебиторыКредиторы.НаименованиеПолное, Инвентаризация.ДебиторКредитор),
	|	ЕСТЬNULL(ДебиторыКредиторы.Наименование, Инвентаризация.ДебиторКредитор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДебиторыКредиторы.Подразделение,                                            // begin fix Suetin 25.12.2019 14:24:03
	|	СУММА(Инвентаризация.Подтверждено + Инвентаризация.НеПодтверждено),    		// end fix Suetin 25.12.2019 14:24:10
	|	Инвентаризация.СчетРасчетов.Порядок
	|АВТОУПОРЯДОЧИВАНИЕ
	|ИТОГИ
	|	СУММА(Всего),
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ИстекСрокДавности)
	|ПО
	|	Ссылка,
	|	ВидЗадолженности";
	
	РезультатКонтрагенты = ЗапросКонтрагенты.Выполнить();
	ВыборкаПоВидуДокумента = РезультатКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияРасчетов.ПФ_MXL_Инв17_ВИЛС");
	ПервыйДокумент = Истина;

	ВыборкаШапок = ПолучитьВыборкуШапок(МассивОбъектов).Выбрать();
	
	Пока ВыборкаШапок.Следующий() Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
				
		// Варианты заголовков разделов с подписями печатной формы	
		ЗаголовокРазделаПодписей = Новый Структура();
		ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", НСтр("ru = 'Председатель комиссии';
																		|en = 'Commission chairperson'"));
		ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии",        НСтр("ru = 'Члены комиссии';
																		|en = 'Commission members'"));
		
		// Формирование шапки
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Заполнить(ВыборкаШапок);
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаШапок.Организация, ВыборкаШапок.Дата);
		Шапка.Параметры.Организация          = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации);
		Шапка.Параметры.ОрганизацияКодПоОКПО = СведенияОбОрганизации.КодПоОКПО;
		
		Шапка.Параметры.НомерДокумента = ВыборкаШапок.Номер;
		Шапка.Параметры.ДеньДокумента  = День(ВыборкаШапок.Дата);
		Шапка.Параметры.МесяцДокумента = Сред(Формат(ВыборкаШапок.Дата, "ДЛФ=ДД"), 
														 СтрНайти(Формат(ВыборкаШапок.Дата, "ДЛФ=ДД"), " "));
														 
		ТабДокумент.Вывести(Шапка);

		// Формирование строк дебиторской задолженности
		ПодвалТаблицыДт = Макет.ПолучитьОбласть("ПодвалТаблицыДт");
		СтрокаТаблицыДт = Макет.ПолучитьОбласть("СтрокаТаблицыДт");
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапок.Ссылка);
		
		Если ВыборкаПоВидуДокумента.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаПоВидуЗадолженности = ВыборкаПоВидуДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			Продолжить;
		КонецЕсли;
					
		СтруктураПоиска = Новый Структура("ВидЗадолженности", Перечисления.ТипыЗадолженности.Дебиторская);
				
		Если ВыборкаПоВидуЗадолженности.НайтиСледующий(СтруктураПоиска) Тогда

			ПодвалТаблицыДт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
			
			ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
			Пока ВыборкаПоКонтрагенту.Следующий() Цикл
				СтрокаТаблицыДт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
				// begin fix Suetin 06.12.2019 12:08:40
				//СтрокаТаблицыДт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
				//													ВыборкаПоКонтрагенту.КонтрагентНаименование, 
				//													ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
				СтрокаТаблицыДт.Параметры.КонтрагентПредставление =  
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1%2%3%4%5'"),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
						ВыборкаПоКонтрагенту.КонтрагентНаименование,ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",Символы.ПС),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"","("),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),
					?(ПустаяСтрока(ВыборкаПоКонтрагенту.ДоговорНаименованиеПолное),"",")"));
				// end fix Suetin 06.12.2019 12:16:47	
				ТабДокумент.Вывести(СтрокаТаблицыДт);
			КонецЦикла;
			
		КонецЕсли;
	
		ТабДокумент.Вывести(ПодвалТаблицыДт);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка оборотной стороны Акта
		ШапкаОборот = Макет.ПолучитьОбласть("ШапкаОборот");
		ТабДокумент.Вывести(ШапкаОборот);
		
		// Формирование строк кредиторской задолженности
		ПодвалТаблицыКт = Макет.ПолучитьОбласть("ПодвалТаблицыКт");
		СтрокаТаблицыКт = Макет.ПолучитьОбласть("СтрокаТаблицыКт");
				
		ВыборкаПоВидуЗадолженности.Сбросить();
		
		СтруктураПоиска = Новый Структура("ВидЗадолженности", Перечисления.ТипыЗадолженности.Кредиторская);
		
		Если ВыборкаПоВидуЗадолженности.НайтиСледующий(СтруктураПоиска) Тогда
								
			ПодвалТаблицыКт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
			
			ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
			Пока ВыборкаПоКонтрагенту.Следующий() Цикл
				СтрокаТаблицыКт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
				СтрокаТаблицыКт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
																		ВыборкаПоКонтрагенту.КонтрагентНаименование, 
																		ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
				ТабДокумент.Вывести(СтрокаТаблицыКт);
			КонецЦикла;
				
		КонецЕсли;
				
		ТабДокумент.Вывести(ПодвалТаблицыКт);
		
		// Подвал печатной формы
		Подвал = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Подвал);
		
		Подпись = Макет.ПолучитьОбласть("Подпись");
		ТаблицаИнвентаризационнаяКомиссия = ВыборкаШапок.ИнвентаризационнаяКомиссия.Выгрузить();
		
		// Выведем подпись председателя инвентаризационной комиссии
		ПредседательКомиссии = ТаблицаИнвентаризационнаяКомиссия.Найти(Истина, "Председатель");
		
		Если ПредседательКомиссии <> Неопределено Тогда
							
			Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
			Подпись.Параметры.Должность                = ПредседательКомиссии.Должность;
			Подпись.Параметры.РасшифровкаПодписи       = ПредседательКомиссии.ФИОПолные;
			
		Иначе
			
			Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
			Подпись.Параметры.Должность                = "";
			Подпись.Параметры.РасшифровкаПодписи       = "";
			
		КонецЕсли;
			
		ТабДокумент.Вывести(Подпись);
		
		// Выведем подписи членов комиссии
		ВыводитьЗаголовок = Истина;
		
		// Сначала выведем членов комиссии из выборки
		ЧислоЧленовКомиссии = 0;
		Для Каждого ЧленКомиссии Из ТаблицаИнвентаризационнаяКомиссия Цикл
			
			Если ЧленКомиссии.Председатель Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
				
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
			КонецЕсли;
			
			Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
			                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
														   "");
			Подпись.Параметры.Должность                = ЧленКомиссии.Должность;
			Подпись.Параметры.РасшифровкаПодписи       = ЧленКомиссии.ФИОПолные;
			
			ТабДокумент.Вывести(Подпись);
			
			ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
			ЧислоЧленовКомиссии = ЧислоЧленовКомиссии + 1;
			
		КонецЦикла;
		
		// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х
		// подписей, как в форме, утвержденной Госкомстатом).
		Если ЧислоЧленовКомиссии < 3 Тогда
			
			Если НЕ ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
				
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
			КонецЕсли;
			
			Для Итератор = (ЧислоЧленовКомиссии + 1) По 3 Цикл
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
															   "");
				Подпись.Параметры.Должность                = "";
				Подпись.Параметры.РасшифровкаПодписи       = "";
				
				ТабДокумент.Вывести(Подпись);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;
		
		КонецЕсли;

	
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);

	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Реестр дебиторской задолженности. 
//	Приложение 7.1. (табличный документ 1С:Предприятия)
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приказа.
//
Функция ПечатьРеестрДебиторскойЗадолженностиПриложение_7_1(Знач МассивОбъектов, Знач ОбъектыПечати)
	ДтКт = "Дт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСконтрагентами_Дбт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	ТекстЗапроса = ПолучитьТекстЗапроса(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр дебиторской задолженности");
	ТекстЗаголовка.Добавить("Дебиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Сумма ДЗ без учета резерва, руб.");
	ТекстЗаголовка.Добавить("Дата возникновения ДЗ");
	ТекстЗаголовка.Добавить("Дата погашения ДЗ по договору");
	ТекстЗаголовка.Добавить("ДЗ по срокам возникновения,  в т.ч.:");
	
	Возврат(ПечатьРеестрЗадолженностиПриложение_7_1(МассивОбъектов, ОбъектыПечати, ТабДокумент, ДтКт, Макет, ТекстЗапроса, ТекстЗаголовка));
КонецФункции

Функция ПечатьРеестрДебиторскойЗадолженностиСЗаказамиПриложение_7_1(Знач МассивОбъектов, Знач ОбъектыПечати)
	ДтКт = "Дт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСконтрагентамиСЗаказами_Дбт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	ТекстЗапроса = ПолучитьТекстЗапросаСЗаказами(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр дебиторской задолженности (с заказами)");
	ТекстЗаголовка.Добавить("Дебиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Сумма ДЗ без учета резерва, руб.");
	ТекстЗаголовка.Добавить("Дата возникновения ДЗ");
	ТекстЗаголовка.Добавить("Дата погашения ДЗ по договору");
	ТекстЗаголовка.Добавить("ДЗ по срокам возникновения,  в т.ч.:");
	
	Возврат(ПечатьРеестрЗадолженностиПриложение_7_1(МассивОбъектов, ОбъектыПечати, ТабДокумент, ДтКт, Макет, ТекстЗапроса, ТекстЗаголовка));
КонецФункции

Функция ПечатьРеестрКредиторскойЗадолженностиПриложение_7_1(Знач МассивОбъектов, Знач ОбъектыПечати)
	ДтКт = "Кт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСконтрагентами_Крт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	ТекстЗапроса = ПолучитьТекстЗапроса(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр кредиторской задолженности");
	ТекстЗаголовка.Добавить("Кредиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Сумма КЗ без учета резерва, руб.");
	ТекстЗаголовка.Добавить("Дата возникновения КЗ");
	ТекстЗаголовка.Добавить("Дата погашения КЗ по договору");
	ТекстЗаголовка.Добавить("КЗ по срокам возникновения,  в т.ч.:");
	
	Возврат(ПечатьРеестрЗадолженностиПриложение_7_1(МассивОбъектов, ОбъектыПечати, ТабДокумент, ДтКт, Макет, ТекстЗапроса, ТекстЗаголовка));
КонецФункции

Функция ПечатьРеестрКредиторскойЗадолженностиСЗаказамиПриложение_7_1(Знач МассивОбъектов, Знач ОбъектыПечати)
	ДтКт = "Кт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовСконтрагентамиСЗаказами_Крт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрЗадолженностиПриложение_7_1");
	ТекстЗапроса = ПолучитьТекстЗапросаСЗаказами(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр кредиторской задолженности (с заказами)");
	ТекстЗаголовка.Добавить("Кредиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Сумма КЗ без учета резерва, руб.");
	ТекстЗаголовка.Добавить("Дата возникновения КЗ");
	ТекстЗаголовка.Добавить("Дата погашения КЗ по договору");
	ТекстЗаголовка.Добавить("КЗ по срокам возникновения,  в т.ч.:");
	
	Возврат(ПечатьРеестрЗадолженностиПриложение_7_1(МассивОбъектов, ОбъектыПечати, ТабДокумент, ДтКт, Макет, ТекстЗапроса, ТекстЗаголовка));
КонецФункции

Функция ПечатьРеестрЗадолженностиПриложение_7_1(Знач МассивОбъектов, Знач ОбъектыПечати, ТабДокумент, Знач ДтКт = "Дт", Знач Макет, Знач ТекстЗапроса, Знач ТекстЗаголовка)
	ПервыйДокумент = Истина;
	
	Для каждого СсылкаОбъекта Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", СсылкаОбъекта);
		Запрос.Текст = ТекстЗапроса;
		ДатаДокументаИнветаризации = КонецДня(СсылкаОбъекта.Дата);
		Запрос.УстановитьПараметр("КонПериода", 		Новый Граница(ДатаДокументаИнветаризации, ВидГраницы.Включая));
		//Запрос.УстановитьПараметр("КонПериода1", 		Новый Граница(ДатаДокументаИнветаризации, ВидГраницы.Включая));
		
		ПакетЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		ВыборкаШапка = ПакетЗапросов[0].Выбрать();
		Если НЕ ВыборкаШапка.Следующий() Тогда
			Возврат ТабДокумент;
		КонецЕсли;
		//ДатаДокументаИнветаризации = КонецДня(ВыборкаШапка.Дата);
		
		Область = Макет.ПолучитьОбласть("Шапка");
				
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаШапка);
		ТекстЗаголовкаКоличество = ТекстЗаголовка.Количество() - 1;
		Для Ном = 0 По ТекстЗаголовкаКоличество Цикл
			Область.Параметры["ТекстЗаголовка" + Ном] = ТекстЗаголовка[Ном];
		КонецЦикла;	
		Область.Параметры.Дата  			= Формат(ДатаДокументаИнветаризации, "ДФ=dd.MM.yyyy");	
		
		ТабДокумент.Вывести(Область);
		ТабДокумент.ФиксацияСверху = 5;
		
		СтруктураПоказателей = Новый Структура;
		СтруктураПоказателей.Вставить("НПП"								, 1);
		СтруктураПоказателей.Вставить("СуммаДЗБезРезерваИтого"			, 0);
		СтруктураПоказателей.Вставить("СуммаРезерва"					, 0);
		СтруктураПоказателей.Вставить("СуммаРезерваИтого"				, 0);
		СтруктураПоказателей.Вставить("СуммаДЗСРезервомИтого"			, 0);
		СтруктураПоказателей.Вставить("Колонка12ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка12ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка13ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка14ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка15ЧИтого"					, 0);   
		СтруктураПоказателей.Вставить("Колонка16ЧИтого"					, 0);    
		СтруктураПоказателей.Вставить("Колонка17ЧИтого"					, 0);    
		СтруктураПоказателей.Вставить("СуммаРезерваНУЧ"					, 0); 
		СтруктураПоказателей.Вставить("СуммаРезерваНУЧИтого"			, 0);  
		СтруктураПоказателей.Вставить("СуммаДЗБезРезерваПоСчетуИтого"	, 0); 
		СтруктураПоказателей.Вставить("СуммаРезерваПоСчетуИтого"		, 0);   
		СтруктураПоказателей.Вставить("СуммаДЗСРезервомПоСчетуИтого"	, 0);  
		СтруктураПоказателей.Вставить("Колонка12ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("Колонка13ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка14ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("Колонка15ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка16ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка17ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("СуммаРезерваНУЧПоСчетуИтого"		, 0);
		
		
		
		ТаблицаСтрокПоСчету = Новый ТаблицаЗначений();
		Колонки = ТаблицаСтрокПоСчету.Колонки;
		Колонки.Добавить("СчетИерархия");
		Колонки.Добавить("СчетГруппировка");
		Колонки.Добавить("СчетРасчетов");
		Колонки.Добавить("СтрокаИерархия");
		Колонки.Добавить("СтрокаГруппировка");
		Колонки.Добавить("СтрокаРасчетов");
		Колонки.Добавить("СтрокаДетальная");
		
		КоличествоВСтеке=0;
		ТекущийСчет				 = Неопределено;
		//ТекущийСчетПервогоУровня = Неопределено;
		//ТекущийСчетВторогоУровня = Неопределено;
		Выборка_3 				= ПакетЗапросов[3].Выбрать();
		ВыборкаДокументов 		= ПакетЗапросов[5].Выгрузить();
		ВыборкаЗадолженность 	= ПакетЗапросов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "СчетРасчетов");
		ВыборкаОстатков 		= ПакетЗапросов[7].Выгрузить(); // fix Suetin 01.07.2019 14:10:09  .Выбрать();
		ВыбратьЭлементыВИерархии(ВыборкаЗадолженность, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке);        //ВыборкаОстатков, 
		
		Если ТаблицаСтрокПоСчету.Количество() > 1 Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету");
			ОбластьСтрока.Параметры.Итого			 	= "Итого по счету: " + ТаблицаСтрокПоСчету[0].СчетИерархия;
			ОбластьСтрока.Параметры.СуммаДЗБезРезерва 	= СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого;
			ОбластьСтрока.Параметры.СуммаРезерва		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
			ОбластьСтрока.Параметры.СуммаДЗСРезервом	= СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка12Ч			= СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка13Ч			= СтруктураПоказателей.Колонка13ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка14Ч			= СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка15Ч			= СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка16Ч			= СтруктураПоказателей.Колонка16ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка17Ч			= СтруктураПоказателей.Колонка17ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.СуммаРезерваНУ		= СтруктураПоказателей.СуммаРезерваНУЧПоСчетуИтого;
			
			СтруктураПоказателей.СуммаДЗБезРезерваИтого = СтруктураПоказателей.СуммаДЗБезРезерваИтого 	+ СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого;
			СтруктураПоказателей.СуммаРезерваИтого 		= СтруктураПоказателей.СуммаРезерваИтого 		+ СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
			СтруктураПоказателей.СуммаДЗСРезервомИтого 	= СтруктураПоказателей.СуммаДЗСРезервомИтого 	+ СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого;
			СтруктураПоказателей.Колонка12ЧИтого 		= СтруктураПоказателей.Колонка12ЧИтого 			+ СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка13ЧИтого 		= СтруктураПоказателей.Колонка13ЧИтого 			+ СтруктураПоказателей.Колонка13ЧПоСчетуИтого;	
			СтруктураПоказателей.Колонка14ЧИтого 		= СтруктураПоказателей.Колонка14ЧИтого 			+ СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка15ЧИтого 		= СтруктураПоказателей.Колонка15ЧИтого 			+ СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка16ЧИтого 		= СтруктураПоказателей.Колонка16ЧИтого 			+ СтруктураПоказателей.Колонка16ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка17ЧИтого 		= СтруктураПоказателей.Колонка17ЧИтого 			+ СтруктураПоказателей.Колонка17ЧПоСчетуИтого;
			СтруктураПоказателей.СуммаРезерваНУЧИтого	= СтруктураПоказателей.СуммаРезерваНУЧИтого 	+ СтруктураПоказателей.СуммаРезерваНУЧПоСчетуИтого;
				
			ТабДокумент.Вывести(ОбластьСтрока);
			ТабДокумент.НачатьГруппуСтрок("ИтогоПоСчету" + ТаблицаСтрокПоСчету[0].СчетИерархия, Ложь);
		
			ГруппировкаВыводилась = Ложь;
			Для Инд = 0 По ТаблицаСтрокПоСчету.Количество() - 1 Цикл
				Для Инд1 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов.Количество() - 1 Цикл
					ТабДокумент.Вывести(ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов[Инд1]);
					ТабДокумент.НачатьГруппуСтрок("ИтогоПодоговору" + ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов[Инд1].Параметры.Договор, Ложь);
					Для Инд2 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1].Количество() - 1 Цикл
						Если ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2] = Неопределено Тогда Продолжить; КонецЕсли;
						ТабДокумент.Вывести(ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2]);
					КонецЦикла;	          
					ТабДокумент.ЗакончитьГруппуСтрок();
				КонецЦикла;	
			КонецЦикла;
			ТабДокумент.ЗакончитьГруппуСтрок();
		КонецЕсли;	
				
		ОблИтого = Макет.ПолучитьОбласть("Итого");
		ОблИтого.Параметры.Итого			 = "Итого:";
		ОблИтого.Параметры.СуммаДЗБезРезерва = формат(СтруктураПоказателей.СуммаДЗБезРезерваИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.СуммаРезерва 	 = формат(СтруктураПоказателей.СуммаРезерваИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.СуммаДЗСРезервом  = формат(СтруктураПоказателей.СуммаДЗСРезервомИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка12Ч 	 	 = формат(СтруктураПоказателей.Колонка12ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка13Ч 	 	 = формат(СтруктураПоказателей.Колонка13ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка14Ч 	 	 = формат(СтруктураПоказателей.Колонка14ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка15Ч 	 	 = формат(СтруктураПоказателей.Колонка15ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка16Ч 	 	 = формат(СтруктураПоказателей.Колонка16ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка17Ч 	 	 = формат(СтруктураПоказателей.Колонка17ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.СуммаРезерваНУ	 = формат(СтруктураПоказателей.СуммаРезерваНУЧИтого, "ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Вывести(ОблИтого);
		
		//ОблПод = Макет.ПолучитьОбласть("Подвал");
		//Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ВыборкаШапка.Организация, ДатаДокументаИнветаризации,);
		//ОблПод.Параметры.Бухгалтер    = Руководители.ГлавныйБухгалтер;
		//ТабДокумент.Вывести(ОблПод);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаОбъекта);
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции // ПечатьРеестрЗадолженностиПриложение_7_1()

Процедура ВыбратьЭлементыВИерархии(ВыборкаСИерархией, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке)  //ВыборкаОстатков, 
	Пока ВыборкаСИерархией.Следующий() Цикл
		Если ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			Если ТаблицаСтрокПоСчету.Количество() > 1 
				и Не ЗначениеЗаполнено(ВыборкаСИерархией.СчетРасчетов.Родитель) Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету");
				ОбластьСтрока.Параметры.Итого			 	= "Итого по счету: " + ТаблицаСтрокПоСчету[0].СчетИерархия;
				ОбластьСтрока.Параметры.СуммаДЗБезРезерва 	= СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого;
				ОбластьСтрока.Параметры.СуммаРезерва		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
				ОбластьСтрока.Параметры.СуммаДЗСРезервом	= СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка12Ч			= СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка13Ч			= СтруктураПоказателей.Колонка13ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка14Ч			= СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка15Ч			= СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка16Ч			= СтруктураПоказателей.Колонка16ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка17Ч			= СтруктураПоказателей.Колонка17ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.СуммаРезерваНУ		= СтруктураПоказателей.СуммаРезерваНУЧПоСчетуИтого;
				
				ТабДокумент.Вывести(ОбластьСтрока);
				ТабДокумент.НачатьГруппуСтрок("ИтогоПоСчету" + ТаблицаСтрокПоСчету[0].СчетИерархия, Ложь);
				
				ГруппировкаВыводилась = Ложь;
				Для Инд = 0 По ТаблицаСтрокПоСчету.Количество() - 1 Цикл
					Для Инд1 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов.Количество() - 1 Цикл
						ТабДокумент.Вывести(ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов[Инд1]);
						ТабДокумент.НачатьГруппуСтрок("ИтогоПодоговору" + ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов[Инд1].Параметры.Договор, Ложь);
						Для Инд2 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1].Количество() - 1 Цикл
							Если ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2] = Неопределено Тогда Продолжить; КонецЕсли;
							ТабДокумент.Вывести(ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2]);
						КонецЦикла;	          
						ТабДокумент.ЗакончитьГруппуСтрок();
					КонецЦикла;	
				КонецЦикла;
				ТабДокумент.ЗакончитьГруппуСтрок();
				
				СтруктураПоказателей.СуммаДЗБезРезерваИтого = СтруктураПоказателей.СуммаДЗБезРезерваИтого 	+ СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого;
				СтруктураПоказателей.СуммаРезерваИтого 		= СтруктураПоказателей.СуммаРезерваИтого 		+ СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
				СтруктураПоказателей.СуммаДЗСРезервомИтого 	= СтруктураПоказателей.СуммаДЗСРезервомИтого 	+ СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого;
				СтруктураПоказателей.Колонка12ЧИтого 		= СтруктураПоказателей.Колонка12ЧИтого 			+ СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка13ЧИтого 		= СтруктураПоказателей.Колонка13ЧИтого 			+ СтруктураПоказателей.Колонка13ЧПоСчетуИтого;	
				СтруктураПоказателей.Колонка14ЧИтого 		= СтруктураПоказателей.Колонка14ЧИтого 			+ СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка15ЧИтого 		= СтруктураПоказателей.Колонка15ЧИтого 			+ СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка16ЧИтого 		= СтруктураПоказателей.Колонка16ЧИтого 			+ СтруктураПоказателей.Колонка16ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка17ЧИтого 		= СтруктураПоказателей.Колонка17ЧИтого 			+ СтруктураПоказателей.Колонка17ЧПоСчетуИтого;
				СтруктураПоказателей.СуммаРезерваНУЧИтого	= СтруктураПоказателей.СуммаРезерваНУЧИтого 	+ СтруктураПоказателей.СуммаРезерваНУЧПоСчетуИтого;
				
				СтруктураПоказателей.Вставить("СуммаРезерва"					, 0);
				СтруктураПоказателей.Вставить("СуммаРезерваНУЧ"					, 0); 
				СтруктураПоказателей.Вставить("СуммаДЗБезРезерваПоСчетуИтого"	, 0); 
				СтруктураПоказателей.Вставить("СуммаРезерваПоСчетуИтого"		, 0);   
				СтруктураПоказателей.Вставить("СуммаДЗСРезервомПоСчетуИтого"	, 0);  
				СтруктураПоказателей.Вставить("Колонка12ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("Колонка13ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка14ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("Колонка15ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка16ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка17ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("СуммаРезерваНУЧПоСчетуИтого"		, 0);
			КонецЕсли;
			Если ТаблицаСтрокПоСчету.Количество() и ВыборкаСИерархией.СчетРасчетов.Родитель = ТаблицаСтрокПоСчету[0].СчетИерархия Тогда
				СтрокаТЗ = ТаблицаСтрокПоСчету[ТаблицаСтрокПоСчету.Количество() - 1];
				СтрокаТЗ.СчетГруппировка = ВыборкаСИерархией.СчетРасчетов;
			Иначе	
				ТаблицаСтрокПоСчету.Очистить();
				СтрокаТЗ = ТаблицаСтрокПоСчету.Добавить();
				СтрокаТЗ.СчетИерархия = ВыборкаСИерархией.СчетРасчетов;
				СтрокаТЗ.СтрокаИерархия = ОбластьСтрока;
				СтрокаТЗ.СтрокаРасчетов = Новый Массив();
				СтрокаТЗ.СтрокаДетальная = Новый Массив(1, 1);
			КонецЕсли;	
			
			ВыбратьЭлементыВИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"СчетРасчетов"), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке);	//ВыборкаОстатков, 
			//ВыбратьЭлементыВИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СчетРасчетов"), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке);	//ВыборкаОстатков, 
		ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			//ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету");
			//ОбластьСтрока.Параметры.Итого			 	= "Итого по счету: " + ВыборкаСИерархией.СчетРасчетов;
			//ОбластьСтрока.Параметры.СуммаДЗБезРезерва 	= СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого;
			//ОбластьСтрока.Параметры.СуммаРезерва		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
			//ОбластьСтрока.Параметры.СуммаДЗСРезервом	= СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка12Ч			= СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка13Ч			= СтруктураПоказателей.Колонка13ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка14Ч			= СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка15Ч			= СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка16Ч			= СтруктураПоказателей.Колонка16ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка17Ч			= СтруктураПоказателей.Колонка17ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.СуммаРезерваНУ		= СтруктураПоказателей.СуммаРезерваНУЧПоСчетуИтого;
			
			СтрокаТЗ = ТаблицаСтрокПоСчету[ТаблицаСтрокПоСчету.Количество() - 1];
			СтрокаТЗ.СчетГруппировка = ВыборкаСИерархией.СчетРасчетов;
			//СтрокаТЗ.СтрокаГруппировка = ОбластьСтрока;
			
			ВыбратьЭлементыБезИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке);	//ВыборкаОстатков, 
		ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
      		ВыбратьЭлементы(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.Прямой), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, КоличествоВСтеке);	 //ВыборкаОстатков, 
    	КонецЕсли;   
  	КонецЦикла;
КонецПроцедуры

Процедура ВыбратьЭлементыБезИерархии(ВыборкаБезИерархии, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке)     //ВыборкаОстатков, 
	Пока ВыборкаБезИерархии.Следующий() Цикл
		СуммаДЗБезРезерва = ВыборкаБезИерархии.Подтверждено + ВыборкаБезИерархии.НеПодтверждено;
		Если СуммаДЗБезРезерва = 0 Тогда Продолжить; КонецЕсли;
		
		//МассивСтрокОстатковПоДоговору = ВыборкаОстатков.НайтиСтроки(СтруктураПоиска);
		
		Выборка_3.Сбросить();
		
		ДанныеОДок = ПолучитьДанныеСтроки(ВыборкаШапка, ВыборкаБезИерархии, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ДтКт, СуммаДЗБезРезерва); 
		
		ТЗДляСтруктуры = ДанныеОДок.ТЗДляСтруктуры;
		КоличествоСтрокТЗДляСтруктуры = ТЗДляСтруктуры.Количество();
		Если КоличествоСтрокТЗДляСтруктуры = 0 Тогда Продолжить; КонецЕсли; 
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(ДанныеОДок);
		//ОбластьСтрока.Параметры.НомерСтроки = НПП;
		СтруктураПоказателей.НПП = СтруктураПоказателей.НПП + 1;
		
		СведенияОбКонтрагенте = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаБезИерархии.Контрагент, ВыборкаШапка.КонецПериода);
		КонтраНаим = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование, ЮридическийАдрес, Телефоны");
		
		ОбластьСтрока.Параметры.НаименованиеСтр = КонтраНаим;
		ОбластьСтрока.Параметры.Счет = ВыборкаБезИерархии.СчетРасчетов;
		ОбластьСтрока.Параметры.НомерДоговора = ?(ЗначениеЗаполнено(ВыборкаБезИерархии.Договор),?(ЗначениеЗаполнено(ВыборкаБезИерархии.Договор.Номер), ВыборкаБезИерархии.Договор.Номер, ВыборкаБезИерархии.Договор.Наименование), "б.н.");
		ОбластьСтрока.Параметры.ДатаДоговора = ?(ЗначениеЗаполнено(ВыборкаБезИерархии.Договор),ВыборкаБезИерархии.Договор.Дата, Дата(1,1,1,0,0,0));
		ОбластьСтрока.Параметры.ИНН = ВыборкаБезИерархии.Контрагент.ИНН;
		
		Если КоличествоСтрокТЗДляСтруктуры = 1 Тогда
			ОбластьСтрока.Параметры.ДатаДолга 		= ТЗДляСтруктуры[0].ДатаДок;
			ОбластьСтрока.Параметры.ДатаПогашенияДЗ = ТЗДляСтруктуры[0].ДатаПогашенияДЗСтр;
		Иначе
			КТЗ = ТЗДляСтруктуры.Скопировать(, "ДатаДок, ДатаПогашенияДЗ, ДатаПогашенияДЗСтр");
			КТЗ.Сортировать("ДатаДок Возр");
			Для Каждого СтрокаКТЗ Из КТЗ Цикл
				Если Не ЗначениеЗаполнено(СтрокаКТЗ.ДатаДок) Тогда Продолжить; КонецЕсли;
				ОбластьСтрока.Параметры.ДатаДолга 		= СтрокаКТЗ.ДатаДок;
				ОбластьСтрока.Параметры.ДатаПогашенияДЗ = СтрокаКТЗ.ДатаПогашенияДЗСтр;
				КТЗ = Неопределено;
				Прервать;
			КонецЦикла;	
		КонецЕсли;	
		
		//СуммаДЗБезРезерва 							= ВыборкаБезИерархии.Подтверждено + ВыборкаБезИерархии.НеПодтверждено;
		//Если СуммаДЗБезРезерва = 0 Тогда Продолжить; КонецЕсли;
		СуммаРезерва 								= ДанныеОДок.СуммаРезерва;
		СуммаДЗСРезервом                            = СуммаДЗБезРезерва - СуммаРезерва;
		ОбластьСтрока.Параметры.СуммаДЗБезРезерва 	= СуммаДЗБезРезерва;
		ОбластьСтрока.Параметры.СуммаРезерва        = СуммаРезерва;
		ОбластьСтрока.Параметры.СуммаДЗСРезервом 	= СуммаДЗСРезервом;
		
		ОбластьСтрока.Параметры.Колонка12Ч = 0;
		ОбластьСтрока.Параметры.Колонка13Ч = 0;
		ОбластьСтрока.Параметры.Колонка14Ч = 0;
		ОбластьСтрока.Параметры.Колонка15Ч = 0;
		ОбластьСтрока.Параметры.Колонка16Ч = 0; 
		ОбластьСтрока.Параметры.Колонка17Ч = 0;
		Для каждого СтрТЗ Из ТЗДляСтруктуры Цикл
			ОбластьСтрока.Параметры.Колонка12Ч = ОбластьСтрока.Параметры.Колонка12Ч + СтрТЗ.Колонка12;
			ОбластьСтрока.Параметры.Колонка13Ч = ОбластьСтрока.Параметры.Колонка13Ч + СтрТЗ.Колонка13;
			ОбластьСтрока.Параметры.Колонка14Ч = ОбластьСтрока.Параметры.Колонка14Ч + СтрТЗ.Колонка14;
			ОбластьСтрока.Параметры.Колонка15Ч = ОбластьСтрока.Параметры.Колонка15Ч + СтрТЗ.Колонка15;
			ОбластьСтрока.Параметры.Колонка16Ч = ОбластьСтрока.Параметры.Колонка16Ч + СтрТЗ.Колонка16;
			ОбластьСтрока.Параметры.Колонка17Ч = ОбластьСтрока.Параметры.Колонка17Ч + СтрТЗ.Колонка17;
		КонецЦикла;
		
		Если 	Не ?(ОбластьСтрока.Параметры.СуммаДЗБезРезерва  = Неопределено, 0, ОбластьСтрока.Параметры.СуммаДЗБезРезерва) = 0 
			или Не ?(ОбластьСтрока.Параметры.СуммаРезерва  		= Неопределено, 0, ОбластьСтрока.Параметры.СуммаРезерва) = 0
			или Не ?(ОбластьСтрока.Параметры.СуммаДЗСРезервом  	= Неопределено, 0, ОбластьСтрока.Параметры.СуммаДЗСРезервом) = 0
			или Не ?(ОбластьСтрока.Параметры.Колонка12Ч  		= Неопределено, 0, ОбластьСтрока.Параметры.Колонка12Ч) = 0
			или Не ?(ОбластьСтрока.Параметры.Колонка13Ч  		= Неопределено, 0, ОбластьСтрока.Параметры.Колонка13Ч) = 0
			или Не ?(ОбластьСтрока.Параметры.Колонка14Ч  		= Неопределено, 0, ОбластьСтрока.Параметры.Колонка14Ч) = 0
			или Не ?(ОбластьСтрока.Параметры.Колонка15Ч  		= Неопределено, 0, ОбластьСтрока.Параметры.Колонка15Ч) = 0
			или Не ?(ОбластьСтрока.Параметры.Колонка16Ч  		= Неопределено, 0, ОбластьСтрока.Параметры.Колонка16Ч) = 0
			или Не ?(ОбластьСтрока.Параметры.Колонка17Ч  		= Неопределено, 0, ОбластьСтрока.Параметры.Колонка17Ч) = 0
			или Не ?(ОбластьСтрока.Параметры.СуммаРезерваНУ  	= Неопределено, 0, ОбластьСтрока.Параметры.СуммаРезерваНУ) = 0
			Тогда
			СтрокаТЗ1 = ТаблицаСтрокПоСчету[ТаблицаСтрокПоСчету.Количество() - 1];
			Если ЗначениеЗаполнено(СтрокаТЗ1.СчетРасчетов) тогда
				СтрокаТЗ = ТаблицаСтрокПоСчету.Добавить();
				СтрокаТЗ.СчетИерархия 		= СтрокаТЗ1.СчетИерархия;
				СтрокаТЗ.СчетГруппировка 	= СтрокаТЗ1.СчетГруппировка;
				СтрокаТЗ.СчетРасчетов 		= ВыборкаБезИерархии.СчетРасчетов;
				СтрокаТЗ.СтрокаРасчетов = Новый Массив();
				СтрокаТЗ.СтрокаДетальная = Новый Массив(100, 1);
			Иначе
				СтрокаТЗ = СтрокаТЗ1;
				СтрокаТЗ.СчетРасчетов 		= ВыборкаБезИерархии.СчетРасчетов;
			КонецЕсли;	
			СтрокаТЗ.СтрокаРасчетов.Добавить(ОбластьСтрока);
			//Если СтрокаТЗ.СтрокаДетальная = Неопределено Тогда
			//	СтрокаТЗ.СтрокаДетальная = Новый Массив(100, 100);
			//КонецЕсли;	
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтруктураПоказателей.Колонка12ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка12ЧПоСчетуИтого 	+ ОбластьСтрока.Параметры.Колонка12Ч;
		СтруктураПоказателей.Колонка13ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка13ЧПоСчетуИтого 	+ ОбластьСтрока.Параметры.Колонка13Ч;
		СтруктураПоказателей.Колонка14ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка14ЧПоСчетуИтого 	+ ОбластьСтрока.Параметры.Колонка14Ч;
		СтруктураПоказателей.Колонка15ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка15ЧПоСчетуИтого 	+ ОбластьСтрока.Параметры.Колонка15Ч;
		СтруктураПоказателей.Колонка16ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка16ЧПоСчетуИтого 	+ ОбластьСтрока.Параметры.Колонка16Ч;
		СтруктураПоказателей.Колонка17ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка17ЧПоСчетуИтого 	+ ОбластьСтрока.Параметры.Колонка17Ч;
		
		СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого = СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого + СуммаДЗБезРезерва;
		СтруктураПоказателей.СуммаРезерваПоСчетуИтого 	= СтруктураПоказателей.СуммаРезерваПоСчетуИтого + СуммаРезерва;
		СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого = СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого + СуммаДЗСРезервом;
		
		Для каждого СтрокаТЗДляСтруктуры Из ТЗДляСтруктуры Цикл
			ОбластьСтрокаД = Макет.ПолучитьОбласть("СтрокаДетальная");
			ОбластьСтрокаД.Параметры.ДатаДолга 					= СтрокаТЗДляСтруктуры.ДатаДок;      // может соединить в одно (и остальные строки...)
			ОбластьСтрокаД.Параметры.ЗаЧто 						= СтрокаТЗДляСтруктуры.ЗаЧто;
			ОбластьСтрокаД.Параметры.Регистратор				= СтрокаТЗДляСтруктуры.Регистратор;
			ОбластьСтрокаД.Параметры.РегистраторПредставление	= СтрокаТЗДляСтруктуры.РегистраторПредставление;
			ОбластьСтрокаД.Параметры.Колонка12Ч 				= СтрокаТЗДляСтруктуры.Колонка12;
			ОбластьСтрокаД.Параметры.Колонка13Ч 				= СтрокаТЗДляСтруктуры.Колонка13;
			ОбластьСтрокаД.Параметры.Колонка14Ч 				= СтрокаТЗДляСтруктуры.Колонка14;
			ОбластьСтрокаД.Параметры.Колонка15Ч 				= СтрокаТЗДляСтруктуры.Колонка15;
			ОбластьСтрокаД.Параметры.Колонка16Ч 				= СтрокаТЗДляСтруктуры.Колонка16;
			ОбластьСтрокаД.Параметры.Колонка17Ч 				= СтрокаТЗДляСтруктуры.Колонка17;
			Если СтрокаТЗ.СтрокаДетальная[СтрокаТЗ.СтрокаРасчетов.ВГраница()][0] = Неопределено Тогда
				СтрокаТЗ.СтрокаДетальная[СтрокаТЗ.СтрокаРасчетов.ВГраница()].Вставить(0, ОбластьСтрокаД);
			Иначе	
				СтрокаТЗ.СтрокаДетальная[СтрокаТЗ.СтрокаРасчетов.ВГраница()].Добавить(ОбластьСтрокаД);
			КонецЕсли;	
		КонецЦикла;
		
		
	КонецЦикла;
КонецПроцедуры

Процедура ВыбратьЭлементы(Выборка, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, КоличествоВСтеке)    //ВыборкаОстатков, 
	//Пока Выборка.Следующий() Цикл
    // Вставить обработку выборки ВыборкаБезИерархии
	//КонецЦикла;
КонецПроцедуры

Функция ПолучитьДанныеСтроки(Знач ВыборкаШапка, Знач ВыборкаБезИерархии, Знач ВыборкаДокументов, Знач ВыборкаОстатков, Знач Выборка_3, Знач ДтКт = "Дт", Знач СуммаДолгаПоДоговору = 0, Знач Просроченная = Ложь, Знач ДанныеОДокПросроч = Неопределено) 
	КонПериода 		= ВыборкаШапка.КонецПериода;
	Организация 	= ВыборкаШапка.Организация;
	Счет            = ВыборкаБезИерархии.СчетРасчетов;
	Контрагент		= ВыборкаБезИерархии.Контрагент;
	Договор			= ВыборкаБезИерархии.Договор;
	ЗаЧто = ?(ЗначениеЗаполнено(Договор) и (ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") или ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")), Договор.СтатьяДвиженияДенежныхСредств, "");
	
	СуммаРезерва 	= ПолучитьРезерв(Счет, Контрагент, Договор, Выборка_3);
	СтруктураСтроки = Новый Структура;     //Просроченная 
	
	ТЗДляСтруктуры = новый ТаблицаЗначений;
	//ТЗДляСтруктуры.Колонки.Добавить("ТипДокумента");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаДок");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаДокСист");
	//ТЗДляСтруктуры.Колонки.Добавить("НомерДок");
	ТЗДляСтруктуры.Колонки.Добавить("ЗаЧто");
	ТЗДляСтруктуры.Колонки.Добавить("ОбъектРасчетов");
	ТЗДляСтруктуры.Колонки.Добавить("ПроверятьГалочку");
	ТЗДляСтруктуры.Колонки.Добавить("Регистратор");
	ТЗДляСтруктуры.Колонки.Добавить("РегистраторПредставление");
	
	ТЗДляСтруктуры.Колонки.Добавить("ДатаПогашенияДЗ");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаПогашенияДЗСтр");
	
	ТЗДляСтруктуры.Колонки.Добавить("Колонка12", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка13", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка14", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка15", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка16", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка17", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
	МассивСчетов = Новый Массив();
	МассивСчетов.Добавить(ВыборкаБезИерархии.СчетРасчетов);
	Если ЗначениеЗаполнено(ВыборкаБезИерархии.Договор) и ТипЗнч(ВыборкаБезИерархии.Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Если ВыборкаБезИерархии.Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			и ВыборкаБезИерархии.СчетРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
			СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаБезИерархии.Контрагент, ВыборкаБезИерархии.Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
			СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
		ИначеЕсли ВыборкаБезИерархии.Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			и ВыборкаБезИерархии.СчетРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
			СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаБезИерархии.Контрагент, ВыборкаБезИерархии.Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
			СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
		КонецЕсли; 
	КонецЕсли;
	//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаЗадолженность.Контрагент, ВыборкаЗадолженность.Договор, МассивСчетов);
	СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаБезИерархии.Контрагент, ВыборкаБезИерархии.Договор, ВыборкаБезИерархии.СчетРасчетов);
	СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
		Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
			Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
				СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СписокОбъектовРасчета = Новый СписокЗначений();
	Для Каждого ЭлМассива Из СписокСтрокПоТекущейЗадолженности Цикл
		Если Не СписокОбъектовРасчета.НайтиПоЗначению(ЭлМассива.ОбъектРасчетов) = Неопределено Тогда Продолжить; КонецЕсли;
		СписокОбъектовРасчета.Добавить(ЭлМассива.ОбъектРасчетов);
	КонецЦикла;
	СписокОбъектовРасчета.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	КоличествоОбъектовРасчета = СписокОбъектовРасчета.Количество();
	Для Каждого ЭлСписка Из СписокОбъектовРасчета Цикл	  
		ОбъектРасчетов = ЭлСписка.Значение;
		Если КоличествоОбъектовРасчета > 1 Тогда
			СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
			МассивСчетов = Новый Массив();
			МассивСчетов.Добавить(ВыборкаБезИерархии.СчетРасчетов);
			Если ЗначениеЗаполнено(ВыборкаБезИерархии.Договор) и ТипЗнч(ВыборкаБезИерархии.Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ВыборкаБезИерархии.Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
					и ВыборкаБезИерархии.СчетРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
					МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
					СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", ВыборкаБезИерархии.Контрагент, ВыборкаБезИерархии.Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным, ОбъектРасчетов);
					СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
				ИначеЕсли ВыборкаБезИерархии.Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
					и ВыборкаБезИерархии.СчетРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
					МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
					СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", ВыборкаБезИерархии.Контрагент, ВыборкаБезИерархии.Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным, ОбъектРасчетов);
					СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
				КонецЕсли; 
			КонецЕсли;
			//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаЗадолженность.Контрагент, ВыборкаЗадолженность.Договор, МассивСчетов);
			СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", ВыборкаБезИерархии.Контрагент, ВыборкаБезИерархии.Договор, ВыборкаБезИерархии.СчетРасчетов, ОбъектРасчетов);
			СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
				Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
					Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
						СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//ВыборкаОстатков.Сбросить();
			СуммаДолгаПоДоговору = ПолучитьОстаток(Счет, Контрагент, Договор, ОбъектРасчетов, ВыборкаОстатков, ДтКт);
			Если СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
		КонецЕсли;	
	
		ТаблицаДокументовДолга = ПолучитьТаблицуДокументовДолга(СписокСтрокПоТекущейЗадолженности, СуммаДолгаПоДоговору, ДтКт);
		
		ТекущийОбъектРасчетов = Неопределено;
		Для каждого ВыборкаДетальныеЗаписи из ТаблицаДокументовДолга цикл
			НовСтрока = ТЗДляСтруктуры.Добавить();
			
			ЗаполнитьСтрокуДаннымиДокумента(НовСтрока, ВыборкаДетальныеЗаписи, ОбъектРасчетов, ТекущийОбъектРасчетов, ЗаЧто);
			ПопадаетВПросрочку = ЗаполнитьСтрокуДаннымиДоговораВырнутьПопадаетВПросрочку(НовСтрока, Договор, КонПериода);
					
			НовСтрока.Колонка12 = 0;
			НовСтрока.Колонка13 = 0;
			НовСтрока.Колонка14 = 0; 
			НовСтрока.Колонка15 = 0;
			НовСтрока.Колонка16 = 0;
			НовСтрока.Колонка17 = 0;
			КолДней = (КонПериода - НовСтрока.ДатаДок) / (60 * 60 * 24);   // fix Suetin 23.10.2017 16:14:54  ТЗДляСтруктуры[КоличествоСтрок - 1].ДатаДок
			
			Если КолДней > 1095 Тогда
				НовСтрока.Колонка16 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней > 180 Тогда
				НовСтрока.Колонка15 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;	
			ИначеЕсли КолДней > 90 Тогда
				НовСтрока.Колонка14 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней > 30 Тогда
				НовСтрока.Колонка13 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			Иначе	//Если КолДней > 0 Тогда
				НовСтрока.Колонка12 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			КонецЕсли; 
			//Если НовСтрока.ДатаПогашенияДЗ > Дата(1,1,1) и Не НовСтрока.ДатаПогашенияДЗ > КонПериода Тогда
			Если ПопадаетВПросрочку Тогда
				НовСтрока.Колонка17 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			КонецЕсли;
			ТекущийОбъектРасчетов = ОбъектРасчетов;
		КонецЦикла;
	КонецЦикла;	
	
	//ПараметрыОтбора = Новый Структура("Колонка11,Колонка12,Колонка13,Колонка14,Колонка15", 0, 0, 0, 0, 0);
	//МассивСтрокПросроченных = ТЗДляСтруктуры.НайтиСтроки(ПараметрыОтбора);
	//Для каждого СтрокаНеПросроч Из МассивСтрокПросроченных Цикл
	//	ТЗДляСтруктуры.Удалить(СтрокаНеПросроч);
	//КонецЦикла;
	
	//ТЗДляСтруктуры.Свернуть("ТипДокумента, ДатаДок, НомерДок, ДатаДокСист, ЗаЧто, ОбъектРасчетов, ПроверятьГалочку, Регистратор, ДатаПогашенияДЗ, ДатаПогашенияДЗСтр", "Колонка12, Колонка13, Колонка14, Колонка15, Колонка16, Колонка17");
	ТЗДляСтруктуры.Свернуть("ДатаДок, ДатаДокСист, ЗаЧто, ОбъектРасчетов, ПроверятьГалочку, Регистратор, РегистраторПредставление, ДатаПогашенияДЗ, ДатаПогашенияДЗСтр", "Колонка12, Колонка13, Колонка14, Колонка15, Колонка16, Колонка17");
	ТЗДляСтруктуры.Сортировать("ОбъектРасчетов Возр, ДатаДок Убыв");
	//ТипДокумента 	= "";
	//ДатаДок 		= "";
	//НомерДок 		= "";
	//ДатаПогашенияДЗ = Дата;
	
	//Для каждого СтрокаДС из ТЗДляСтруктуры цикл
	//	ТипДокумента = ТипДокумента + ?(ТипДокумента = "", "", Символы.ПС) + строкаДС.ТипДокумента; 	
	//	НомерДок = НомерДок + ?(НомерДок = "", "", Символы.ПС) + ?(строкаДС.НомерДок = "", "б/н", строкаДС.НомерДок);
	//	ДатаДок = ДатаДок + ?(ДатаДок = "", "", Символы.ПС) + ?(строкаДС.ДатаДок = Дата(1,1,1,0,0,0), "б/д", Формат(строкаДС.ДатаДок, "ДФ=dd.MM.yyyy"));
	//	//ДатаПогашенияДЗ = ?(ТипЗнч(СтрокаДС.ДатаПогашенияДЗ) = Тип("Дата"), Мин(ДатаПогашенияДЗ, СтрокаДС.ДатаПогашенияДЗ), ДатаПогашенияДЗ);
	//	СтрокаДС.ЗаЧто = ?(ЗаЧто = СтрокаДС.ЗаЧто, "", СтрокаДС.ЗаЧто);
	//КонецЦикла;
	КоличествоСтрок = ТЗДляСтруктуры.Количество();
	//СтруктураСтроки.Вставить("ДокСтр"					, ТипДокумента);
	//СтруктураСтроки.Вставить("ДатаДок"					, ДатаДок);
	//СтруктураСтроки.Вставить("НомерДок"					, НомерДок);
	СтруктураСтроки.Вставить("ЗаЧто"					, ЗаЧто);
	//СтруктураСтроки.Вставить("ДатаПогашенияДЗ"			, ?(КоличествоСтрок, ТЗДляСтруктуры[КоличествоСтрок - 1].ДатаПогашенияДЗСтр, ""));  //?????????????????
	//СтруктураСтроки.Вставить("Регистратор"				, ?(КоличествоСтрок, ТЗДляСтруктуры[КоличествоСтрок - 1].Регистратор, Неопределено));  
	СтруктураСтроки.Вставить("ТЗДляСтруктуры"			, ТЗДляСтруктуры);
	СтруктураСтроки.Вставить("СуммаРезерва"				, СуммаРезерва);
	СтруктураСтроки.Вставить("ИсполняющееПодразделение"	, ?(ЗначениеЗаполнено(Договор), Договор.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));    //  ИсполняющееПодразделение
	СтруктураСтроки.Вставить("Контрагент"				, Контрагент);
	СтруктураСтроки.Вставить("Договор"		, Договор);
	
	Возврат СтруктураСтроки;
	
КонецФункции	//ПолучитьДанныеСтроки()	                    

Процедура ЗаполнитьСтрокуДаннымиДокумента(НовСтрока, Знач ВыборкаДетальныеЗаписи, Знач ОбъектРасчетов, Знач ТекущийОбъектРасчетов, Знач ЗаЧто)
	Регистратор 			= ВыборкаДетальныеЗаписи.Регистратор;
	НовСтрока.Регистратор 	= Регистратор;
	СтатьяДДС_ГФУН 			= ВыборкаДетальныеЗаписи.СтатьяДДС_ГФУН;
	ПроверятьГалочку		= ВыборкаДетальныеЗаписи.ПроверятьГалочку;
	ЕстьУслуги				= ВыборкаДетальныеЗаписи.ЕстьУслуги;
	Если Не ЗначениеЗаполнено(ОбъектРасчетов) Тогда  													
		НовСтрока.ЗаЧто 					= ?(ЗаЧто = СтатьяДДС_ГФУН, "", СтатьяДДС_ГФУН); 
		НовСтрока.РегистраторПредставление 	= Строка(Регистратор);
	ИначеЕсли (ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			или ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")) Тогда
		НовСтрока.ЗаЧто 					= ?(ЗаЧто = СтатьяДДС_ГФУН, "", СтатьяДДС_ГФУН);
		НовСтрока.РегистраторПредставление 	= Строка(Регистратор);
	Иначе
		НовСтрока.ЗаЧто 					= ?(ТекущийОбъектРасчетов = ОбъектРасчетов, "", ОбъектРасчетов);
		НовСтрока.РегистраторПредставление 	= ?(ЗаЧто = СтатьяДДС_ГФУН, Строка(Регистратор),  Строка(Регистратор) + Символы.ПС + СтатьяДДС_ГФУН);
	КонецЕсли;
	НовСтрока.ОбъектРасчетов 	= ОбъектРасчетов;
	НовСтрока.ПроверятьГалочку 	= ПроверятьГалочку;
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
		НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") тогда
		НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") тогда
		НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);	
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПервичныйДокумент") тогда
		НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);	
	Иначе
		НовСтрока.ДатаДок 		= Регистратор.Дата;
	КонецЕсли;
	НовСтрока.ДатаДокСист 		= НовСтрока.ДатаДок;
	//Попытка
	//	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОтчетДавальцу") тогда   //    РеализацияУслугПоПереработке
	//		//НовСтрока.ТипДокумента = "акт выполненных услуг";
	//		НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
	//		
	//	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПередачаДавальцу") тогда   //    РеализацияУслугПоПереработке
	//		//НовСтрока.ТипДокумента = "накладная";
	//		НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
	//	
	//	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
	//		//Если ЕстьУслуги тогда
	//		//	НовСтрока.ТипДокумента = "акт выполненных услуг";
	//		//Иначе
	//		//	НовСтрока.ТипДокумента = "накладная";
	//		//КонецЕсли;
	//		НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
	//	
	//	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
	//		//Если ЕстьУслуги тогда
	//		//	НовСтрока.ТипДокумента = "акт выполненных услуг";
	//		//Иначе
	//		//	НовСтрока.ТипДокумента = "накладная";
	//		//КонецЕсли;
	//		НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);
	//		НовСтрока.НомерДок 		= ?(Регистратор.НомерВходящегоДокумента = "", "б/н", Регистратор.НомерВходящегоДокумента);
		//
		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") тогда
		//	//Если ЕстьУслуги тогда
		//	//	НовСтрока.ТипДокумента = "акт выполненных услуг";
		//	//Иначе
		//	//	НовСтрока.ТипДокумента = "накладная";
		//	//КонецЕсли;
		//	НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);
		//	НовСтрока.НомерДок 		= ?(Регистратор.НомерВходящегоДокумента = "", "б/н", Регистратор.НомерВходящегоДокумента);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") тогда
		//	//НовСтрока.ТипДокумента 	= "платежное поручение";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") тогда
//			//НовСтрока.ТипДокумента 	= "платежное поручение";
//			НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);
//			НовСтрока.НомерДок 		= ?(Регистратор.НомерВходящегоДокумента = "", "б/н", Регистратор.НомерВходящегоДокумента);

//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") тогда
//			//НовСтрока.ТипДокумента 	= "ПКО";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") тогда
//			//НовСтрока.ТипДокумента 	= "РКО";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.АвансовыйОтчет") тогда
//			//НовСтрока.ТипДокумента 	= "Авансовый отчет";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОперацияБух") тогда
//			//НовСтрока.ТипДокумента 	= "Опреация бух.";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

//		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") тогда  //?????????????????????????????
//		//	НовСтрока.ТипДокумента 	= "акт выполненных услуг";
//		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПервичныйДокумент") тогда
		//	//НовСтрока.ТипДокумента 	= "" + Регистратор.ТипПервичногоДокумента;//"д/расч.";
		//	НовСтрока.ДатаДок 		= ?(Регистратор.ДатаВходящегоДокумента = Дата(1,1,1), Регистратор.Дата, Регистратор.ДатаВходящегоДокумента);;
		//	НовСтрока.НомерДок 		= ?(Регистратор.НомерВходящегоДокумента = "", "б/н", Регистратор.НомерВходящегоДокумента);	//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаЗадолженностиПоФинансовымИнструментам") тогда
		//	//НовСтрока.ТипДокумента 	= "к/задолженности";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") тогда
		//	//НовСтрока.ТипДокумента 	= "в/задолженности";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.СписаниеЗадолженности") тогда
		//	//НовСтрока.ТипДокумента 	= "с/задолженности";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") тогда
		//	//НовСтрока.ТипДокумента 	= "доп/расх";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
		//	
		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВводОстатков") тогда
		//	//НовСтрока.ТипДокумента 	= "Ввод нач. остатков";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации") тогда
		//	//НовСтрока.ТипДокумента 	= "Корректировка реализ.";
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

		//ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаПриобретения") тогда
		//	//НовСтрока.ТипДокумента 	= "Корректировка поступ.";                                                            
		//	НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);

//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") тогда
//			//НовСтрока.ТипДокумента 	= "Накладная";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
//			
//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") тогда
//			//НовСтрока.ТипДокумента 	= "Накладная";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
//			
//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеДивидендов") тогда
//			//НовСтрока.ТипДокумента 	= "Начисление дивидендов";
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
//			//???НовСтрока.ЗаЧто 		= "Дивиденды по акциям";
//			
//		Иначе
//			//НовСтрока.ТипДокумента 	= Регистратор.Метаданные().Синоним;
//			НовСтрока.НомерДок 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Регистратор, Ложь, Истина);
//			
//		КонецЕсли;	
//	Исключение
//		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
//	КонецПопытки;
КонецПроцедуры

Функция ПолучитьТекстЗапроса(ДтКт)
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1	//0
	|	Инвентаризация.Дата КАК Дата,
	|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Организация КАК Организация,
	|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	|ПОМЕСТИТЬ Шапка
	|ИЗ 
	|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка
	|
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ //1
	|	Задолженность.Ссылка.Организация КАК Организация,
	|	Задолженность.ДебиторКредитор КАК Контрагент,
	|	Задолженность.ВИЛС_Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
	|ПОМЕСТИТЬ Задолженность	
	|ИЗ 
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	|ГДЕ
	|	Задолженность.Ссылка = &Ссылка
	|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	|;	
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ //2
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Договор КАК Договор,
	|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги,
	|	Т.РасчетныйДокумент КАК РасчетныйДокумент,
	|   ВЫБОР 
	|   	КОГДА Т.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|   		ТОГДА ЕСТЬNULL(Т.РасчетныйДокумент.ДатаВходящегоДокумента, Т.РасчетныйДокумент.Дата)
	|   	ИНАЧЕ Т.Регистратор.Дата
	|   КОНЕЦ КАК Период
	|ПОМЕСТИТЬ РегистраторыСУслугами
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Регистратор,
	|		Т.Ссылка.Организация КАК Организация,
	|		Т.Ссылка.Контрагент КАК Контрагент,
	|		Т.Ссылка.Договор КАК Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьУслуги,
	|		Т.Ссылка КАК РасчетныйДокумент
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		Т.Ссылка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		Т.Ссылка
	|	ИЗ
	|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Контрагент,
	|		ВЫБОР КОГДА НЕ ЕСТЬNULL(Т.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА 
	|				Т.Договор
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) 	 
	|			ТОГДА
	|				ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов)
	|			ИНАЧЕ	
	|				Т.ДокументРасчетов.Договор
	|			КОНЕЦ,	
	|		ЛОЖЬ,
	|		Т.ДокументРасчетов
	|	ИЗ
	|		Документ.ВводОстатков.РасчетыСПартнерами КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	    ) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Договор,
	|	Т.РасчетныйДокумент,
	|   ВЫБОР 
	|   	КОГДА Т.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|   		ТОГДА ЕСТЬNULL(Т.РасчетныйДокумент.ДатаВходящегоДокумента, Т.РасчетныйДокумент.Дата)
	|   	ИНАЧЕ Т.Регистратор.Дата
	|   КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Контрагент,
	|	Договор
	|;
	|///////////////////////////////////////////////////////////////////////////////   
	|ВЫБРАТЬ	//3
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонПериода,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|			, (Организация, Субконто1, Субконто2) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	|															) КАК ХозрасчетныйОстатки
	|
	|;
	|///////////////////////////////////////////////////////////////////////////////   
	|ВЫБРАТЬ ИСТИНА	//4
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //5
	|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|	ХозрасчетныйОбороты.Договор КАК Договор,
	|	ХозрасчетныйОбороты.ЕстьУслуги,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	|   НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|   ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,          // fix Suetin 25.06.2019 12:52:58
	|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|ИЗ
	|	(ВЫБРАТЬ

	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто1
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто3
	|		ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто2
	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ХозрасчетныйОбороты.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК Договор, // end fix Suetin 17.01.2019 12:58:17
	|		ЕСТЬNULL(РегистраторыСУслугами.Период, ХозрасчетныйОбороты.Период) КАК Период,
	|		ХозрасчетныйОбороты.Счет КАК Счет,
    |	   	ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор, 
	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) 
	|		КОНЕЦ КАК СуммаОборот,		
	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) 
	|		КОНЕЦ КАК СуммаОборотДт,
	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) 
	|		КОНЕЦ КАК СуммаОборотКт,
	|		ВЫБОР
	|			КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент 
	|					И РегистраторыСУслугами.РасчетныйДокумент.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	|				ТОГДА ""Деньги""
	|			КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент 
	|					И РегистраторыСУслугами.РасчетныйДокумент.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	|				ТОГДА ""Деньги""
	// begin fix Suetin 07.10.2019 14:05:21
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|					И ХозрасчетныйОбороты.КорСчет В(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал))
	|				ТОГДА ""Деньги""
	// end fix Suetin 07.10.2019 14:05:24
	// begin fix Suetin 13.12.2019 13:22:37
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	// end fix Suetin 13.12.2019 13:22:45
	|			ИНАЧЕ ""Поставка""
	|		КОНЕЦ КАК ПроверятьГалочку,
	|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	|		ВЫБОР         																														// begin fix Suetin 25.06.2019 12:51:31
	|			КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)	
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)	
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК СтатьяДДС_ГФУН  																											// end fix Suetin 25.06.2019 12:51:42
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&КонПериода,
	|				Регистратор,
	|				ВЫБОР 
	|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	|				    	ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|				    	ТОГДА ИСТИНА
	|                    ИНАЧЕ ЛОЖЬ КОНЕЦ,
	|					, (Организация, ВЫБОР
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|								ТОГДА Субконто1
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|								ТОГДА Субконто1
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА Субконто1
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|								ТОГДА Субконто2
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|								ТОГДА Субконто3
	|							ИНАЧЕ NULL
	|						КОНЕЦ, ВЫБОР
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА Субконто2
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА Субконто3
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность),
	|					,
	|					) КАК ХозрасчетныйОбороты
	|    ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами
	|    	ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	|			И ХозрасчетныйОбороты.Организация = РегистраторыСУслугами.Организация
	|			И ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|			КОНЕЦ = РегистраторыСУслугами.Контрагент
	|			И ВЫБОР 
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			КОНЕЦ = РегистраторыСУслугами.Договор 
	|			
	|											) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Контрагент,
	|	ХозрасчетныйОбороты.Договор,
	|	ХозрасчетныйОбороты.ЕстьУслуги,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.ПроверятьГалочку,
	|	ХозрасчетныйОбороты.СтатьяДДС_ГФУН               // fix Suetin 25.06.2019 12:50:58
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Период,
	|	Регистратор,
	|	ОбъектРасчетов,
	|	Счет,
	|	СтатьяДДС_ГФУН          // fix Suetin 25.06.2019 12:50:39
	|	
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	Счет
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ //6
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Контрагент КАК Контрагент,
	|	Задолженность.Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
	|ИЗ 
	|	Задолженность КАК Задолженность
	|УПОРЯДОЧИТЬ ПО
	|	СчетРасчетов
	|ИТОГИ
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено)
	|ПО
	|	СчетРасчетов ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|///////////////////////////////////////////////////////////////////////////////   
	|ВЫБРАТЬ ИСТИНА	//7
	|;
	|";
	
	Возврат(ТекстЗапроса);
КонецФункции

Функция ПолучитьТекстЗапросаСЗаказами(ДтКт)   
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1	//0
	|	Инвентаризация.Дата КАК Дата,
	|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Организация КАК Организация,
	|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	//1
	|	Задолженность.Ссылка.Организация КАК Организация,
	|	Задолженность.ДебиторКредитор КАК Контрагент,
	|	Задолженность.ВИЛС_Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
	|ПОМЕСТИТЬ Задолженность
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	|ГДЕ
	|	Задолженность.Ссылка = &Ссылка
	|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	//2
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Договор КАК Договор,
	|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги
	|ПОМЕСТИТЬ РегистраторыСУслугами
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Регистратор,
	|		Т.Ссылка.Организация КАК Организация,
	|		Т.Ссылка.Контрагент КАК Контрагент,
	|		Т.Ссылка.Договор КАК Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьУслуги
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент
	|				ИЗ
	|					Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент
	|				ИЗ
	|					Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент
	|				ИЗ
	|					Задолженность)) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	//3
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонПериода,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|			,
	|			(Организация, Субконто1, Субконто2) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ	//4
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	|	КОНЕЦ КАК Период,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL) КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ КАК РасчетныйДокумент,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОборотДт,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОборотКт,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ КАК Счет
	|ПОМЕСТИТЬ РасчетыПоСрокам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|ГДЕ
	|	(РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	|			(ВЫБРАТЬ
	|				Задолженность.Организация,
	|				Задолженность.Контрагент,
	|				Задолженность.Договор
	|			ИЗ
	|				Задолженность)
	|	И ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	|	КОНЕЦ,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL),
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL),
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	(РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	|			(ВЫБРАТЬ
	|				Задолженность.Организация,
	|				Задолженность.Контрагент,
	|				Задолженность.Договор
	|			ИЗ
	|				Задолженность)
	|	И ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL),
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Контрагент,
	|	Договор,
	|	Счет,
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ	//5
	|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|	ХозрасчетныйОбороты.Договор КАК Договор,
	|	ХозрасчетныйОбороты.ЕстьУслуги КАК ЕстьУслуги,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|		ХозрасчетныйОбороты.Договор КАК Договор,
	|		ХозрасчетныйОбороты.Период КАК Период,
	|		ХозрасчетныйОбороты.Счет КАК Счет,
	|		ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|		ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) КАК СуммаОборот,
	|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК СуммаОборотКт,
	|		ВЫБОР
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	|				ТОГДА ""Деньги""
	// begin fix Suetin 07.10.2019 14:05:21
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|					И ХозрасчетныйОбороты.КорСчет В(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал))
	|				ТОГДА ""Деньги""
	// end fix Suetin 07.10.2019 14:05:24
	// begin fix Suetin 13.12.2019 13:22:37
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	// end fix Suetin 13.12.2019 13:22:45
	|			ИНАЧЕ ""Поставка""
	|		КОНЕЦ КАК ПроверятьГалочку,
	|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	|		ХозрасчетныйОбороты.СтатьяДДС_ГФУН КАК СтатьяДДС_ГФУН
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|			КОНЕЦ КАК Контрагент,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			КОНЕЦ КАК Договор,
	|			ЕСТЬNULL(РасчетыПоСрокам.Период, ХозрасчетныйОбороты.Период) КАК Период,
	|			ХозрасчетныйОбороты.Счет КАК Счет,
	|			ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	|			ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор,
	|			РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|				ИНАЧЕ NULL
	|			КОНЕЦ КАК СтатьяДДС_ГФУН,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
	|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0)
	|			КОНЕЦ КАК СуммаОборот,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	|			КОНЕЦ КАК СуммаОборотДт,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	|			КОНЕЦ КАК СуммаОборотКт
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.Обороты(
	|					,
	|					&КонПериода,
	|					Регистратор,
	|					ВЫБОР
	|						КОГДА Счет В
	|								(ВЫБРАТЬ
	|									Задолженность.СчетРасчетов
	|								ИЗ
	|									Задолженность)
	|							ТОГДА ИСТИНА
	|						КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ,
	|					,
	|					(Организация, ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|							ТОГДА Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|							ТОГДА Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА Субконто3
	|						ИНАЧЕ NULL
	|					КОНЕЦ, ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА Субконто3
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					КОНЕЦ) В
	|						(ВЫБРАТЬ
	|							Задолженность.Организация,
	|							Задолженность.Контрагент,
	|							Задолженность.Договор
	|						ИЗ
	|							Задолженность),
	|					,
	|					) КАК ХозрасчетныйОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокам КАК РасчетыПоСрокам
	|				ПО ХозрасчетныйОбороты.Регистратор = РасчетыПоСрокам.Регистратор
	|					И ХозрасчетныйОбороты.Организация = РасчетыПоСрокам.Организация
	|					И ХозрасчетныйОбороты.Счет = РасчетыПоСрокам.Счет
	|					И (ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто3
	|						ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|					КОНЕЦ = РасчетыПоСрокам.Контрагент)
	|					И (ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто3
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					КОНЕЦ = РасчетыПоСрокам.Договор)) КАК ХозрасчетныйОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами КАК РегистраторыСУслугами
	|			ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	|				И ХозрасчетныйОбороты.Контрагент = РегистраторыСУслугами.Контрагент
	|				И ХозрасчетныйОбороты.Договор = РегистраторыСУслугами.Договор) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Контрагент,
	|	ХозрасчетныйОбороты.Договор,
	|	ХозрасчетныйОбороты.ОбъектРасчетов,
	|	ХозрасчетныйОбороты.ЕстьУслуги,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.ПроверятьГалочку,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Период,
	|	Регистратор,
	|	ОбъектРасчетов,
	|	Счет,
	|	СтатьяДДС_ГФУН
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	//6
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Контрагент КАК Контрагент,
	|	Задолженность.Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
	|ИЗ
	|	Задолженность КАК Задолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетРасчетов
	|ИТОГИ
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено)
	|ПО
	|	СчетРасчетов ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ	//7
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ КАК Счет,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток < 0
	|					ТОГДА -(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток)
	|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	|			КОНЕЦ), 0) КАК СуммаОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокДт,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОстатокКт
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&КонПериода,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК РасчетыСКлиентамиПоСрокам
	//|				И ВЫБОР
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|						ТОГДА ЛОЖЬ
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|						ТОГДА ЛОЖЬ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК РасчетыСКлиентамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток < 0
	|					ТОГДА -(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток)
	|				ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0)
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&КонПериода,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК РасчетыСПоставщикамиПоСрокам
	//|				И ВЫБОР
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|						ТОГДА ЛОЖЬ
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|						ТОГДА ЛОЖЬ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК РасчетыСПоставщикамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ	
	|";
	Возврат(ТекстЗапроса);
КонецФункции

Функция ПечатьРеестрПросроченнойДебиторскойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати)
	ДтКт = "Дт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияПророченныхРасчетовСконтрагентами_Дбт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	ТекстЗапроса = ПолучитьТекстПросроченногоЗапроса(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр просроченной дебиторской задолженности");
	ТекстЗаголовка.Добавить("Дебиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Дата погашения ДЗ по договору");
	ТекстЗаголовка.Добавить("Сумма просроченной ДЗ на дату сдачи отчета, руб.");
	
	СвойствоМероприятие = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "МероприятиеДт");
	СвойствоСрокПогашенияЗадолженности 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "СрокПогашенияЗадолженностиДт");
	Возврат(ПечатьРеестрПросроченнойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати, ТабДокумент, "Дт", Макет, ТекстЗапроса, ТекстЗаголовка, СвойствоМероприятие, СвойствоСрокПогашенияЗадолженности));
КонецФункции

Функция ПечатьРеестрПросроченнойКредиторскойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати)
	ДтКт = "Кт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияПророченныхРасчетовСконтрагентами_Крт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	ТекстЗапроса = ПолучитьТекстПросроченногоЗапроса(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр просроченной кредиторской задолженности");
	ТекстЗаголовка.Добавить("Кредиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Дата погашения КЗ по договору");
	ТекстЗаголовка.Добавить("Сумма просроченной КЗ на дату сдачи отчета, руб.");
	
	СвойствоМероприятие = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "МероприятиеКт");
	СвойствоСрокПогашенияЗадолженности 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "СрокПогашенияЗадолженностиКт");
	Возврат(ПечатьРеестрПросроченнойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати, ТабДокумент, "Кт", Макет, ТекстЗапроса, ТекстЗаголовка, СвойствоМероприятие, СвойствоСрокПогашенияЗадолженности));
КонецФункции

Функция ПечатьРеестрПросроченнойДебиторскойЗадолженностиСЗаказамиПриложение_7_2(МассивОбъектов, ОбъектыПечати)
	ДтКт = "Дт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияПророченныхРасчетовСконтрагентами_Дбт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	ТекстЗапроса = ПолучитьТекстПросроченногоЗапросаСЗаказами(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр просроченной дебиторской задолженности (с заказами)");
	ТекстЗаголовка.Добавить("Дебиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Дата погашения ДЗ по договору");
	ТекстЗаголовка.Добавить("Сумма просроченной ДЗ на дату сдачи отчета, руб.");
	
	СвойствоМероприятие = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "МероприятиеДт");
	СвойствоСрокПогашенияЗадолженности 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "СрокПогашенияЗадолженностиДт");
	Возврат(ПечатьРеестрПросроченнойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати, ТабДокумент, "Дт", Макет, ТекстЗапроса, ТекстЗаголовка, СвойствоМероприятие, СвойствоСрокПогашенияЗадолженности));
КонецФункции

Функция ПечатьРеестрПросроченнойКредиторскойЗадолженностиСЗаказамиПриложение_7_2(МассивОбъектов, ОбъектыПечати)
	ДтКт = "Кт";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияПророченныхРасчетовСконтрагентами_Крт";
	Макет = ПолучитьМакет("ПФ_MXL_РеестрПросроченнойЗадолженностиПриложение_7_2");
	ТекстЗапроса = ПолучитьТекстПросроченногоЗапросаСЗаказами(ДтКт);
	
	ТекстЗаголовка = Новый Массив();
	ТекстЗаголовка.Добавить("Реестр просроченной кредиторской задолженности (с заказами)");
	ТекстЗаголовка.Добавить("Кредиторская задолженность (контрагент)");
	ТекстЗаголовка.Добавить("Дата погашения КЗ по договору");
	ТекстЗаголовка.Добавить("Сумма просроченной КЗ на дату сдачи отчета, руб.");
	
	СвойствоМероприятие = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "МероприятиеКт");
	СвойствоСрокПогашенияЗадолженности 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "СрокПогашенияЗадолженностиКт");
	Возврат(ПечатьРеестрПросроченнойЗадолженностиПриложение_7_2(МассивОбъектов, ОбъектыПечати, ТабДокумент, "Кт", Макет, ТекстЗапроса, ТекстЗаголовка, СвойствоМероприятие, СвойствоСрокПогашенияЗадолженности));
КонецФункции

Функция ПечатьРеестрПросроченнойЗадолженностиПриложение_7_2(Знач МассивОбъектов, Знач ОбъектыПечати, ТабДокумент, Знач ДтКт = "Дт", Знач Макет, Знач ТекстЗапроса, Знач ТекстЗаголовка, Знач СвойствоМероприятие, Знач СвойствоСрокПогашенияЗадолженности)
	ПервыйДокумент = Истина;
	
	Для каждого СсылкаОбъекта Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		ДатаДокументаИнветаризации = КонецДня(СсылкаОбъекта.Дата);
		Запрос.УстановитьПараметр("Ссылка"				, СсылкаОбъекта);
		Запрос.УстановитьПараметр("КонПериода2М"		, Новый Граница(ДобавитьМесяц(НачалоМесяца(ДатаДокументаИнветаризации), -1) - 1	, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("НачПериода1М"		, Новый Граница(ДобавитьМесяц(НачалоМесяца(ДатаДокументаИнветаризации), -1)		, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода1М"		, Новый Граница(НачалоМесяца(ДатаДокументаИнветаризации) - 1					, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("НачПериода"			, Новый Граница(НачалоМесяца(ДатаДокументаИнветаризации)						, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонПериода"			, Новый Граница(ДатаДокументаИнветаризации										, ВидГраницы.Включая)); 
		Запрос.УстановитьПараметр("СвойствоМероприятие"	, СвойствоМероприятие);
		Запрос.УстановитьПараметр("СвойствоСрокПогашенияЗадолженности" , СвойствоСрокПогашенияЗадолженности);
		//Запрос.УстановитьПараметр("КонПериода2МНеМеньше20181231235959", Не Запрос.Параметры.КонПериода2М.Значение < Дата(2018,12,31,23,59,59));
		//Запрос.УстановитьПараметр("КонПериода1МНеМеньше20181231235959", Не Запрос.Параметры.КонПериода1М.Значение < Дата(2018,12,31,23,59,59));
		//Запрос.УстановитьПараметр("УСчетаЕстьРодитель", ЗначениеЗаполнено(Счет.Родитель));
		//Запрос.УстановитьПараметр("СчетРодитель", 	Счет.Родитель);  
		
		ПакетЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		ВыборкаШапка = ПакетЗапросов[0].Выбрать();
		Если НЕ ВыборкаШапка.Следующий() Тогда
			Возврат ТабДокумент;
		КонецЕсли;
		//ДатаДокументаИнветаризации = КонецДня(ВыборкаШапка.Дата);
		
		Область = Макет.ПолучитьОбласть("Шапка|Тело");
				
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаШапка);
		
		Область.Параметры.ТекстЗаголовка0 	= ТекстЗаголовка[0];
		Область.Параметры.Дата  			= Формат(ДатаДокументаИнветаризации, "ДФ=dd.MM.yyyy");
		Область.Параметры.ТекстЗаголовка1 	= ТекстЗаголовка[1];
		Если ДтКт = "Дт" Тогда
			Область.Параметры.ДатаВозникновенияЗ1М	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дата возникновения просроченной ДЗ на %1'"), Формат(НачалоМесяца(ДатаДокументаИнветаризации) -1,"ДФ=""дд.ММ.гг 'г.'"""));
			Область.Параметры.КонПериода2М 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сумма просроченной ДЗ на %1 руб.'"), 			Формат(ДобавитьМесяц(НачалоМесяца(ДатаДокументаИнветаризации), -1) - 1,"ДФ=""дд.ММ.гг 'г.'"""));
			Область.Параметры.КонПериода1М 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сумма просроченной ДЗ на %1 руб.'"), 			Формат(НачалоМесяца(ДатаДокументаИнветаризации) - 1, "ДФ=""дд.ММ.гг 'г.'"""));
		Иначе
			Область.Параметры.ДатаВозникновенияЗ1М	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дата возникновения просроченной КЗ на %1'"), Формат(НачалоМесяца(ДатаДокументаИнветаризации) -1,"ДФ=""дд.ММ.гг 'г.'"""));
			Область.Параметры.КонПериода2М 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сумма просроченной КЗ на %1 руб.'"), 			Формат(ДобавитьМесяц(НачалоМесяца(ДатаДокументаИнветаризации), -1) - 1,"ДФ=""дд.ММ.гг 'г.'"""));
			Область.Параметры.КонПериода1М 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сумма просроченной КЗ на %1 руб.'"), 			Формат(НачалоМесяца(ДатаДокументаИнветаризации) - 1, "ДФ=""дд.ММ.гг 'г.'"""));
		КонецЕсли;	
		Область.Параметры.ОборотыПериода1М 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Оплачено (погашено) в %1 руб.'"), 			Формат(НачалоМесяца(ДатаДокументаИнветаризации) - 1, "ДФ=""ММММ гг 'г.'"""));
		ТабДокумент.Вывести(Область);
		ТабДокумент.ФиксацияСверху = 5;
		
		ТабДокумент.НачатьГруппуКолонок("По срокам 1 месяц", Ложь); 
		Область = Макет.ПолучитьОбласть("Шапка|КонПериода1МПоСрокам");
		Если ДтКт = "Дт" Тогда
			Область.Параметры.КонПериода1МПоСрокам	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ДЗ просроченная по срокам на %1,  в т.ч.:'"), Формат(НачалоМесяца(ДатаДокументаИнветаризации) - 1, "ДФ=""дд.ММ.гг 'г.'"""));
		Иначе
			Область.Параметры.КонПериода1МПоСрокам	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'КЗ просроченная по срокам на %1,  в т.ч.:'"), Формат(НачалоМесяца(ДатаДокументаИнветаризации) - 1, "ДФ=""дд.ММ.гг 'г.'"""));
		КонецЕсли;	
		ТабДокумент.Присоединить(Область, 1, "По срокам 1 месяц", Ложь);
		ТабДокумент.ЗакончитьГруппуКолонок();
		
		Область = Макет.ПолучитьОбласть("Шапка|Тело1");
		Область.Параметры.ОборотыПериодаТекМ 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Оплачено (погашено) в %1 руб.'"), 			Формат(НачалоМесяца(ДатаДокументаИнветаризации), "ДФ=""ММММ гг 'г.'"""));
		Область.Параметры.Резерв	 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Резерв по состоянию на %1 руб.'"), 			Формат(НачалоМесяца(ДатаДокументаИнветаризации) - 1, "ДФ=""дд.ММ.гг 'г.'"""));
		Область.Параметры.ТекстЗаголовка2 		= ТекстЗаголовка[2];
		Область.Параметры.ТекстЗаголовка3 		= ТекстЗаголовка[3];
		Если ДтКт = "Дт" Тогда
			Область.Параметры.ДатаВозникновенияЗ	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дата возникновения просроченной ДЗ на %1'"), Формат(ДатаДокументаИнветаризации,"ДФ=""дд.ММ.гг 'г.'"""));
		Иначе
			Область.Параметры.ДатаВозникновенияЗ	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дата возникновения просроченной КЗ на %1'"), Формат(ДатаДокументаИнветаризации,"ДФ=""дд.ММ.гг 'г.'"""));
		КонецЕсли;	
		ТабДокумент.Присоединить(Область,,, Истина);
		
		ТабДокумент.НачатьГруппуКолонок("По срокам на дату сдачи отчета", Ложь);
		Область = Макет.ПолучитьОбласть("Шапка|КонПериодаПоСрокам");
		Если ДтКт = "Дт" Тогда
			Область.Параметры.КонПериодаПоСрокам	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ДЗ просроченная по срокам на %1,  в т.ч.:'"), Формат(ДатаДокументаИнветаризации, "ДФ=""дд.ММ.гг 'г.'"""));
		Иначе	
			Область.Параметры.КонПериодаПоСрокам	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'КЗ просроченная по срокам на %1,  в т.ч.:'"), Формат(ДатаДокументаИнветаризации, "ДФ=""дд.ММ.гг 'г.'"""));
		КонецЕсли;
		ТабДокумент.Присоединить(Область, 2, "По срокам на дату сдачи отчета", Ложь);     
		ТабДокумент.ЗакончитьГруппуКолонок();	
		
		СтруктураПоказателей = Новый Структура;
		СтруктураПоказателей.Вставить("НПП"								, 1);
		СтруктураПоказателей.Вставить("КонПериодаТекМИтого"				, 0);
		СтруктураПоказателей.Вставить("СуммаРезерва"					, 0);
		СтруктураПоказателей.Вставить("СуммаРезерваИтого"				, 0);
		СтруктураПоказателей.Вставить("Колонка11ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка12ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка12ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка13ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка14ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка15ЧИтого"					, 0);   
		СтруктураПоказателей.Вставить("Колонка17ЧИтого"					, 0);    
		СтруктураПоказателей.Вставить("СуммаРезерваНУЧ"					, 0); 
		СтруктураПоказателей.Вставить("СуммаРезерваНУЧИтого"			, 0);
		СтруктураПоказателей.Вставить("КонПериода2МИтого"				, 0); 
		СтруктураПоказателей.Вставить("ОборотыПериода1МИтого"			, 0);
		СтруктураПоказателей.Вставить("КонПериода1МИтого"				, 0);
		СтруктураПоказателей.Вставить("ОборотыПериодаТекМИтого"			, 0);
		СтруктураПоказателей.Вставить("Колонка22ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка23ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка24ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка25ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("Колонка26ЧИтого"					, 0);
		СтруктураПоказателей.Вставить("КонПериодаТекМПоСчетуИтого"		, 0);
		СтруктураПоказателей.Вставить("СуммаРезерваПоСчетуИтого"		, 0);   
		СтруктураПоказателей.Вставить("Колонка11ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка12ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("Колонка13ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка14ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("Колонка15ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка17ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("СуммаРезерваНУЧПоСчетуИтого"		, 0);
		СтруктураПоказателей.Вставить("КонПериода2МПоСчетуИтого"		, 0);   
		СтруктураПоказателей.Вставить("ОборотыПериода1МПоСчетуИтого"	, 0);  
		СтруктураПоказателей.Вставить("КонПериода1МПоСчетуИтого"		, 0);   
		СтруктураПоказателей.Вставить("ОборотыПериодаТекМПоСчетуИтого"	, 0);  
		СтруктураПоказателей.Вставить("Колонка22ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("Колонка23ЧПоСчетуИтого"			, 0);  
		СтруктураПоказателей.Вставить("Колонка24ЧПоСчетуИтого"			, 0);   
		СтруктураПоказателей.Вставить("Колонка25ЧПоСчетуИтого"			, 0);       
		СтруктураПоказателей.Вставить("Колонка26ЧПоСчетуИтого"			, 0);
		
		ТаблицаСтрокПоСчету = Новый ТаблицаЗначений();
		Колонки = ТаблицаСтрокПоСчету.Колонки;
		Колонки.Добавить("СчетИерархия");
		Колонки.Добавить("СчетГруппировка");
		Колонки.Добавить("СчетРасчетов");
		Колонки.Добавить("СтрокаИерархия");
		Колонки.Добавить("СтрокаГруппировка");
		Колонки.Добавить("СтрокаРасчетов");
		Колонки.Добавить("СтрокаДетальная");
		
		КоличествоВСтеке=0;
		ТекущийСчет				 = Неопределено;
		//ТекущийСчетПервогоУровня = Неопределено;
		//ТекущийСчетВторогоУровня = Неопределено;
		
		Выборка_3 				= ПакетЗапросов[3].Выбрать();
		ВыборкаДокументов 		= ПакетЗапросов[5].Выгрузить();
		ВыборкаЗадолженность 	= ПакетЗапросов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "СчетРасчетов");
		ВыборкаОстатков 		= ПакетЗапросов[8].Выгрузить();
		ВыбратьЭлементыДляПросроченнойВИерархии(ВыборкаЗадолженность, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке);        //ВыборкаОстатков, 
		
		Если ТаблицаСтрокПоСчету.Количество() > 1 Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|Тело");
			ОбластьСтрока.Параметры.Итого			 	= "Итого по счету: " + ТаблицаСтрокПоСчету[0].СчетИерархия;
			ОбластьСтрока.Параметры.КонПериода2М 		= СтруктураПоказателей.КонПериода2МПоСчетуИтого;
			ОбластьСтрока.Параметры.ОборотыПериода1М	= СтруктураПоказателей.ОборотыПериода1МПоСчетуИтого;
			ОбластьСтрока.Параметры.КонПериода1М		= СтруктураПоказателей.КонПериода1МПоСчетуИтого;
			ТабДокумент.Вывести(ОбластьСтрока);
			
			ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|КонПериода1МПоСрокам");
			ОбластьСтрока.Параметры.Колонка11Ч			= СтруктураПоказателей.Колонка11ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка12Ч			= СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка13Ч			= СтруктураПоказателей.Колонка13ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка14Ч			= СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка15Ч			= СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
			ТабДокумент.Присоединить(ОбластьСтрока, 1, "По срокам 1 месяц", Ложь);
			
			ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|Тело1");
			ОбластьСтрока.Параметры.СуммаРезерва		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
			ОбластьСтрока.Параметры.ОборотыПериодаТекМ	= СтруктураПоказателей.ОборотыПериодаТекМПоСчетуИтого;
			ОбластьСтрока.Параметры.КонПериодаТекМ		= СтруктураПоказателей.КонПериодаТекМПоСчетуИтого;
			ТабДокумент.Присоединить(ОбластьСтрока,,, Истина);
			
			ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|КонПериодаПоСрокам");
			ОбластьСтрока.Параметры.Колонка22Ч			= СтруктураПоказателей.Колонка22ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка23Ч			= СтруктураПоказателей.Колонка23ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка24Ч			= СтруктураПоказателей.Колонка24ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка25Ч			= СтруктураПоказателей.Колонка25ЧПоСчетуИтого;
			ОбластьСтрока.Параметры.Колонка26Ч			= СтруктураПоказателей.Колонка26ЧПоСчетуИтого;
			ТабДокумент.Присоединить(ОбластьСтрока, 2, "По срокам на дату сдачи отчета", Ложь);
			
			ТабДокумент.НачатьГруппуСтрок("ИтогоПоСчету" + ТаблицаСтрокПоСчету[0].СчетИерархия, Ложь);
			
			СтруктураПоказателей.КонПериода2МИтого 		= СтруктураПоказателей.КонПериода2МИтого 		+ СтруктураПоказателей.КонПериода2МПоСчетуИтого;
			СтруктураПоказателей.ОборотыПериода1МИтого 	= СтруктураПоказателей.ОборотыПериода1МИтого 	+ СтруктураПоказателей.ОборотыПериода1МПоСчетуИтого;
			СтруктураПоказателей.КонПериода1МИтого 		= СтруктураПоказателей.КонПериода1МИтого 		+ СтруктураПоказателей.КонПериода1МПоСчетуИтого;
			СтруктураПоказателей.Колонка11ЧИтого 		= СтруктураПоказателей.Колонка11ЧИтого 			+ СтруктураПоказателей.Колонка11ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка12ЧИтого 		= СтруктураПоказателей.Колонка12ЧИтого 			+ СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка13ЧИтого 		= СтруктураПоказателей.Колонка13ЧИтого 			+ СтруктураПоказателей.Колонка13ЧПоСчетуИтого;	
			СтруктураПоказателей.Колонка14ЧИтого 		= СтруктураПоказателей.Колонка14ЧИтого 			+ СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка15ЧИтого 		= СтруктураПоказателей.Колонка15ЧИтого 			+ СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
			СтруктураПоказателей.СуммаРезерваИтого 		= СтруктураПоказателей.СуммаРезерваИтого 		+ СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
			СтруктураПоказателей.ОборотыПериодаТекМИтого= СтруктураПоказателей.ОборотыПериодаТекМИтого 	+ СтруктураПоказателей.ОборотыПериодаТекМПоСчетуИтого;
			СтруктураПоказателей.КонПериодаТекМИтого 	= СтруктураПоказателей.КонПериодаТекМИтого 		+ СтруктураПоказателей.КонПериодаТекМПоСчетуИтого;
			СтруктураПоказателей.Колонка22ЧИтого		= СтруктураПоказателей.Колонка22ЧИтого 			+ СтруктураПоказателей.Колонка22ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка23ЧИтого		= СтруктураПоказателей.Колонка23ЧИтого 			+ СтруктураПоказателей.Колонка23ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка24ЧИтого		= СтруктураПоказателей.Колонка24ЧИтого 			+ СтруктураПоказателей.Колонка24ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка25ЧИтого		= СтруктураПоказателей.Колонка25ЧИтого 			+ СтруктураПоказателей.Колонка25ЧПоСчетуИтого;
			СтруктураПоказателей.Колонка26ЧИтого		= СтруктураПоказателей.Колонка26ЧИтого 			+ СтруктураПоказателей.Колонка26ЧПоСчетуИтого;
		
			ГруппировкаВыводилась = Ложь;
			Для Инд = 0 По ТаблицаСтрокПоСчету.Количество() - 1 Цикл
				Для Инд1 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов.Количество() - 1 Цикл
					МассивОбластей = ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов[Инд1];
					ТабДокумент.Вывести(МассивОбластей[0]);
					ТабДокумент.Присоединить(МассивОбластей[1], 1, "По срокам 1 месяц", Ложь);
					ТабДокумент.Присоединить(МассивОбластей[2],,, Истина);
					ТабДокумент.Присоединить(МассивОбластей[3], 2, "По срокам на дату сдачи отчета", Ложь);
					ТабДокумент.НачатьГруппуСтрок("ИтогоПодоговору" + МассивОбластей[0].Параметры.Договор, Ложь);
					Для Инд2 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1].Количество() - 1 Цикл
						Если ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2] = Неопределено Тогда Продолжить; КонецЕсли;
						МассивОбластей = ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2];
						ТабДокумент.Вывести(МассивОбластей[0]);
						ТабДокумент.Присоединить(МассивОбластей[1], 1, "По срокам 1 месяц", Ложь);
						ТабДокумент.Присоединить(МассивОбластей[2],,, Истина);
						ТабДокумент.Присоединить(МассивОбластей[3], 2, "По срокам на дату сдачи отчета", Ложь);
					КонецЦикла;	          
					ТабДокумент.ЗакончитьГруппуСтрок();
				КонецЦикла;	
			КонецЦикла;
			ТабДокумент.ЗакончитьГруппуСтрок();
		КонецЕсли;	
				
		ОблИтого = Макет.ПолучитьОбласть("Итого|Тело");
		//ОблИтого.Параметры.Итого			 	= "Итого:";
		ОблИтого.Параметры.КонПериода2М 		= формат(СтруктураПоказателей.КонПериода2МИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.ОборотыПериода1М 	= формат(СтруктураПоказателей.ОборотыПериода1МИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.КонПериода1М  		= формат(СтруктураПоказателей.КонПериода1МИтого, "ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Вывести(ОблИтого);
		
		ОблИтого = Макет.ПолучитьОбласть("Итого|КонПериода1МПоСрокам");
		ОблИтого.Параметры.Колонка11Ч 	 	 	= формат(СтруктураПоказателей.Колонка11ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка12Ч 	 	 	= формат(СтруктураПоказателей.Колонка12ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка13Ч 	 	 	= формат(СтруктураПоказателей.Колонка13ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка14Ч 	 	 	= формат(СтруктураПоказателей.Колонка14ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка15Ч 	 	 	= формат(СтруктураПоказателей.Колонка15ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Присоединить(ОблИтого, 1, "По срокам 1 месяц", Ложь);
		
		ОблИтого = Макет.ПолучитьОбласть("Итого|Тело1");
		ОблИтого.Параметры.СуммаРезерва 	 	= формат(СтруктураПоказателей.СуммаРезерваИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.ОборотыПериодаТекМ	= формат(СтруктураПоказателей.ОборотыПериодаТекМИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.КонПериодаТекМ	 	= формат(СтруктураПоказателей.КонПериодаТекМИтого, "ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Присоединить(ОблИтого,,, Истина);
		
		ОблИтого = Макет.ПолучитьОбласть("Итого|КонПериодаПоСрокам");
		ОблИтого.Параметры.Колонка22Ч 	 	 	= формат(СтруктураПоказателей.Колонка22ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка23Ч 	 	 	= формат(СтруктураПоказателей.Колонка23ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка24Ч 	 	 	= формат(СтруктураПоказателей.Колонка24ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка25Ч 	 	 	= формат(СтруктураПоказателей.Колонка25ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ОблИтого.Параметры.Колонка26Ч 	 	 	= формат(СтруктураПоказателей.Колонка26ЧИтого, "ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Присоединить(ОблИтого, 2, "По срокам на дату сдачи отчета", Ложь);
		
		//ОблПод = Макет.ПолучитьОбласть("Подвал");
		//Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ВыборкаШапка.Организация, ДатаДокументаИнветаризации,);
		//ОблПод.Параметры.Бухгалтер    = Руководители.ГлавныйБухгалтер;
		//ТабДокумент.Вывести(ОблПод);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаОбъекта);
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции // ПечатьРеестрПросроченнойЗадолженностиПриложение_7_2()

Процедура ВыбратьЭлементыДляПросроченнойВИерархии(ВыборкаСИерархией, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке) 
	Пока ВыборкаСИерархией.Следующий() Цикл
		Если ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			Если ТаблицаСтрокПоСчету.Количество() > 1 
				и Не ЗначениеЗаполнено(ВыборкаСИерархией.СчетРасчетов.Родитель) Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|Тело");
				ОбластьСтрока.Параметры.Итого			 	= "Итого по счету: " + ТаблицаСтрокПоСчету[0].СчетИерархия;
				ОбластьСтрока.Параметры.КонПериода2М 		= СтруктураПоказателей.КонПериода2МПоСчетуИтого;
				ОбластьСтрока.Параметры.ОборотыПериода1М	= СтруктураПоказателей.ОборотыПериода1МПоСчетуИтого;
				ОбластьСтрока.Параметры.КонПериода1М		= СтруктураПоказателей.КонПериода1МПоСчетуИтого;
				ТабДокумент.Вывести(ОбластьСтрока);
				
				ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|КонПериода1МПоСрокам");
				ОбластьСтрока.Параметры.Колонка11Ч			= СтруктураПоказателей.Колонка11ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка12Ч			= СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка13Ч			= СтруктураПоказателей.Колонка13ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка14Ч			= СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка15Ч			= СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
				ТабДокумент.Присоединить(ОбластьСтрока, 1, "По срокам 1 месяц", Ложь);
				
				ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|Тело1");
				ОбластьСтрока.Параметры.СуммаРезерва		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
				ОбластьСтрока.Параметры.ОборотыПериодаТекМ	= СтруктураПоказателей.ОборотыПериодаТекМПоСчетуИтого;
				ОбластьСтрока.Параметры.КонПериодаТекМ		= СтруктураПоказателей.КонПериодаТекМПоСчетуИтого;
				ТабДокумент.Присоединить(ОбластьСтрока,,, Истина);
				
				ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету|КонПериодаПоСрокам");
				ОбластьСтрока.Параметры.Колонка22Ч			= СтруктураПоказателей.Колонка22ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка23Ч			= СтруктураПоказателей.Колонка23ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка24Ч			= СтруктураПоказателей.Колонка24ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка25Ч			= СтруктураПоказателей.Колонка25ЧПоСчетуИтого;
				ОбластьСтрока.Параметры.Колонка26Ч			= СтруктураПоказателей.Колонка26ЧПоСчетуИтого;
				ТабДокумент.Присоединить(ОбластьСтрока, 2, "По срокам на дату сдачи отчета", Ложь);
				
				ТабДокумент.НачатьГруппуСтрок("ИтогоПоСчету" + ТаблицаСтрокПоСчету[0].СчетИерархия, Ложь);
				
				СтруктураПоказателей.КонПериода2МИтого 		= СтруктураПоказателей.КонПериода2МИтого 		+ СтруктураПоказателей.КонПериода2МПоСчетуИтого;
				СтруктураПоказателей.ОборотыПериода1МИтого 	= СтруктураПоказателей.ОборотыПериода1МИтого 	+ СтруктураПоказателей.ОборотыПериода1МПоСчетуИтого;
				СтруктураПоказателей.КонПериода1МИтого 		= СтруктураПоказателей.КонПериода1МИтого 		+ СтруктураПоказателей.КонПериода1МПоСчетуИтого;
				СтруктураПоказателей.Колонка11ЧИтого 		= СтруктураПоказателей.Колонка11ЧИтого 			+ СтруктураПоказателей.Колонка11ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка12ЧИтого 		= СтруктураПоказателей.Колонка12ЧИтого 			+ СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка13ЧИтого 		= СтруктураПоказателей.Колонка13ЧИтого 			+ СтруктураПоказателей.Колонка13ЧПоСчетуИтого;	
				СтруктураПоказателей.Колонка14ЧИтого 		= СтруктураПоказателей.Колонка14ЧИтого 			+ СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка15ЧИтого 		= СтруктураПоказателей.Колонка15ЧИтого 			+ СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
				СтруктураПоказателей.СуммаРезерваИтого 		= СтруктураПоказателей.СуммаРезерваИтого 		+ СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
				СтруктураПоказателей.ОборотыПериодаТекМИтого= СтруктураПоказателей.ОборотыПериодаТекМИтого 	+ СтруктураПоказателей.ОборотыПериодаТекМПоСчетуИтого;
				СтруктураПоказателей.КонПериодаТекМИтого 	= СтруктураПоказателей.КонПериодаТекМИтого 		+ СтруктураПоказателей.КонПериодаТекМПоСчетуИтого;
				СтруктураПоказателей.Колонка22ЧИтого		= СтруктураПоказателей.Колонка22ЧИтого 			+ СтруктураПоказателей.Колонка22ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка23ЧИтого		= СтруктураПоказателей.Колонка23ЧИтого 			+ СтруктураПоказателей.Колонка23ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка24ЧИтого		= СтруктураПоказателей.Колонка24ЧИтого 			+ СтруктураПоказателей.Колонка24ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка25ЧИтого		= СтруктураПоказателей.Колонка25ЧИтого 			+ СтруктураПоказателей.Колонка25ЧПоСчетуИтого;
				СтруктураПоказателей.Колонка26ЧИтого		= СтруктураПоказателей.Колонка26ЧИтого 			+ СтруктураПоказателей.Колонка26ЧПоСчетуИтого;
				
				ГруппировкаВыводилась = Ложь;
				Для Инд = 0 По ТаблицаСтрокПоСчету.Количество() - 1 Цикл
					Для Инд1 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов.Количество() - 1 Цикл
						МассивОбластей = ТаблицаСтрокПоСчету[Инд].СтрокаРасчетов[Инд1];
						ТабДокумент.Вывести(МассивОбластей[0]);
						ТабДокумент.Присоединить(МассивОбластей[1], 1, "По срокам 1 месяц", Ложь);
						ТабДокумент.Присоединить(МассивОбластей[2],,, Истина);
						ТабДокумент.Присоединить(МассивОбластей[3], 2, "По срокам на дату сдачи отчета", Ложь);
						ТабДокумент.НачатьГруппуСтрок("ИтогоПодоговору" + МассивОбластей[0].Параметры.Договор, Ложь);
						Для Инд2 = 0 По ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1].Количество() - 1 Цикл
							Если ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2] = Неопределено Тогда Продолжить; КонецЕсли;
							МассивОбластей = ТаблицаСтрокПоСчету[Инд].СтрокаДетальная[Инд1][Инд2];
							ТабДокумент.Вывести(МассивОбластей[0]);
							ТабДокумент.Присоединить(МассивОбластей[1], 1, "По срокам 1 месяц", Ложь);
							ТабДокумент.Присоединить(МассивОбластей[2],,, Истина);
							ТабДокумент.Присоединить(МассивОбластей[3], 2, "По срокам на дату сдачи отчета", Ложь);
						КонецЦикла;	          
						ТабДокумент.ЗакончитьГруппуСтрок();
					КонецЦикла;	
				КонецЦикла;
				ТабДокумент.ЗакончитьГруппуСтрок();
				
				СтруктураПоказателей.Вставить("КонПериодаТекМПоСчетуИтого"		, 0);
				СтруктураПоказателей.Вставить("СуммаРезерваПоСчетуИтого"		, 0);   
				СтруктураПоказателей.Вставить("Колонка11ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка12ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("Колонка13ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка14ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("Колонка15ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка17ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("СуммаРезерваНУЧПоСчетуИтого"		, 0);
				СтруктураПоказателей.Вставить("КонПериода2МПоСчетуИтого"		, 0);   
				СтруктураПоказателей.Вставить("ОборотыПериода1МПоСчетуИтого"	, 0);  
				СтруктураПоказателей.Вставить("КонПериода1МПоСчетуИтого"		, 0);   
				СтруктураПоказателей.Вставить("ОборотыПериодаТекМПоСчетуИтого"	, 0);  
				СтруктураПоказателей.Вставить("Колонка22ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("Колонка23ЧПоСчетуИтого"			, 0);  
				СтруктураПоказателей.Вставить("Колонка24ЧПоСчетуИтого"			, 0);   
				СтруктураПоказателей.Вставить("Колонка25ЧПоСчетуИтого"			, 0);       
				СтруктураПоказателей.Вставить("Колонка26ЧПоСчетуИтого"			, 0);
			КонецЕсли;
			Если ТаблицаСтрокПоСчету.Количество() и ВыборкаСИерархией.СчетРасчетов.Родитель = ТаблицаСтрокПоСчету[0].СчетИерархия Тогда
				СтрокаТЗ = ТаблицаСтрокПоСчету[ТаблицаСтрокПоСчету.Количество() - 1];
				СтрокаТЗ.СчетГруппировка = ВыборкаСИерархией.СчетРасчетов;
			Иначе	
				ТаблицаСтрокПоСчету.Очистить();
				СтрокаТЗ = ТаблицаСтрокПоСчету.Добавить();
				СтрокаТЗ.СчетИерархия = ВыборкаСИерархией.СчетРасчетов;
				СтрокаТЗ.СтрокаИерархия = ОбластьСтрока;
				СтрокаТЗ.СтрокаРасчетов = Новый Массив();
				СтрокаТЗ.СтрокаДетальная = Новый Массив(1, 1);
			КонецЕсли;	
			
			ВыбратьЭлементыДляПросроченнойВИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"СчетРасчетов"), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке); 
		ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			//ОбластьСтрока = Макет.ПолучитьОбласть("ИтогоПоСчету");
			//ОбластьСтрока.Параметры.Итого			 	= "Итого по счету: " + ВыборкаСИерархией.СчетРасчетов;
			//ОбластьСтрока.Параметры.СуммаДЗБезРезерва 	= СтруктураПоказателей.СуммаДЗБезРезерваПоСчетуИтого;
			//ОбластьСтрока.Параметры.СуммаРезерва		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого;
			//ОбластьСтрока.Параметры.СуммаДЗСРезервом	= СтруктураПоказателей.СуммаДЗСРезервомПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка12Ч			= СтруктураПоказателей.Колонка12ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка13Ч			= СтруктураПоказателей.Колонка13ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка14Ч			= СтруктураПоказателей.Колонка14ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка15Ч			= СтруктураПоказателей.Колонка15ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка16Ч			= СтруктураПоказателей.Колонка16ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.Колонка17Ч			= СтруктураПоказателей.Колонка17ЧПоСчетуИтого;
			//ОбластьСтрока.Параметры.СуммаРезерваНУ		= СтруктураПоказателей.СуммаРезерваНУЧПоСчетуИтого;
			
			СтрокаТЗ = ТаблицаСтрокПоСчету[ТаблицаСтрокПоСчету.Количество() - 1];
			СтрокаТЗ.СчетГруппировка = ВыборкаСИерархией.СчетРасчетов;
			//СтрокаТЗ.СтрокаГруппировка = ОбластьСтрока;
			
			ВыбратьЭлементыДляПросроченнойБезИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке); 
		ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
      		ВыбратьЭлементыДляПросроченной(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.Прямой), ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, КоличествоВСтеке); 
    	КонецЕсли;   
  	КонецЦикла;
КонецПроцедуры

Процедура ВыбратьЭлементыДляПросроченнойБезИерархии(ВыборкаБезИерархии, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, СтруктураПоказателей, КоличествоВСтеке) 
	Пока ВыборкаБезИерархии.Следующий() Цикл
		СуммаДЗБезРезерва = ВыборкаБезИерархии.Подтверждено + ВыборкаБезИерархии.НеПодтверждено;
		Если СуммаДЗБезРезерва = 0 и (ВыборкаБезИерархии.ВИЛС_Подтверждено1Месяц + ВыборкаБезИерархии.ВИЛС_НеПодтверждено1Месяц = 0) и (ВыборкаБезИерархии.ВИЛС_Подтверждено2Месяц + ВыборкаБезИерархии.ВИЛС_НеПодтверждено2Месяц = 0) Тогда Продолжить; КонецЕсли;
		
		//МассивСтрокОстатковПоДоговору = ВыборкаОстатков.НайтиСтроки(СтруктураПоиска);
		
		Выборка_3.Сбросить();
		
		ДанныеДляПросроченной_1 = ПолучитьДанныеСтрокиДляПросроченной_1(ВыборкаШапка, ВыборкаБезИерархии, ВыборкаДокументов, ВыборкаОстатков, ДтКт);
		
		ДанныеДляПросроченной_2 = ПолучитьДанныеСтрокиДляПросроченной_2(ВыборкаШапка, ВыборкаБезИерархии, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ДтКт, СуммаДЗБезРезерва, ДанныеДляПросроченной_1);
			
		ТЗДляСтруктуры = ДанныеДляПросроченной_2.ТЗДляСтруктуры;
		КоличествоСтрокТЗДляСтруктуры = ТЗДляСтруктуры.Количество();
		Если КоличествоСтрокТЗДляСтруктуры = 0 Тогда Продолжить; КонецЕсли; 
		
		МассивОбластей = Новый Массив();
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Тело");
		ОбластьСтрока.Параметры.Заполнить(ДанныеДляПросроченной_1);
		ОбластьСтрока.Параметры.Заполнить(ДанныеДляПросроченной_2);
		//ОбластьСтрока.Параметры.НомерСтроки = НПП;
		СтруктураПоказателей.НПП = СтруктураПоказателей.НПП + 1;
		
		Если КоличествоСтрокТЗДляСтруктуры = 1 Тогда
			ОбластьСтрока2ДатаДолга 			= ТЗДляСтруктуры[0].ДатаДок; 
			ОбластьСтрока2ДатаПогашенияДЗ 		= ТЗДляСтруктуры[0].ДатаПогашенияДЗСтр;
			ОбластьСтрока.Параметры.ДатаДолга1М = ТЗДляСтруктуры[0].ДатаДок1М;
		Иначе
			КТЗ = ТЗДляСтруктуры.Скопировать(, "ДатаДок, ДатаДок1М, ДатаПогашенияДЗСтр");
			КТЗ.Сортировать("ДатаДок Возр");
			Для Каждого СтрокаКТЗ Из КТЗ Цикл
				Если Не ЗначениеЗаполнено(СтрокаКТЗ.ДатаДок) Тогда Продолжить; КонецЕсли;
				ОбластьСтрока2ДатаДолга 		= СтрокаКТЗ.ДатаДок;
				ОбластьСтрока2ДатаПогашенияДЗ 	= СтрокаКТЗ.ДатаПогашенияДЗСтр;
				Прервать;
			КонецЦикла;
			КТЗ.Сортировать("ДатаДок1М Возр");
			Для Каждого СтрокаКТЗ Из КТЗ Цикл
				Если Не ЗначениеЗаполнено(СтрокаКТЗ.ДатаДок1М) Тогда Продолжить; КонецЕсли;
				ОбластьСтрока.Параметры.ДатаДолга1М = СтрокаКТЗ.ДатаДок1М;
				Прервать;
			КонецЦикла;	
			КТЗ = Неопределено;
		КонецЕсли;
		
		СведенияОбКонтрагенте = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаБезИерархии.Контрагент, ВыборкаШапка.КонецПериода);
		КонтраНаим = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование, ЮридическийАдрес, Телефоны");
		
		ОбластьСтрока.Параметры.НаименованиеСтр = КонтраНаим;
		ОбластьСтрока.Параметры.Счет = ВыборкаБезИерархии.СчетРасчетов;
		ОбластьСтрока.Параметры.НомерДоговора = ?(ЗначениеЗаполнено(ВыборкаБезИерархии.Договор),?(ЗначениеЗаполнено(ВыборкаБезИерархии.Договор.Номер), ВыборкаБезИерархии.Договор.Номер, ВыборкаБезИерархии.Договор.Наименование), "б.н.");
		ОбластьСтрока.Параметры.ДатаДоговора = ?(ЗначениеЗаполнено(ВыборкаБезИерархии.Договор),ВыборкаБезИерархии.Договор.Дата, Дата(1,1,1,0,0,0));
		ОбластьСтрока.Параметры.ИНН = ВыборкаБезИерархии.Контрагент.ИНН;
		ОбластьСтрока.Параметры.КонПериода2М 	= ТЗДляСтруктуры.Итог("Колонка01");
		ОбластьСтрока.Параметры.КонПериода1М 	= ТЗДляСтруктуры.Итог("Колонка11") 
												+ ТЗДляСтруктуры.Итог("Колонка12") 
												+ ТЗДляСтруктуры.Итог("Колонка13") 
												+ ТЗДляСтруктуры.Итог("Колонка14") 
												+ ТЗДляСтруктуры.Итог("Колонка15");
		МассивОбластей.Добавить(ОбластьСтрока);	
		
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка|КонПериода1МПоСрокам");
		ОбластьСтрока1.Параметры.Колонка11Ч = ТЗДляСтруктуры.Итог("Колонка11");
		ОбластьСтрока1.Параметры.Колонка12Ч = ТЗДляСтруктуры.Итог("Колонка12");
		ОбластьСтрока1.Параметры.Колонка13Ч = ТЗДляСтруктуры.Итог("Колонка13");
		ОбластьСтрока1.Параметры.Колонка14Ч = ТЗДляСтруктуры.Итог("Колонка14");
		ОбластьСтрока1.Параметры.Колонка15Ч = ТЗДляСтруктуры.Итог("Колонка15");
		МассивОбластей.Добавить(ОбластьСтрока1);
		
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка|Тело1"); 
		ОбластьСтрока2.Параметры.Заполнить(ДанныеДляПросроченной_1);
		ОбластьСтрока2.Параметры.Заполнить(ДанныеДляПросроченной_2);
		ОбластьСтрока2.Параметры.ДатаДолга 			= ОбластьСтрока2ДатаДолга;
		ОбластьСтрока2.Параметры.ДатаПогашенияДЗ 	= ОбластьСтрока2ДатаПогашенияДЗ;
		//Если ЗначениеЗаполнено(ВыборкаБезИерархии.Договор) и ТипЗнч(ВыборкаБезИерархии.Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		//	ДатаПогашенияДЗИзКарточкиДоговора = УправлениеСвойствами.ЗначениеСвойства(ВыборкаБезИерархии.Договор, СвойствоСрокПогашенияЗадолженности);
		//	ОбластьСтрока2.Параметры.ДатаПогашенияДЗИзКарточкиДоговора 	= ДатаПогашенияДЗИзКарточкиДоговора;
		//Конецесли;	
		ОбластьСтрока2.Параметры.КонПериодаТекМ = ТЗДляСтруктуры.Итог("Колонка22") 
												+ ТЗДляСтруктуры.Итог("Колонка23") 
												+ ТЗДляСтруктуры.Итог("Колонка24") 
												+ ТЗДляСтруктуры.Итог("Колонка25") 
												+ ТЗДляСтруктуры.Итог("Колонка26");
		МассивОбластей.Добавить(ОбластьСтрока2);
		
		ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка|КонПериодаПоСрокам");
		ОбластьСтрока3.Параметры.Колонка22Ч = ТЗДляСтруктуры.Итог("Колонка22");
		ОбластьСтрока3.Параметры.Колонка23Ч = ТЗДляСтруктуры.Итог("Колонка23");
		ОбластьСтрока3.Параметры.Колонка24Ч = ТЗДляСтруктуры.Итог("Колонка24");
		ОбластьСтрока3.Параметры.Колонка25Ч = ТЗДляСтруктуры.Итог("Колонка25");
		ОбластьСтрока3.Параметры.Колонка26Ч = ТЗДляСтруктуры.Итог("Колонка26");
		МассивОбластей.Добавить(ОбластьСтрока3);	
		
		Если 	Не ?(ОбластьСтрока. Параметры.КонПериода2М  		= Неопределено, 0, ОбластьСтрока. Параметры.КонПериода2М) = 0 
			или Не ?(ОбластьСтрока. Параметры.ОборотыПериода1М  	= Неопределено, 0, ОбластьСтрока. Параметры.ОборотыПериода1М) = 0
			или Не ?(ОбластьСтрока. Параметры.КонПериода1М  		= Неопределено, 0, ОбластьСтрока. Параметры.КонПериода1М) = 0
			или Не ?(ОбластьСтрока1.Параметры.Колонка11Ч  			= Неопределено, 0, ОбластьСтрока1.Параметры.Колонка11Ч) = 0
			или Не ?(ОбластьСтрока1.Параметры.Колонка12Ч  			= Неопределено, 0, ОбластьСтрока1.Параметры.Колонка12Ч) = 0
			или Не ?(ОбластьСтрока1.Параметры.Колонка13Ч  			= Неопределено, 0, ОбластьСтрока1.Параметры.Колонка13Ч) = 0
			или Не ?(ОбластьСтрока1.Параметры.Колонка14Ч  			= Неопределено, 0, ОбластьСтрока1.Параметры.Колонка14Ч) = 0
			или Не ?(ОбластьСтрока1.Параметры.Колонка15Ч  			= Неопределено, 0, ОбластьСтрока1.Параметры.Колонка15Ч) = 0
			или Не ?(ОбластьСтрока2.Параметры.СуммаРезерва  		= Неопределено, 0, ОбластьСтрока2.Параметры.СуммаРезерва) = 0
			или Не ?(ОбластьСтрока2.Параметры.ОборотыПериодаТекМ  	= Неопределено, 0, ОбластьСтрока2.Параметры.ОборотыПериодаТекМ) = 0
			или Не ?(ОбластьСтрока2.Параметры.КонПериодаТекМ  		= Неопределено, 0, ОбластьСтрока2.Параметры.КонПериодаТекМ) = 0
			или Не ?(ОбластьСтрока3.Параметры.Колонка22Ч  			= Неопределено, 0, ОбластьСтрока3.Параметры.Колонка22Ч) = 0
			или Не ?(ОбластьСтрока3.Параметры.Колонка23Ч  			= Неопределено, 0, ОбластьСтрока3.Параметры.Колонка23Ч) = 0
			или Не ?(ОбластьСтрока3.Параметры.Колонка24Ч  			= Неопределено, 0, ОбластьСтрока3.Параметры.Колонка24Ч) = 0
			или Не ?(ОбластьСтрока3.Параметры.Колонка25Ч  			= Неопределено, 0, ОбластьСтрока3.Параметры.Колонка25Ч) = 0
			или Не ?(ОбластьСтрока3.Параметры.Колонка26Ч  			= Неопределено, 0, ОбластьСтрока3.Параметры.Колонка26Ч) = 0
			Тогда
			СтрокаТЗ1 = ТаблицаСтрокПоСчету[ТаблицаСтрокПоСчету.Количество() - 1];
			Если ЗначениеЗаполнено(СтрокаТЗ1.СчетРасчетов) тогда
				СтрокаТЗ = ТаблицаСтрокПоСчету.Добавить();
				СтрокаТЗ.СчетИерархия 		= СтрокаТЗ1.СчетИерархия;
				СтрокаТЗ.СчетГруппировка 	= СтрокаТЗ1.СчетГруппировка;
				СтрокаТЗ.СчетРасчетов 		= ВыборкаБезИерархии.СчетРасчетов;
				СтрокаТЗ.СтрокаРасчетов = Новый Массив();
				СтрокаТЗ.СтрокаДетальная = Новый Массив(1, 1);   //100
			Иначе
				СтрокаТЗ = СтрокаТЗ1;
				СтрокаТЗ.СчетРасчетов 		= ВыборкаБезИерархии.СчетРасчетов;
			КонецЕсли;	
			СтрокаТЗ.СтрокаРасчетов.Добавить(МассивОбластей);
			//Если СтрокаТЗ.СтрокаДетальная = Неопределено Тогда
			//	СтрокаТЗ.СтрокаДетальная = Новый Массив(100, 100);
			//КонецЕсли;	
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтруктураПоказателей.Колонка11ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка11ЧПоСчетуИтого 	+ ОбластьСтрока1.Параметры.Колонка11Ч;
		СтруктураПоказателей.Колонка12ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка12ЧПоСчетуИтого 	+ ОбластьСтрока1.Параметры.Колонка12Ч;
		СтруктураПоказателей.Колонка13ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка13ЧПоСчетуИтого 	+ ОбластьСтрока1.Параметры.Колонка13Ч;
		СтруктураПоказателей.Колонка14ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка14ЧПоСчетуИтого 	+ ОбластьСтрока1.Параметры.Колонка14Ч;
		СтруктураПоказателей.Колонка15ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка15ЧПоСчетуИтого 	+ ОбластьСтрока1.Параметры.Колонка15Ч;
		
		СтруктураПоказателей.Колонка22ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка22ЧПоСчетуИтого 	+ ОбластьСтрока3.Параметры.Колонка22Ч;
		СтруктураПоказателей.Колонка23ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка23ЧПоСчетуИтого 	+ ОбластьСтрока3.Параметры.Колонка23Ч; 
		СтруктураПоказателей.Колонка24ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка24ЧПоСчетуИтого 	+ ОбластьСтрока3.Параметры.Колонка24Ч;
		СтруктураПоказателей.Колонка25ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка25ЧПоСчетуИтого 	+ ОбластьСтрока3.Параметры.Колонка25Ч;
		СтруктураПоказателей.Колонка26ЧПоСчетуИтого 	= СтруктураПоказателей.Колонка26ЧПоСчетуИтого 	+ ОбластьСтрока3.Параметры.Колонка26Ч;
		
		СтруктураПоказателей.КонПериода2МПоСчетуИтого 		= СтруктураПоказателей.КонПериода2МПоСчетуИтого 		+ ОбластьСтрока.Параметры.КонПериода2М;
		СтруктураПоказателей.ОборотыПериода1МПоСчетуИтого	= СтруктураПоказателей.ОборотыПериода1МПоСчетуИтого 	+ ОбластьСтрока.Параметры.ОборотыПериода1М;
		СтруктураПоказателей.КонПериода1МПоСчетуИтого	 	= СтруктураПоказателей.КонПериода1МПоСчетуИтого 		+ ОбластьСтрока.Параметры.КонПериода1М;
		
		СтруктураПоказателей.СуммаРезерваПоСчетуИтого 		= СтруктураПоказателей.СуммаРезерваПоСчетуИтого 		+ ОбластьСтрока2.Параметры.СуммаРезерва;
		СтруктураПоказателей.ОборотыПериодаТекМПоСчетуИтого	= СтруктураПоказателей.ОборотыПериодаТекМПоСчетуИтого 	+ ОбластьСтрока2.Параметры.ОборотыПериодаТекМ;
		СтруктураПоказателей.КонПериодаТекМПоСчетуИтого 	= СтруктураПоказателей.КонПериодаТекМПоСчетуИтого 		+ ОбластьСтрока2.Параметры.КонПериодаТекМ;
		
		Для каждого СтрокаТЗДляСтруктуры Из ТЗДляСтруктуры Цикл
			Если СтрокаТЗДляСтруктуры.Колонка11 = 0
				и СтрокаТЗДляСтруктуры.Колонка12 = 0
				и СтрокаТЗДляСтруктуры.Колонка13 = 0
				и СтрокаТЗДляСтруктуры.Колонка14 = 0
				и СтрокаТЗДляСтруктуры.Колонка15 = 0
				и СтрокаТЗДляСтруктуры.Колонка22 = 0
				и СтрокаТЗДляСтруктуры.Колонка23 = 0
				и СтрокаТЗДляСтруктуры.Колонка24 = 0
				и СтрокаТЗДляСтруктуры.Колонка25 = 0
				и СтрокаТЗДляСтруктуры.Колонка26 = 0 Тогда Продолжить; КонецЕсли;
			МассивОбластей = Новый Массив();
			ОбластьСтрокаД = Макет.ПолучитьОбласть("СтрокаДетальная|Тело");
			ОбластьСтрокаД.Параметры.ЗаЧто1М 					= СтрокаТЗДляСтруктуры.ЗаЧто1М;
			ОбластьСтрокаД.Параметры.ДатаДолга1М 				= СтрокаТЗДляСтруктуры.ДатаДок1М;
			ОбластьСтрокаД.Параметры.Регистратор1М				= СтрокаТЗДляСтруктуры.Регистратор1М;
			ОбластьСтрокаД.Параметры.РегистраторПредставление1М	= СтрокаТЗДляСтруктуры.РегистраторПредставление1М;
			МассивОбластей.Добавить(ОбластьСтрокаД);
			
			ОбластьСтрокаД1 = Макет.ПолучитьОбласть("СтрокаДетальная|КонПериода1МПоСрокам");
			ОбластьСтрокаД1.Параметры.Колонка11Ч 				= СтрокаТЗДляСтруктуры.Колонка11;
			ОбластьСтрокаД1.Параметры.Колонка12Ч 				= СтрокаТЗДляСтруктуры.Колонка12;
			ОбластьСтрокаД1.Параметры.Колонка13Ч 				= СтрокаТЗДляСтруктуры.Колонка13;
			ОбластьСтрокаД1.Параметры.Колонка14Ч 				= СтрокаТЗДляСтруктуры.Колонка14;
			ОбластьСтрокаД1.Параметры.Колонка15Ч 				= СтрокаТЗДляСтруктуры.Колонка15;
			//ОбластьСтрокаД.Присоединить(ОбластьСтрокаД1, 1, "По срокам 1 месяц", Ложь); 
			МассивОбластей.Добавить(ОбластьСтрокаД1);
			
			ОбластьСтрокаД2 = Макет.ПолучитьОбласть("СтрокаДетальная|Тело1");
			ОбластьСтрокаД2.Параметры.ЗаЧто						= СтрокаТЗДляСтруктуры.ЗаЧто;
			ОбластьСтрокаД2.Параметры.ДатаДолга 				= СтрокаТЗДляСтруктуры.ДатаДок;
			ОбластьСтрокаД2.Параметры.Регистратор 				= СтрокаТЗДляСтруктуры.Регистратор;
			ОбластьСтрокаД2.Параметры.РегистраторПредставление 	= СтрокаТЗДляСтруктуры.РегистраторПредставление;
			//ОбластьСтрокаД.Присоединить(ОбластьСтрокаД2,,, Истина); 
			МассивОбластей.Добавить(ОбластьСтрокаД2);
			
			ОбластьСтрокаД3 = Макет.ПолучитьОбласть("СтрокаДетальная|КонПериодаПоСрокам");
			ОбластьСтрокаД3.Параметры.Колонка22Ч 				= СтрокаТЗДляСтруктуры.Колонка22;
			ОбластьСтрокаД3.Параметры.Колонка23Ч 				= СтрокаТЗДляСтруктуры.Колонка23;
			ОбластьСтрокаД3.Параметры.Колонка24Ч 				= СтрокаТЗДляСтруктуры.Колонка24;
			ОбластьСтрокаД3.Параметры.Колонка25Ч 				= СтрокаТЗДляСтруктуры.Колонка25;
			ОбластьСтрокаД3.Параметры.Колонка26Ч 				= СтрокаТЗДляСтруктуры.Колонка26;
			//ОбластьСтрокаД.Присоединить(ОбластьСтрокаД3, 2, "По срокам на дату сдачи отчета", Ложь); 
			МассивОбластей.Добавить(ОбластьСтрокаД3);
			
			Если СтрокаТЗ.СтрокаДетальная[СтрокаТЗ.СтрокаРасчетов.ВГраница()][0] = Неопределено Тогда
				СтрокаТЗ.СтрокаДетальная[СтрокаТЗ.СтрокаРасчетов.ВГраница()].Вставить(0, МассивОбластей);
			Иначе	
				СтрокаТЗ.СтрокаДетальная[СтрокаТЗ.СтрокаРасчетов.ВГраница()].Добавить(МассивОбластей);
			КонецЕсли;	
		КонецЦикла;
		
		
	КонецЦикла;
КонецПроцедуры

Процедура ВыбратьЭлементыДляПросроченной(Выборка, ТаблицаСтрокПоСчету, ВыборкаДокументов, ВыборкаОстатков, Выборка_3, ВыборкаШапка, ДтКт, ТабДокумент, Макет, КоличествоВСтеке)    //ВыборкаОстатков, 
	Пока Выборка.Следующий() Цикл
    // Вставить обработку выборки ВыборкаБезИерархии
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьДанныеСтрокиДляПросроченной_1(Знач ВыборкаШапка, Знач ВыборкаБезИерархии, Знач ВыборкаДокументов, Знач ВыборкаОстатков, Знач ДтКт = "Дт")
	КонПериода 		= ВыборкаШапка.КонецПериода;
	Организация 	= ВыборкаШапка.Организация;
	Счет            = ВыборкаБезИерархии.СчетРасчетов;
	Контрагент		= ВыборкаБезИерархии.Контрагент;
	Договор			= ВыборкаБезИерархии.Договор;
	КонПериода2М = 0;  
	ОборотыПериода1М = 0;
	КонПериода1М = 0;
	ОборотыПериодаТекМ = 0;
	Мероприятие = Неопределено;
	СрокПогашенияЗадолженности = Неопределено; 
	СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, Счет);
	СписокСтрокПоТекущейЗадолженности = ВыборкаОстатков.НайтиСтроки(СтруктураПоиска);
	КоличествоНайденныхСтрок = СписокСтрокПоТекущейЗадолженности.Количество();
	Если КоличествоНайденныхСтрок Тогда
		Если ДтКт = "Дт" Тогда
			КонПериода2М 		= СписокСтрокПоТекущейЗадолженности[0].КонПериода2МДт;  
			ОборотыПериода1М 	= СписокСтрокПоТекущейЗадолженности[0].ОборотыПериода1МКт;// - Выборка.ОборотыПериода1МДт;
			КонПериода1М 		= СписокСтрокПоТекущейЗадолженности[0].КонПериода1МДт;
			ОборотыПериодаТекМ 	= СписокСтрокПоТекущейЗадолженности[0].ОборотыПериодаКт;// - Выборка.ОборотыПериодаДт;
			КонПериодаТекМ		= СписокСтрокПоТекущейЗадолженности[0].КонПериодаДт;									/////////////////////////////////////////КонПериодаДт;
		Иначе
			КонПериода2М 		= СписокСтрокПоТекущейЗадолженности[0].КонПериода2МКт;  
			ОборотыПериода1М 	= СписокСтрокПоТекущейЗадолженности[0].ОборотыПериода1МДт;// - Выборка.ОборотыПериода1МКт;
			КонПериода1М 		= СписокСтрокПоТекущейЗадолженности[0].КонПериода1МКт;
			ОборотыПериодаТекМ 	= СписокСтрокПоТекущейЗадолженности[0].ОборотыПериодаДт;// - Выборка.ОборотыПериодаКт;
			КонПериодаТекМ		= СписокСтрокПоТекущейЗадолженности[0].КонПериодаКт;									/////////////////////////////////////////КонПериодаКт;
		КонецЕсли; 
		Мероприятие 				= СписокСтрокПоТекущейЗадолженности[0].Мероприятие;  
		СрокПогашенияЗадолженности 	= СписокСтрокПоТекущейЗадолженности[0].СрокПогашенияЗадолженности;
	КонецЕсли; 
	
	//Если КонПериода < Дата(2019,2,1) Тогда
	//	СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
	//	МассивСчетов = Новый Массив();
	//	МассивСчетов.Добавить(Счет);
	//	Если ЗначениеЗаполнено(ДоговорКонтрагента) и ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
	//		Если ДоговорКонтрагента.ВИЛС_УстановленСрокПоставкиПослеАванса          						// КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
	//			и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
	//			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//			СтруктураПоиска = Новый Структура("ДебиторКредитор, ВИЛС_Договор, Счет", Контрагент, ДоговорКонтрагента, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//			СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//		ИначеЕсли ДоговорКонтрагента.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
	//			и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
	//			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	//			СтруктураПоиска = Новый Структура("ДебиторКредитор, ВИЛС_Договор, Счет", Контрагент, ДоговорКонтрагента, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	//			СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//		КонецЕсли; 
	//	КонецЕсли;
	//	СтруктураПоиска = Новый Структура("ДебиторКредитор, ВИЛС_Договор, Счет", Контрагент, ДоговорКонтрагента, Счет);
	//	СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//	Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
	//		Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
	//			Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
	//				СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//	КолС = СписокСтрокПоТекущейЗадолженности.Количество() - 1;
	//	Для НомС = 0 По КолС Цикл
	//		Если КонПериода1 > СписокСтрокПоТекущейЗадолженности[КолС - НомС].Период Тогда Продолжить; КонецЕсли;
	//		СписокСтрокПоТекущейЗадолженности.Удалить(КолС - НомС);
	//	КонецЦикла;
	//Конецесли;
		
	
	Колонка24 = "";
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("КонПериода2М", 		КонПериода2М);
	СтруктураСтроки.Вставить("ОборотыПериода1М", 	ОборотыПериода1М);
	СтруктураСтроки.Вставить("КонПериода1М", 		КонПериода1М);
	СтруктураСтроки.Вставить("ОборотыПериодаТекМ", 	ОборотыПериодаТекМ);
	СтруктураСтроки.Вставить("Колонка23", 			?(ЗначениеЗаполнено(Договор), Договор.Подразделение, ""));  
	СтруктураСтроки.Вставить("Колонка24", 			Колонка24);  
	СтруктураСтроки.Вставить("КонПериодаТекМ", 		КонПериодаТекМ);   
	СтруктураСтроки.Вставить("Мероприятие", 		Мероприятие);    
	СтруктураСтроки.Вставить("СрокПогашенияЗадолженности", СрокПогашенияЗадолженности);
	
	Возврат СтруктураСтроки;
КонецФункции	//	ПолучитьДанныеСтрокиПросроченной1()	                    
		
Функция ПолучитьДанныеСтрокиДляПросроченной_2(Знач ВыборкаШапка, Знач ВыборкаБезИерархии, Знач ВыборкаДокументов, Знач ВыборкаОстатков, Знач Выборка_3, Знач ДтКт = "Дт", Знач СуммаДолгаПоДоговору = 0, Знач ДанныеОДокПросроч = Неопределено) 
	КонПериода 		= ВыборкаШапка.КонецПериода;
	Организация 	= ВыборкаШапка.Организация;
	Счет            = ВыборкаБезИерархии.СчетРасчетов;
	Контрагент		= ВыборкаБезИерархии.Контрагент;
	Договор			= ВыборкаБезИерархии.Договор;
	ЗаЧто = ?(ЗначениеЗаполнено(Договор) и (ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") или ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")), Договор.СтатьяДвиженияДенежныхСредств, "");

	СуммаРезерва = ПолучитьРезерв(Счет, Контрагент, Договор, Выборка_3);
	СтруктураСтроки = Новый Структура;     //Просроченная 
	
	ТЗДляСтруктуры = Новый ТаблицаЗначений;
	ТЗДляСтруктуры.Колонки.Добавить("ТипДокумента");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаДок");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаДок1М");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаДокСист");
	ТЗДляСтруктуры.Колонки.Добавить("НомерДок");
	ТЗДляСтруктуры.Колонки.Добавить("НомерДок1М");
	ТЗДляСтруктуры.Колонки.Добавить("ЗаЧто");
	ТЗДляСтруктуры.Колонки.Добавить("ОбъектРасчетов");
	ТЗДляСтруктуры.Колонки.Добавить("ЗаЧто1М");
	ТЗДляСтруктуры.Колонки.Добавить("ОбъектРасчетов1М");
	ТЗДляСтруктуры.Колонки.Добавить("ПроверятьГалочку");
	ТЗДляСтруктуры.Колонки.Добавить("Регистратор");
	ТЗДляСтруктуры.Колонки.Добавить("Регистратор1М");
	ТЗДляСтруктуры.Колонки.Добавить("РегистраторПредставление");
	ТЗДляСтруктуры.Колонки.Добавить("РегистраторПредставление1М");
	
	ТЗДляСтруктуры.Колонки.Добавить("ДатаПогашенияДЗ");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаПогашенияДЗСтр");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаПогашенияДЗ1М");
	ТЗДляСтруктуры.Колонки.Добавить("ДатаПогашенияДЗ1МСтр");
	
	ТЗДляСтруктуры.Колонки.Добавить("Колонка01", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка11", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка12", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка13", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка14", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка15", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка17", Новый ОписаниеТипов("Булево"));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка22", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка23", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка24", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка25", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТЗДляСтруктуры.Колонки.Добавить("Колонка26", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	СуммаДолгаПоДоговору = ДанныеОДокПросроч.КонПериодаТекМ;
	СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
	МассивСчетов = Новый Массив();
	МассивСчетов.Добавить(Счет);
	Если ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Если Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          						// КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
			СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
			СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
		ИначеЕсли Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
			МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
			СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
			СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
		КонецЕсли; 
	КонецЕсли;
	//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаЗадолженность.Контрагент, ВыборкаЗадолженность.Договор, МассивСчетов);
	СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, Счет);
	СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	
	Если Не СписокСтрокПоТекущейЗадолженности.Количество() Тогда
		СтруктураСтроки.Вставить("ЗаЧто", 			ЗаЧто);	//?(ЗначениеЗаполнено(Договор) и (ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") или ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")), Договор.СтатьяДвиженияДенежныхСредств, ЗаЧто));
		СтруктураСтроки.Вставить("ТЗДляСтруктуры", ТЗДляСтруктуры);
		СтруктураСтроки.Вставить("СуммаРезерва", СуммаРезерва);
		СтруктураСтроки.Вставить("ИсполняющееПодразделение", ?(ЗначениеЗаполнено(Договор), Договор.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));    //  ИсполняющееПодразделение
		СтруктураСтроки.Вставить("Контрагент", Контрагент);
		СтруктураСтроки.Вставить("Договор", Договор);
		Возврат(СтруктураСтроки);
	КонецЕсли;
	
	Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
		Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
			Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
				СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СписокОбъектовРасчета = Новый СписокЗначений();
	Для Каждого ЭлМассива Из СписокСтрокПоТекущейЗадолженности Цикл
		Если Не СписокОбъектовРасчета.НайтиПоЗначению(ЭлМассива.ОбъектРасчетов) = Неопределено Тогда Продолжить; КонецЕсли;
		СписокОбъектовРасчета.Добавить(ЭлМассива.ОбъектРасчетов);
	КонецЦикла;
	СписокОбъектовРасчета.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	КоличествоОбъектовРасчета = СписокОбъектовРасчета.Количество();
	МассивОбъектовРасчетаСоСтроками = Новый Массив(КоличествоОбъектовРасчета, 1);
	Для Каждого ЭлСписка Из СписокОбъектовРасчета Цикл	  
		ОбъектРасчетов = ЭлСписка.Значение;
		Если КоличествоОбъектовРасчета > 1 Тогда
			СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
			МассивСчетов = Новый Массив();
			МассивСчетов.Добавить(Счет);
			Если ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
					и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
					МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
					СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным, ОбъектРасчетов);
					СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
				ИначеЕсли Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
					и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
					МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
					СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным, ОбъектРасчетов);
					СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
				КонецЕсли; 
			КонецЕсли;
			//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаЗадолженность.Контрагент, ВыборкаЗадолженность.Договор, МассивСчетов);
			СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, Счет, ОбъектРасчетов);
			СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
				Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
					Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
						СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Масс = Новый Массив(1,2);
			Масс[0][0] = ОбъектРасчетов;
			Масс[0][1] = СписокСтрокПоТекущейЗадолженности;
		    МассивОбъектовРасчетаСоСтроками.Вставить(СписокОбъектовРасчета.Индекс(ЭлСписка), Масс);
			
			СуммаДолгаПоДоговору = ПолучитьОстаток(Счет, Контрагент, Договор, ОбъектРасчетов, ВыборкаОстатков, ДтКт);
			Если СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
		Иначе
			Масс = Новый Массив(1,2);
			Масс[0][0] = ОбъектРасчетов;
			Масс[0][1] = СписокСтрокПоТекущейЗадолженности;
		    МассивОбъектовРасчетаСоСтроками.Вставить(СписокОбъектовРасчета.Индекс(ЭлСписка), Масс);
		КонецЕсли;	
		
		ТаблицаДокументовДолга = ПолучитьТаблицуДокументовДолга(СписокСтрокПоТекущейЗадолженности, СуммаДолгаПоДоговору, ДтКт);
		
		ТекущийОбъектРасчетов = Неопределено;
		Для каждого ВыборкаДетальныеЗаписи из ТаблицаДокументовДолга цикл
			
			Если ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
			 
			СтруктПолуч = ПолучитьСтруктуруДанныхДокумента(ВыборкаДетальныеЗаписи, ОбъектРасчетов, ТекущийОбъектРасчетов, Договор, КонПериода);
			
			//Если Не (СтруктПолуч.ДатаПогашенияДЗ > Дата(1,1,1) и Не СтруктПолуч.ДатаПогашенияДЗ > КонПериода) Тогда
			Если СтруктПолуч = Неопределено Тогда Продолжить; КонецЕсли;
			
			НовСтрока = ТЗДляСтруктуры.Добавить();
			//НовСтрока.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
			ЗаполнитьЗначенияСвойств(НовСтрока, СтруктПолуч);
			
			НовСтрока.Колонка17 = Истина;
			НовСтрока.Колонка22 = 0;
			НовСтрока.Колонка23 = 0;
			НовСтрока.Колонка24 = 0;
			НовСтрока.Колонка25 = 0; 
			НовСтрока.Колонка26 = 0;
			КолДней = (КонПериода - НовСтрока.ДатаДок) / (60 * 60 * 24);   // fix Suetin 23.10.2017 16:14:54  ТЗДляСтруктуры[КоличествоСтрок - 1].ДатаДок   ДатаПогашенияДЗ
			
			Если КолДней > 1095 Тогда
				НовСтрока.Колонка26 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней > 180 Тогда
				НовСтрока.Колонка25 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;	
			ИначеЕсли КолДней > 90 Тогда
				НовСтрока.Колонка24 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней > 30 Тогда
				НовСтрока.Колонка23 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней >= 0 Тогда
				НовСтрока.Колонка22 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			КонецЕсли;
			ТекущийОбъектРасчетов = ОбъектРасчетов;
		КонецЦикла;
	КонецЦикла;	
	
	КоличествоТЗДляСтруктуры = ТЗДляСтруктуры.Количество();
	
	СуммаДолгаПоДоговору = ДанныеОДокПросроч.КонПериода1М;
	КонПериода1 = НачалоМесяца(КонПериода) - 1;			/////////////////////////////////////////////
	//////////////СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
	//////////////МассивСчетов = Новый Массив();
	//////////////МассивСчетов.Добавить(Счет);
	//////////////Если ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
	//////////////	Если Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          						// КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
	//////////////		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
	//////////////		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//////////////		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//////////////		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//////////////	ИначеЕсли Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
	//////////////		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
	//////////////		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	//////////////		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	//////////////		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//////////////	КонецЕсли; 
	//////////////КонецЕсли;
	//////////////СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, Счет);
	//////////////СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//////////////Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
	//////////////	Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
	//////////////		Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
	//////////////			СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
	//////////////		КонецЕсли;
	//////////////	КонецЦикла;
	//////////////КонецЕсли;
	//////////////	
	//////////////СписокОбъектовРасчета = Новый СписокЗначений();
	//////////////Для Каждого ЭлМассива Из СписокСтрокПоТекущейЗадолженности Цикл
	//////////////	Если Не СписокОбъектовРасчета.НайтиПоЗначению(ЭлМассива.ОбъектРасчетов) = Неопределено Тогда Продолжить; КонецЕсли;
	//////////////	СписокОбъектовРасчета.Добавить(ЭлМассива.ОбъектРасчетов);
	//////////////КонецЦикла;
	//////////////СписокОбъектовРасчета.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	//////////////
	Инд = 0;
	//////////////КоличествоОбъектовРасчета = СписокОбъектовРасчета.Количество();
	Для Каждого ЭлСписка Из СписокОбъектовРасчета Цикл	  
		ОбъектРасчетов = ЭлСписка.Значение;
		Если КоличествоОбъектовРасчета > 1 Тогда
			//СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
			//МассивСчетов = Новый Массив();
			//МассивСчетов.Добавить(Счет);
			//Если ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			//	Если Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			//		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
			//		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
			//		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным, ОбъектРасчетов);
			//		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			//	ИначеЕсли Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			//		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
			//		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
			//		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным, ОбъектРасчетов);
			//		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			//	КонецЕсли; 
			//КонецЕсли;
			////СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаЗадолженность.Контрагент, ВыборкаЗадолженность.Договор, МассивСчетов);
			//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, Счет, ОбъектРасчетов);
			//СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			//Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
			//	Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
			//		Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
			//			СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			СуммаДолгаПоДоговору = ПолучитьОстаток(Счет, Контрагент, Договор, ОбъектРасчетов, ВыборкаОстатков, ДтКт, "1М");
			Если СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
		КонецЕсли;	
		Масс = МассивОбъектовРасчетаСоСтроками.Получить(СписокОбъектовРасчета.Индекс(ЭлСписка));
		СписокСтрокПоТекущейЗадолженности = Масс[0][1];
		КолС = СписокСтрокПоТекущейЗадолженности.Количество() - 1;
		Для НомС = 0 По КолС Цикл
			Если Не КонПериода1 < СписокСтрокПоТекущейЗадолженности[КолС - НомС].Период Тогда Прервать; КонецЕсли;
			СписокСтрокПоТекущейЗадолженности.Удалить(КолС - НомС);
		КонецЦикла;	
		ТаблицаДокументовДолга = ПолучитьТаблицуДокументовДолга(СписокСтрокПоТекущейЗадолженности, СуммаДолгаПоДоговору, ДтКт);
	
		ТекущийОбъектРасчетов = Неопределено;
		Для каждого ВыборкаДетальныеЗаписи из ТаблицаДокументовДолга Цикл
			
			Если ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
			 
			СтруктПолуч = ПолучитьСтруктуруДанныхДокумента(ВыборкаДетальныеЗаписи, ОбъектРасчетов, ТекущийОбъектРасчетов, Договор, КонПериода1);
			
			//Если Не (СтруктПолуч.ДатаПогашенияДЗ > Дата(1,1,1) и Не СтруктПолуч.ДатаПогашенияДЗ > КонПериода1) Тогда
			Если СтруктПолуч = Неопределено Тогда Продолжить; КонецЕсли;
			
			//Если КоличествоТЗДляСтруктуры <= ТаблицаДокументовДолга.Индекс(ВыборкаДетальныеЗаписи) - Инд Тогда
			Если КоличествоТЗДляСтруктуры <= Инд Тогда
				НовСтрока = ТЗДляСтруктуры.Добавить();
				КоличествоТЗДляСтруктуры = ТЗДляСтруктуры.Количество();
			Иначе
			    //НовСтрока = ТЗДляСтруктуры[ТаблицаДокументовДолга.Индекс(ВыборкаДетальныеЗаписи) - Инд]
				НовСтрока = ТЗДляСтруктуры[Инд]
			КонецЕсли; 
			
			НовСтрока.ДатаДок1М 					= СтруктПолуч.ДатаДок;
			НовСтрока.НомерДок1М 					= СтруктПолуч.НомерДок;
			НовСтрока.Регистратор1М 				= СтруктПолуч.Регистратор;
			НовСтрока.РегистраторПредставление1М 	= СтруктПолуч.РегистраторПредставление;
			НовСтрока.ЗаЧто1М 						= СтруктПолуч.ЗаЧто;
			НовСтрока.Колонка17 					= Истина;
			НовСтрока.ДатаПогашенияДЗ1М 			= СтруктПолуч.ДатаПогашенияДЗ; 
			НовСтрока.ДатаПогашенияДЗ1МСтр 			= СтруктПолуч.ДатаПогашенияДЗСтр;
			НовСтрока.Колонка11 					= 0;
			НовСтрока.Колонка12 					= 0;
			НовСтрока.Колонка13 					= 0;
			НовСтрока.Колонка14 					= 0; 
			НовСтрока.Колонка15 					= 0;
			КолДней = (КонПериода1 - СтруктПолуч.ДатаДок) / (60 * 60 * 24);   // fix Suetin 23.10.2017 16:14:54  ТЗДляСтруктуры[КоличествоСтрок - 1].ДатаДок   ДатаПогашенияДЗ
			
			Если КолДней > 1095 Тогда
				НовСтрока.Колонка15 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней > 180 Тогда
				НовСтрока.Колонка14 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;	
			ИначеЕсли КолДней > 90 Тогда
				НовСтрока.Колонка13 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней > 30 Тогда
				НовСтрока.Колонка12 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			ИначеЕсли КолДней >= 0 Тогда
				НовСтрока.Колонка11 = ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			КонецЕсли; 
			ТекущийОбъектРасчетов = ОбъектРасчетов;
			Инд = Инд + 1;
		КонецЦикла;
	КонецЦикла;
	
	КоличествоТЗДляСтруктуры = ТЗДляСтруктуры.Количество();
	
	СуммаДолгаПоДоговору = ДанныеОДокПросроч.КонПериода2М;
	КонПериода2 = НачалоМесяца(КонПериода1) - 1;
	//СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
	//МассивСчетов = Новый Массив();
	//МассивСчетов.Добавить(Счет);
	//Если ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
	//	Если Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          						// КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
	//		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
	//		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//	ИначеЕсли Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
	//		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
	//		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	//		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	//		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//	КонецЕсли; 
	//КонецЕсли;
	//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", Контрагент, Договор, Счет);
	//СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
	//Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
	//	Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
	//		Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
	//			СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//	
	//СписокОбъектовРасчета = Новый СписокЗначений();
	//Для Каждого ЭлМассива Из СписокСтрокПоТекущейЗадолженности Цикл
	//	Если Не СписокОбъектовРасчета.НайтиПоЗначению(ЭлМассива.ОбъектРасчетов) = Неопределено Тогда Прервать; КонецЕсли;   // fix Suetin 10.07.2019 14:03:24   Продолжить
	//	СписокОбъектовРасчета.Добавить(ЭлМассива.ОбъектРасчетов);
	//КонецЦикла;
	//СписокОбъектовРасчета.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	КоличествоОбъектовРасчета = СписокОбъектовРасчета.Количество();
	Для Каждого ЭлСписка Из СписокОбъектовРасчета Цикл	  
		ОбъектРасчетов = ЭлСписка.Значение;
		Если КоличествоОбъектовРасчета > 1 Тогда
			//СписокСтрокПоТекущейЗадолженности1 = Новый Массив();
			//МассивСчетов = Новый Массив();
			//МассивСчетов.Добавить(Счет);
			//Если ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			//	Если Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			//		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
			//		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
			//		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным, ОбъектРасчетов);
			//		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			//	ИначеЕсли Договор.ВИЛС_УстановленСрокПоставкиПослеАванса          // КонтролироватьСрокПоставкиОтАванса - ВИЛС_УстановленСрокПоставкиПослеАванса
			//		и Счет = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками Тогда
			//		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
			//		СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным, ОбъектРасчетов);
			//		СписокСтрокПоТекущейЗадолженности1 = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			//	КонецЕсли; 
			//КонецЕсли;
			////СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет", ВыборкаЗадолженность.Контрагент, ВыборкаЗадолженность.Договор, МассивСчетов);
			//СтруктураПоиска = Новый Структура("Контрагент, Договор, Счет, ОбъектРасчетов", Контрагент, Договор, Счет, ОбъектРасчетов);
			//СписокСтрокПоТекущейЗадолженности = ВыборкаДокументов.НайтиСтроки(СтруктураПоиска);
			//Если СписокСтрокПоТекущейЗадолженности1.Количество() Тогда
			//	Для Каждого СтрокаТЗТЗ Из СписокСтрокПоТекущейЗадолженности1 Цикл
			//		Если СписокСтрокПоТекущейЗадолженности.Найти(СтрокаТЗТЗ) = Неопределено Тогда
			//			СписокСтрокПоТекущейЗадолженности.Добавить(СтрокаТЗТЗ);
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			////ВыборкаОстатков.Сбросить();
			СуммаДолгаПоДоговору = ПолучитьОстаток(Счет, Контрагент, Договор, ОбъектРасчетов, ВыборкаОстатков, ДтКт, "2М");
			Если СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
		КонецЕсли;	
	    Масс = МассивОбъектовРасчетаСоСтроками.Получить(СписокОбъектовРасчета.Индекс(ЭлСписка));
		СписокСтрокПоТекущейЗадолженности = Масс[0][1];
		
		КолС = СписокСтрокПоТекущейЗадолженности.Количество() - 1;
		Для НомС = 0 По КолС Цикл
			Если Не КонПериода2 < СписокСтрокПоТекущейЗадолженности[КолС - НомС].Период Тогда Прервать; КонецЕсли;   // Было КонПериода1         Продолжить
			СписокСтрокПоТекущейЗадолженности.Удалить(КолС - НомС);
		КонецЦикла;
		ТаблицаДокументовДолга = ПолучитьТаблицуДокументовДолга(СписокСтрокПоТекущейЗадолженности, СуммаДолгаПоДоговору, ДтКт);
	
		ТекущийОбъектРасчетов = Неопределено;
		Для каждого ВыборкаДетальныеЗаписи из ТаблицаДокументовДолга Цикл
			
			Если ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору = 0 Тогда Продолжить; КонецЕсли;
			 
			СтруктПолуч = ПолучитьСтруктуруДанныхДокумента(ВыборкаДетальныеЗаписи, ОбъектРасчетов, ТекущийОбъектРасчетов, Договор, КонПериода2);
			
			//Если Не (СтруктПолуч.ДатаПогашенияДЗ > Дата(1,1,1) и Не СтруктПолуч.ДатаПогашенияДЗ > КонПериода2) Тогда
			Если СтруктПолуч = Неопределено Тогда Продолжить; КонецЕсли;
			
			Если КоличествоТЗДляСтруктуры = 0 Тогда
				НовСтрока = ТЗДляСтруктуры.Добавить(); 
				КоличествоТЗДляСтруктуры = ТЗДляСтруктуры.Количество();
			Иначе
				НовСтрока = ТЗДляСтруктуры[0];
			КонецЕсли; 
			КолДней = (КонПериода2 - СтруктПолуч.ДатаДок) / (60 * 60 * 24);   // fix Suetin 23.10.2017 16:14:54  ТЗДляСтруктуры[КоличествоСтрок - 1].ДатаДок     ДатаПогашенияДЗ
			Если КолДней >= 0 Тогда
				НовСтрока.Колонка01 = НовСтрока.Колонка01 + ВыборкаДетальныеЗаписи.СуммаДолгаПоДоговору;
			КонецЕсли; 
			ТекущийОбъектРасчетов = ОбъектРасчетов;
		КонецЦикла;
	КонецЦикла;
	
	ТЗДляСтруктуры.Свернуть("ТипДокумента, ДатаДок, ДатаДок1М, НомерДок, НомерДок1М, ДатаДокСист, ЗаЧто1М, ОбъектРасчетов1М, ЗаЧто, ОбъектРасчетов, ПроверятьГалочку, Регистратор1М, РегистраторПредставление1М, Регистратор, РегистраторПредставление, ДатаПогашенияДЗ, ДатаПогашенияДЗСтр, ДатаПогашенияДЗ1М, ДатаПогашенияДЗ1МСтр, Колонка17", "Колонка01, Колонка11, Колонка12, Колонка13, Колонка14, Колонка15, Колонка22, Колонка23, Колонка24, Колонка25, Колонка26");
	ТЗДляСтруктуры.Сортировать("ОбъектРасчетов Возр, ДатаДок Убыв"); 
	
	СтруктураСтроки.Вставить("ЗаЧто", 			ЗаЧто);	//?(ЗначениеЗаполнено(Договор) и (ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") или ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")), Договор.СтатьяДвиженияДенежныхСредств, ЗаЧто));
	СтруктураСтроки.Вставить("ТЗДляСтруктуры", ТЗДляСтруктуры);
	СтруктураСтроки.Вставить("СуммаРезерва", СуммаРезерва);
	СтруктураСтроки.Вставить("ИсполняющееПодразделение", ?(ЗначениеЗаполнено(Договор), Договор.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));    //  ИсполняющееПодразделение
	СтруктураСтроки.Вставить("Контрагент", Контрагент);
	СтруктураСтроки.Вставить("Договор", Договор);
	
	Возврат СтруктураСтроки;
	
КонецФункции	//ПолучитьДанныеСтрокиДляПросроченной_2()	                    

Функция ПолучитьСтруктуруДанныхДокумента(ВыборкаДетальныеЗаписи, Знач ОбъектРасчетов, Знач ТекущийОбъектРасчетов, Знач Договор, Знач КонПериода, Знач Просроченная = Ложь)
	ЗаЧто = ?(ЗначениеЗаполнено(Договор) и (ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") или ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")), Договор.СтатьяДвиженияДенежныхСредств, "");
	НовСтрока = Новый Структура("ТипДокумента, ДатаДок, ДатаДокСист, НомерДок, ЗаЧто, ОбъектРасчетов, ПроверятьГалочку, ДатаПогашенияДЗ, ДатаПогашенияДЗСтр, Регистратор, РегистраторПредставление"); 
	ЗаполнитьСтрокуДаннымиДокумента(НовСтрока, ВыборкаДетальныеЗаписи, ОбъектРасчетов, ТекущийОбъектРасчетов, ЗаЧто);
	ПопадаетВПросрочку = ЗаполнитьСтрокуДаннымиДоговораВырнутьПопадаетВПросрочку(НовСтрока, Договор, КонПериода);
	Если ПопадаетВПросрочку Тогда
		Возврат(НовСтрока);
	Иначе
		Возврат(Неопределено);
	КонецЕсли;	
КонецФункции

Функция ЗаполнитьСтрокуДаннымиДоговораВырнутьПопадаетВПросрочку(НовСтрока, Знач Договор, Знач КонПериода = '00010101')
	НовСтрока.ДатаПогашенияДЗ = '00010101';
	Если НовСтрока.ДатаДок = "б/д" Тогда
	    НовСтрока.ДатаПогашенияДЗСтр = "б/д";
	ИначеЕсли ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			и Договор.ВИЛС_УстановленСрокПоставкиПослеАванса и НовСтрока.ПроверятьГалочку = "Деньги" Тогда
		Если ЗначениеЗаполнено(Договор.ВИЛС_СрокПоставкиПослеАванса)  Тогда
			НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + Договор.ВИЛС_СрокПоставкиПослеАванса * 60 * 60 * 24;
			НовСтрока.ДатаПогашенияДЗСтр = Формат(НовСтрока.ДатаПогашенияДЗ, "ДФ=dd.MM.yy");
		Иначе
			НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + 30 * 60 * 60 * 24;
			НовСтрока.ДатаПогашенияДЗСтр = "НЗП";
		КонецЕсли; 
		
	ИначеЕсли  ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			 и Договор.ВИЛС_УстановленСрокПоставкиПослеАванса и НовСтрока.ПроверятьГалочку = "Поставка" Тогда
		//Если ЗначениеЗаполнено(Договор.СрокПоставкиОтАванса)  Тогда
		//	НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + Договор.СрокПоставкиОтАванса * 60 * 60 * 24;
		//	НовСтрока.ДатаПогашенияДЗСтр = Формат(НовСтрока.ДатаПогашенияДЗ, "ДФ=dd.MM.yy");
		//Иначе
			НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + 1 * 60 * 60 * 24;
			НовСтрока.ДатаПогашенияДЗСтр = "НЗП";
		//КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Договор) и ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			 и Договор.УстановленСрокОплаты и НовСтрока.ПроверятьГалочку = "Поставка"  Тогда
		Если ЗначениеЗаполнено(Договор.СрокОплаты) Тогда
			НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + Договор.СрокОплаты * 60 * 60 * 24;
			НовСтрока.ДатаПогашенияДЗСтр = Формат(НовСтрока.ДатаПогашенияДЗ, "ДФ=dd.MM.yy");
		Иначе
			НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + 30 * 60 * 60 * 24;
			НовСтрока.ДатаПогашенияДЗСтр = "НЗП";
		КонецЕсли; 
	Иначе
		НовСтрока.ДатаПогашенияДЗ = НовСтрока.ДатаДок + 30 * 60 * 60 * 24; 
	    НовСтрока.ДатаПогашенияДЗСтр = "НЗП";
	КонецЕсли;
	
	ПопадаетВПросрочку = Ложь;
	Если НовСтрока.ДатаПогашенияДЗ > '00010101' и Не НовСтрока.ДатаПогашенияДЗ > КонПериода Тогда
		ПопадаетВПросрочку = Истина;		
	КонецЕсли;
	Возврат(ПопадаетВПросрочку);
	///////////////////////////////////////////////
	Если Не (НовСтрока.ДатаПогашенияДЗ > '00010101' и Не НовСтрока.ДатаПогашенияДЗ > КонПериода) Тогда
		НовСтрока = Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьТекстПросроченногоЗапроса(ДтКт)
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1	//0
	|	Инвентаризация.Дата КАК Дата,
	|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Организация КАК Организация,
	|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	|ПОМЕСТИТЬ Шапка
	|ИЗ 
	|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка
	|
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ //1
	|	Задолженность.Ссылка.Организация КАК Организация,
	|	Задолженность.ДебиторКредитор КАК Контрагент,
	|	Задолженность.ВИЛС_Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	|ПОМЕСТИТЬ Задолженность	
	|ИЗ 
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	|ГДЕ
	|	Задолженность.Ссылка = &Ссылка
	|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	|;	
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ //2
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Договор КАК Договор,
	|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги,
	|	Т.РасчетныйДокумент КАК РасчетныйДокумент,
	|   ВЫБОР 
	|   	КОГДА Т.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|   		ТОГДА ЕСТЬNULL(Т.РасчетныйДокумент.ДатаВходящегоДокумента, Т.РасчетныйДокумент.Дата)
	|   	ИНАЧЕ Т.Регистратор.Дата
	|   КОНЕЦ КАК Период
	|ПОМЕСТИТЬ РегистраторыСУслугами
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Регистратор,
	|		Т.Ссылка.Организация КАК Организация,
	|		Т.Ссылка.Контрагент КАК Контрагент,
	|		Т.Ссылка.Договор КАК Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьУслуги,
	|		Т.Ссылка КАК РасчетныйДокумент
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		Т.Ссылка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		Т.Ссылка
	|	ИЗ
	|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Контрагент,
	|		ВЫБОР КОГДА НЕ ЕСТЬNULL(Т.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА 
	|				Т.Договор
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) 	 
	|			ТОГДА
	|				ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов)
	|			ИНАЧЕ	
	|				Т.ДокументРасчетов.Договор
	|			КОНЕЦ,	
	|		ЛОЖЬ,
	|		Т.ДокументРасчетов
	|	ИЗ
	|		Документ.ВводОстатков.РасчетыСПартнерами КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	|	    ) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Договор,
	|	Т.РасчетныйДокумент,
	|   ВЫБОР 
	|   	КОГДА Т.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|   		ТОГДА ЕСТЬNULL(Т.РасчетныйДокумент.ДатаВходящегоДокумента, Т.РасчетныйДокумент.Дата)
	|   	ИНАЧЕ Т.Регистратор.Дата
	|   КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Контрагент,
	|	Договор
	|;
	|///////////////////////////////////////////////////////////////////////////////   
	|ВЫБРАТЬ	//3
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонПериода,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|			, (Организация, Субконто1, Субконто2) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	|															) КАК ХозрасчетныйОстатки
	|
	|;
	|///////////////////////////////////////////////////////////////////////////////   
	|ВЫБРАТЬ ИСТИНА	//4
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //5
	|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|	ХозрасчетныйОбороты.Договор КАК Договор,
	|	ХозрасчетныйОбороты.ЕстьУслуги,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	|   НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|   ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,          // fix Suetin 25.06.2019 12:52:58
	|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ КАК Контрагент,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ КАК Договор,
	|		ЕСТЬNULL(РегистраторыСУслугами.Период, ХозрасчетныйОбороты.Период) КАК Период,
	|		ХозрасчетныйОбороты.Счет КАК Счет,
    |	   	ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор, 
	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) 
	|		КОНЕЦ КАК СуммаОборот,		
	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) 
	|		КОНЕЦ КАК СуммаОборотДт,
	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) 
	|		КОНЕЦ КАК СуммаОборотКт,
	|		ВЫБОР
	|			КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент 
	|					И РегистраторыСУслугами.РасчетныйДокумент.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	|				ТОГДА ""Деньги""
	|			КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент 
	|					И РегистраторыСУслугами.РасчетныйДокумент.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	|				ТОГДА ""Деньги""
	// begin fix Suetin 07.10.2019 14:05:21
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|					И ХозрасчетныйОбороты.КорСчет В(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал))
	|				ТОГДА ""Деньги""
	// begin fix Suetin 13.12.2019 13:22:37
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	// end fix Suetin 13.12.2019 13:22:45
	|			ИНАЧЕ ""Поставка""
	|		КОНЕЦ КАК ПроверятьГалочку,
	|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	|		ВЫБОР         																														// begin fix Suetin 25.06.2019 12:51:31
	|			КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)	
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)	
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК СтатьяДДС_ГФУН  																											// end fix Suetin 25.06.2019 12:51:42
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&КонПериода,
	|				Регистратор,
	|				ВЫБОР 
	|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	|				    	ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|				    	ТОГДА ИСТИНА
	|                   ИНАЧЕ ЛОЖЬ КОНЕЦ,
	|					, (Организация, ВЫБОР
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|								ТОГДА Субконто1
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|								ТОГДА Субконто1
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА Субконто1
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|								ТОГДА Субконто2
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|								ТОГДА Субконто3
	|							ИНАЧЕ NULL
	|						КОНЕЦ, ВЫБОР
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА Субконто2
	|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА Субконто3
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность),
	|					,
	|					) КАК ХозрасчетныйОбороты
	|    ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами
	|    	ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	|			И ХозрасчетныйОбороты.Организация = РегистраторыСУслугами.Организация
	|			И ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|			КОНЕЦ = РегистраторыСУслугами.Контрагент
	|			И ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			КОНЕЦ = РегистраторыСУслугами.Договор 
	|			
	|											) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Контрагент,
	|	ХозрасчетныйОбороты.Договор,
	|	ХозрасчетныйОбороты.ЕстьУслуги,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.ПроверятьГалочку,
	|	ХозрасчетныйОбороты.СтатьяДДС_ГФУН               // fix Suetin 25.06.2019 12:50:58
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Период,
	|	Регистратор,
	|	ОбъектРасчетов,
	|	Счет,
	|	СтатьяДДС_ГФУН          // fix Suetin 25.06.2019 12:50:39   
	|	
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	Счет
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ //6
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Контрагент КАК Контрагент,
	|	Задолженность.Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	|ИЗ 
	|	Задолженность КАК Задолженность
	|УПОРЯДОЧИТЬ ПО
	|	СчетРасчетов
	|ИТОГИ
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ВИЛС_Подтверждено1Месяц),
	|	СУММА(ВИЛС_НеПодтверждено1Месяц),
	|	СУММА(ВИЛС_Подтверждено2Месяц),
	|	СУММА(ВИЛС_НеПодтверждено2Месяц)
	|ПО
	|	СчетРасчетов ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|///////////////////////////////////////////////////////////////////////////////   
	|ВЫБРАТЬ ИСТИНА	//7
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //8
    |	ХозрасчетныйОбороты.Контрагент 			КАК Контрагент,
    |	ХозрасчетныйОбороты.Договор 					КАК Договор,
	|	ХозрасчетныйОбороты.Счет 						КАК Счет,
    |	СУММА(ХозрасчетныйОбороты.КонПериода2МДт) 		КАК КонПериода2МДт,
    |	СУММА(ХозрасчетныйОбороты.КонПериода2МКт) 		КАК КонПериода2МКт,
    |	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МКт) 	КАК ОборотыПериода1МКт,
    |	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МДт) 	КАК ОборотыПериода1МДт,
    |	СУММА(ХозрасчетныйОбороты.КонПериода1МДт) 		КАК КонПериода1МДт,
    |	СУММА(ХозрасчетныйОбороты.КонПериода1МКт) 		КАК КонПериода1МКт,
    |	СУММА(ХозрасчетныйОбороты.ОборотыПериодаКт) 	КАК ОборотыПериодаКт,
    |	СУММА(ХозрасчетныйОбороты.ОборотыПериодаДт) 	КАК ОборотыПериодаДт,
    |	СУММА(ХозрасчетныйОбороты.КонПериодаДт) 		КАК КонПериодаДт,	        /////////////////////////////////////////////////////////  КонПериодаДт
    |	СУММА(ХозрасчетныйОбороты.КонПериодаКт) 		КАК КонПериодаКт,         /////////////////////////////////////////////////////////  КонПериодаКт
    |	ЗначенияСвойств.Значение 						КАК Мероприятие,
	|	ЗначенияСвойствСрокПогашенияЗадолженности.Значение КАК СрокПогашенияЗадолженности
    |ИЗ
	//|	(ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ КАК Контрагент,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ КАК Договор,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		СУММА(ХозрасчетныйОбороты.СуммаОстатокДт) КАК КонПериода2МДт,
	//|		СУММА(ХозрасчетныйОбороты.СуммаОстатокКт) КАК КонПериода2МКт,
	//|		СУММА(0) КАК ОборотыПериода1МКт,
	//|		СУММА(0) КАК ОборотыПериода1МДт,
	//|		СУММА(0) КАК КонПериода1МДт,
	//|		СУММА(0) КАК КонПериода1МКт,
	//|		СУММА(0) КАК ОборотыПериодаКт,
	//|		СУММА(0) КАК ОборотыПериодаДт,
	//|		СУММА(0) КАК КонПериодаДт,
	//|		СУММА(0) КАК КонПериодаКт
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода2М,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|					) КАК ХозрасчетныйОбороты
	////|	ГДЕ
	////|		ИСТИНА = &КонПериода2МНеМеньше20181231235959
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОбороты.Счет,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//
	////|	ВЫБРАТЬ
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ КАК ДебиторКредитор,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ КАК ВИЛС_Договор,
	////|		ХозрасчетныйОбороты.Счет КАК Счет,
	////|		СУММА(ХозрасчетныйОбороты.СуммаОстатокДт) КАК КонПериода2МДт,
	////|		СУММА(ХозрасчетныйОбороты.СуммаОстатокКт) КАК КонПериода2МКт,
	////|		СУММА(0) КАК ОборотыПериода1МКт,
	////|		СУММА(0) КАК ОборотыПериода1МДт,
	////|		СУММА(0) КАК КонПериода1МДт,
	////|		СУММА(0) КАК КонПериода1МКт,
	////|		СУММА(0) КАК ОборотыПериодаКт,
	////|		СУММА(0) КАК ОборотыПериодаДт,
	////|		СУММА(0) КАК КонПериодаДт,
	////|		СУММА(0) КАК КонПериодаКт
	////|	ИЗ
	////|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	////|				&КонПериода2018,
	////|				ВЫБОР
	////|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	////|						ТОГДА ИСТИНА
	////|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	////|						ТОГДА ИСТИНА
	////|					ИНАЧЕ ЛОЖЬ
	////|				КОНЕЦ,
	////|					, (Организация, ВЫБОР
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|								ТОГДА Субконто1
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|								ТОГДА Субконто1
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|								ТОГДА Субконто1
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|								ТОГДА Субконто2
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|								ТОГДА Субконто3
	////|							ИНАЧЕ NULL
	////|						КОНЕЦ, ВЫБОР
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|								ТОГДА Субконто2
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|								ТОГДА Субконто3
	////|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, ДоговорКонтрагента ИЗ Задолженность)
	////|					) КАК ХозрасчетныйОбороты
	////|	ГДЕ
	////|		ЛОЖЬ = &КонПериода2МНеМеньше20181231235959
	////|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	////|	
	////|	ОБЪЕДИНИТЬ ВСЕ
	////|	
	//
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОстатокДт),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОстатокКт),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода1М,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|					) КАК ХозрасчетныйОбороты
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОбороты.Счет,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОборотКт),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОборотДт),
	//|		СУММА(0),
	//|		СУММА(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачПериода,
	//|				&КонПериода,
	//|				Регистратор,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|	ГДЕ
	//|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	//|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	//|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	//|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОбороты.Счет,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОстатокДт),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОстатокКт)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|					) КАК ХозрасчетныйОбороты
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОбороты.Счет,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОборотКт),
	//|		СУММА(ХозрасчетныйОбороты.СуммаОборотДт),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0),
	//|		СУММА(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачПериода1М,
	//|				&КонПериода1М,
	//|				Регистратор,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|	ГДЕ
	//|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	//|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	//|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	//|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОбороты.Счет,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ КАК Контрагент,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ КАК Договор,
	|		ХозрасчетныйОбороты.Счет КАК Счет,
	|		ХозрасчетныйОбороты.СуммаОстатокДт КАК КонПериода2МДт,
	|		ХозрасчетныйОбороты.СуммаОстатокКт КАК КонПериода2МКт,
	|		0 КАК ОборотыПериода1МКт,
	|		0 КАК ОборотыПериода1МДт,
	|		0 КАК КонПериода1МДт,
	|		0 КАК КонПериода1МКт,
	|		0 КАК ОборотыПериодаКт,
	|		0 КАК ОборотыПериодаДт,
	|		0 КАК КонПериодаДт,
	|		0 КАК КонПериодаКт
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонПериода2М,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК ХозрасчетныйОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОборотКт,
	|		ХозрасчетныйОбороты.СуммаОборотДт,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&НачПериода1М,
	|				&КонПериода1М,
	|				Регистратор,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|	ГДЕ
	|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОстатокДт,
	|		ХозрасчетныйОбороты.СуммаОстатокКт,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонПериода1М,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК ХозрасчетныйОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОборотКт,
	|		ХозрасчетныйОбороты.СуммаОборотДт,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&НачПериода,
	|				&КонПериода,
	|				Регистратор,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|	ГДЕ
	|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОстатокДт,
	|		ХозрасчетныйОбороты.СуммаОстатокКт
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонПериода,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК ХозрасчетныйОбороты) КАК ХозрасчетныйОбороты
    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойств
    |		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойств.Ссылка
    |			И (ЗначенияСвойств.Свойство = &СвойствоМероприятие)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойствСрокПогашенияЗадолженности
    |		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойствСрокПогашенияЗадолженности.Ссылка
    |			И (ЗначенияСвойствСрокПогашенияЗадолженности.Свойство = &СвойствоСрокПогашенияЗадолженности)
    |
    |СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Счет,
    |	ХозрасчетныйОбороты.Контрагент,
    |	ХозрасчетныйОбороты.Договор,
    |	ЗначенияСвойств.Значение,
	|  	ЗначенияСвойствСрокПогашенияЗадолженности.Значение
	|;
	|";
	
	Возврат(ТекстЗапроса);
КонецФункции

Функция ПолучитьТекстПросроченногоЗапросаСЗаказами(ДтКт)
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1	//0
	|	Инвентаризация.Дата КАК Дата,
	|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Организация КАК Организация,
	|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	//1
	|	Задолженность.Ссылка.Организация КАК Организация,
	|	Задолженность.ДебиторКредитор КАК Контрагент,
	|	Задолженность.ВИЛС_Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	|ПОМЕСТИТЬ Задолженность
	|ИЗ
	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	|ГДЕ
	|	Задолженность.Ссылка = &Ссылка
	|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	//2
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Договор КАК Договор,
	|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги
	|ПОМЕСТИТЬ РегистраторыСУслугами
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Регистратор,
	|		Т.Ссылка.Организация КАК Организация,
	|		Т.Ссылка.Контрагент КАК Контрагент,
	|		Т.Ссылка.Договор КАК Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьУслуги
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент
	|				ИЗ
	|					Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент
	|				ИЗ
	|					Задолженность)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.Организация,
	|		Т.Ссылка.Контрагент,
	|		Т.Ссылка.Договор,
	|		ВЫБОР
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|				ТОГДА ИСТИНА
	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	|	ГДЕ
	|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент
	|				ИЗ
	|					Задолженность)) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	//3
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонПериода,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|			,
	|			(Организация, Субконто1, Субконто2) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ	//4
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	|	КОНЕЦ КАК Период,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL) КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ КАК РасчетныйДокумент,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОборотДт,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОборотКт,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ КАК Счет
	|ПОМЕСТИТЬ РасчетыПоСрокам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|ГДЕ
	|	(РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	|			(ВЫБРАТЬ
	|				Задолженность.Организация,
	|				Задолженность.Контрагент,
	|				Задолженность.Договор
	|			ИЗ
	|				Задолженность)
	|	И ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	|	КОНЕЦ,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL),
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL),
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	(РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	|			(ВЫБРАТЬ
	|				Задолженность.Организация,
	|				Задолженность.Контрагент,
	|				Задолженность.Договор
	|			ИЗ
	|				Задолженность)
	|	И ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|				ТОГДА ИСТИНА
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА NULL
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|				ТОГДА NULL
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|		КОНЕЦ, NULL),
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Контрагент,
	|	Договор,
	|	Счет,
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ	//5
	|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|	ХозрасчетныйОбороты.Договор КАК Договор,
	|	ХозрасчетныйОбороты.ЕстьУслуги КАК ЕстьУслуги,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|		ХозрасчетныйОбороты.Договор КАК Договор,
	|		ХозрасчетныйОбороты.Период КАК Период,
	|		ХозрасчетныйОбороты.Счет КАК Счет,
	|		ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|		ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) КАК СуммаОборот,
	|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК СуммаОборотКт,
	|		ВЫБОР
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	|				ТОГДА ""Деньги""
	// begin fix Suetin 07.10.2019 14:05:21
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|					И ХозрасчетныйОбороты.КорСчет В(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал))
	|				ТОГДА ""Деньги""
	// end fix Suetin 07.10.2019 14:05:24
	// begin fix Suetin 13.12.2019 13:22:37
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|				ТОГДА ""Деньги""
	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|				ТОГДА ""Деньги""
	// end fix Suetin 13.12.2019 13:22:45
	|			ИНАЧЕ ""Поставка""
	|		КОНЕЦ КАК ПроверятьГалочку,
	|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	|		ХозрасчетныйОбороты.СтатьяДДС_ГФУН КАК СтатьяДДС_ГФУН
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто1
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|			КОНЕЦ КАК Контрагент,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто2
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ХозрасчетныйОбороты.Субконто3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			КОНЕЦ КАК Договор,
	|			ЕСТЬNULL(РасчетыПоСрокам.Период, ХозрасчетныйОбороты.Период) КАК Период,
	|			ХозрасчетныйОбороты.Счет КАК Счет,
	|			ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	|			ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор,
	|			РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|			ВЫБОР
	|				КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	|				ИНАЧЕ NULL
	|			КОНЕЦ КАК СтатьяДДС_ГФУН,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
	|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0)
	|			КОНЕЦ КАК СуммаОборот,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	|			КОНЕЦ КАК СуммаОборотДт,
	|			ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
	|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	|			КОНЕЦ КАК СуммаОборотКт
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.Обороты(
	|					,
	|					&КонПериода,
	|					Регистратор,
	|					ВЫБОР
	|						КОГДА Счет В
	|								(ВЫБРАТЬ
	|									Задолженность.СчетРасчетов
	|								ИЗ
	|									Задолженность)
	|							ТОГДА ИСТИНА
	|						КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ,
	|					,
	|					(Организация, ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|							ТОГДА Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|							ТОГДА Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА Субконто3
	|						ИНАЧЕ NULL
	|					КОНЕЦ, ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА Субконто3
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					КОНЕЦ) В
	|						(ВЫБРАТЬ
	|							Задолженность.Организация,
	|							Задолженность.Контрагент,
	|							Задолженность.Договор
	|						ИЗ
	|							Задолженность),
	|					,
	|					) КАК ХозрасчетныйОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокам КАК РасчетыПоСрокам
	|				ПО ХозрасчетныйОбороты.Регистратор = РасчетыПоСрокам.Регистратор
	|					И ХозрасчетныйОбороты.Организация = РасчетыПоСрокам.Организация
	|					И ХозрасчетныйОбороты.Счет = РасчетыПоСрокам.Счет
	|					И (ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто1
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто3
	|						ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|					КОНЕЦ = РасчетыПоСрокам.Контрагент)
	|					И (ВЫБОР
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто2
	|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|							ТОГДА ХозрасчетныйОбороты.Субконто3
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					КОНЕЦ = РасчетыПоСрокам.Договор)) КАК ХозрасчетныйОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами КАК РегистраторыСУслугами
	|			ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	|				И ХозрасчетныйОбороты.Контрагент = РегистраторыСУслугами.Контрагент
	|				И ХозрасчетныйОбороты.Договор = РегистраторыСУслугами.Договор) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Контрагент,
	|	ХозрасчетныйОбороты.Договор,
	|	ХозрасчетныйОбороты.ОбъектРасчетов,
	|	ХозрасчетныйОбороты.ЕстьУслуги,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.ПроверятьГалочку,
	|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Период,
	|	Регистратор,
	|	ОбъектРасчетов,
	|	Счет,
	|	СтатьяДДС_ГФУН
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	//6
	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	|	Задолженность.Контрагент КАК Контрагент,
	|	Задолженность.Договор КАК Договор,
	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	|	Задолженность.Подтверждено КАК Подтверждено,
	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	|ИЗ
	|	Задолженность КАК Задолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетРасчетов
	|ИТОГИ
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ВИЛС_Подтверждено1Месяц),
	|	СУММА(ВИЛС_НеПодтверждено1Месяц),
	|	СУММА(ВИЛС_Подтверждено2Месяц),
	|	СУММА(ВИЛС_НеПодтверждено2Месяц)
	|ПО
	|	СчетРасчетов ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ	//7
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ КАК Счет,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокДт,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаОстатокКт,
	|	СУММА(0) КАК СуммаОстатокДт1М,
	|	СУММА(0) КАК СуммаОстатокКт1М,
	|	СУММА(0) КАК СуммаОстатокДт2М,
	|	СУММА(0) КАК СуммаОстатокКт2М
	|ПОМЕСТИТЬ ОстаткиПоОбъектамРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&КонПериода,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК РасчетыСКлиентамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&КонПериода,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК РасчетыСПоставщикамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&КонПериода1М,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК РасчетыСКлиентамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&КонПериода1М,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК РасчетыСПоставщикамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0)
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&КонПериода2М,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК РасчетыСКлиентамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0)
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&КонПериода2М,
	|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	|				(ВЫБРАТЬ
	|					Задолженность.Организация,
	|					Задолженность.Контрагент,
	|					Задолженность.Договор
	|				ИЗ
	|					Задолженность)) КАК РасчетыСПоставщикамиПоСрокам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА NULL
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	|			ТОГДА NULL
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ	//8
	|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	|	ХозрасчетныйОбороты.Договор КАК Договор,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	СУММА(ХозрасчетныйОбороты.КонПериода2МДт) КАК КонПериода2МДт,
	|	СУММА(ХозрасчетныйОбороты.КонПериода2МКт) КАК КонПериода2МКт,
	|	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МКт) КАК ОборотыПериода1МКт,
	|	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МДт) КАК ОборотыПериода1МДт,
	|	СУММА(ХозрасчетныйОбороты.КонПериода1МДт) КАК КонПериода1МДт,
	|	СУММА(ХозрасчетныйОбороты.КонПериода1МКт) КАК КонПериода1МКт,
	|	СУММА(ХозрасчетныйОбороты.ОборотыПериодаКт) КАК ОборотыПериодаКт,
	|	СУММА(ХозрасчетныйОбороты.ОборотыПериодаДт) КАК ОборотыПериодаДт,
	|	СУММА(ХозрасчетныйОбороты.КонПериодаДт) КАК КонПериодаДт,
	|	СУММА(ХозрасчетныйОбороты.КонПериодаКт) КАК КонПериодаКт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт) КАК СуммаОстатокДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт) КАК СуммаОстатокКт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт1М) КАК СуммаОстатокДт1М,
	|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт1М) КАК СуммаОстатокКт1М,
	|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт2М) КАК СуммаОстатокДт2М,
	|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт2М) КАК СуммаОстатокКт2М,
	|	ЗначенияСвойств.Значение КАК Мероприятие,
	|	ЗначенияСвойствСрокПогашенияЗадолженности.Значение КАК СрокПогашенияЗадолженности
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ КАК Контрагент,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ КАК Договор,
	|		ХозрасчетныйОбороты.Счет КАК Счет,
	|		NULL КАК ОбъектРасчетов,
	|		ХозрасчетныйОбороты.СуммаОстатокДт КАК КонПериода2МДт,
	|		ХозрасчетныйОбороты.СуммаОстатокКт КАК КонПериода2МКт,
	|		0 КАК ОборотыПериода1МКт,
	|		0 КАК ОборотыПериода1МДт,
	|		0 КАК КонПериода1МДт,
	|		0 КАК КонПериода1МКт,
	|		0 КАК ОборотыПериодаКт,
	|		0 КАК ОборотыПериодаДт,
	|		0 КАК КонПериодаДт,
	|		0 КАК КонПериодаКт,
	|		0 КАК СуммаОстатокДт,
	|		0 КАК СуммаОстатокКт,
	|		0 КАК СуммаОстатокДт1М,
	|		0 КАК СуммаОстатокКт1М,
	|		0 КАК СуммаОстатокДт2М,
	|		0 КАК СуммаОстатокКт2М
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонПериода2М,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК ХозрасчетныйОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		NULL,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОборотКт,
	|		ХозрасчетныйОбороты.СуммаОборотДт,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&НачПериода1М,
	|				&КонПериода1М,
	|				Регистратор,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|	ГДЕ
	|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОстатокДт,
	|		ХозрасчетныйОбороты.СуммаОстатокКт,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонПериода1М,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК ХозрасчетныйОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОборотКт,
	|		ХозрасчетныйОбороты.СуммаОборотДт,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&НачПериода,
	|				&КонПериода,
	|				Регистратор,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|	ГДЕ
	|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто1
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто2
	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ХозрасчетныйОбороты.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.Счет,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОстатокДт,
	|		ХозрасчетныйОбороты.СуммаОстатокКт,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонПериода,
	|				ВЫБОР
	|					КОГДА Счет В
	|							(ВЫБРАТЬ
	|								Задолженность.СчетРасчетов
	|							ИЗ
	|								Задолженность)
	|						ТОГДА ИСТИНА
	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|				,
	|				(Организация, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто1
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ NULL
	|				КОНЕЦ, ВЫБОР
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто2
	|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				КОНЕЦ) В
	|					(ВЫБРАТЬ
	|						Задолженность.Организация,
	|						Задолженность.Контрагент,
	|						Задолженность.Договор
	|					ИЗ
	|						Задолженность)) КАК ХозрасчетныйОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиПоОбъектамРасчетов.Контрагент,
	|		ОстаткиПоОбъектамРасчетов.Договор,
	|		ОстаткиПоОбъектамРасчетов.Счет,
	|		ЕСТЬNULL(ОстаткиПоОбъектамРасчетов.ОбъектРасчетов, NULL),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт,
	|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт,
	|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт1М,
	|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт1М,
	|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт2М,
	|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт2М
	|	ИЗ
	|		ОстаткиПоОбъектамРасчетов КАК ОстаткиПоОбъектамРасчетов) КАК ХозрасчетныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойств
	|		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойств.Ссылка
	|			И (ЗначенияСвойств.Свойство = &СвойствоМероприятие)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойствСрокПогашенияЗадолженности
	|		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойствСрокПогашенияЗадолженности.Ссылка
	|			И (ЗначенияСвойствСрокПогашенияЗадолженности.Свойство = &СвойствоСрокПогашенияЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Контрагент,
	|	ХозрасчетныйОбороты.Договор,
	|	ХозрасчетныйОбороты.ОбъектРасчетов,
	|	ЗначенияСвойств.Значение,
	|	ЗначенияСвойствСрокПогашенияЗадолженности.Значение
	|";
	Возврат(ТекстЗапроса);
КонецФункции

Функция ПолучитьТаблицуДокументовДолга(Знач СписокСтрокПоТекущейЗадолженности, Знач СуммаДолгаПоДоговору, Знач ДтКт)
	СальдоТекущееФ = 0;                                                     
	СуммаДолгаПоДоговору = ?(ЗначениеЗаполнено(СуммаДолгаПоДоговору), СуммаДолгаПоДоговору, 0);
	ТаблицаСФлагами = Новый ТаблицаЗначений();//Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Колонки = ТаблицаСФлагами.Колонки;
	Колонки.Добавить("Договор"			, Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Колонки.Добавить("Контрагент"		, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Колонки.Добавить("ЕстьУслуги"		, Новый ОписаниеТипов("Булево"));
	Колонки.Добавить("Период"			, Новый ОписаниеТипов("Дата"));
	Колонки.Добавить("ПроверятьГалочку"	, Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("Регистратор");
	Колонки.Добавить("СуммаОборот"		, Новый ОписаниеТипов("Число"));   
	Колонки.Добавить("СуммаОборотДт"	, Новый ОписаниеТипов("Число"));      
	Колонки.Добавить("СуммаОборотКт"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("Счет"				, Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Колонки.Добавить("СтатьяДДС_ГФУН");      // fix Suetin 25.06.2019 13:02:07
	
	Для каждого СтрокаТЗИ Из СписокСтрокПоТекущейЗадолженности Цикл
		СтрокаТЗТЗ = ТаблицаСФлагами.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗТЗ, СтрокаТЗИ);
	КонецЦикла;	
	
	ПараметрыОтбора = Новый Структура("Регистратор", Null);
	ЛишниеСтроки = ТаблицаСФлагами.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ЛишняяСтрока Из ЛишниеСтроки Цикл
		ТаблицаСФлагами.Удалить(ЛишняяСтрока);
	КонецЦикла; 
	ТаблицаСФлагами.Сортировать("Период Возр");
	ТаблицаСФлагами.Колонки.Добавить("Флаг", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1)));
	ТаблицаСФлагами.Колонки.Добавить("СуммаДолгаПоДоговору", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	Для каждого СтрокаТЗФ Из ТаблицаСФлагами Цикл
		СальдоТекущееФ = СальдоТекущееФ + СтрокаТЗФ.СуммаОборотДт - СтрокаТЗФ.СуммаОборотКт;
		СтрокаТЗФ.Флаг   = ?(СальдоТекущееФ = 0, "", ?(СальдоТекущееФ < 0, "К", "Д"));
		СтрокаТЗФ.СуммаДолгаПоДоговору = ?(СальдоТекущееФ < 0, -СальдоТекущееФ, СальдоТекущееФ);
	КонецЦикла; 
	ТаблицаСФлагами.Сортировать("Период Убыв");
	ТаблицаДокументовДолга = Новый ТаблицаЗначений;
	ТаблицаДокументовДолга.Колонки.Добавить("Регистратор");//,          Новый ОписаниеТипов("ДокументСсылка"));
	ТаблицаДокументовДолга.Колонки.Добавить("ПроверятьГалочку",     Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ТаблицаДокументовДолга.Колонки.Добавить("СуммаДолгаПоДоговору", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДокументовДолга.Колонки.Добавить("ЕстьУслуги", 			Новый ОписаниеТипов("Булево"));
	ТаблицаДокументовДолга.Колонки.Добавить("СтатьяДДС_ГФУН");     // fix Suetin 25.06.2019 13:01:59
	ТипДокумента = "";
	ДатаДок = "";
	НомерДок = "";
	БылиНайденыСтрокиЗадолженности = Ложь;
	
	Для каждого СтрокаТЗФ Из ТаблицаСФлагами Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЗФ.Регистратор) Тогда Продолжить; КонецЕсли; 
		СуммаДляСписания = СтрокаТЗФ["СуммаОборот" + ДтКт] - ?(СтрокаТЗФ["СуммаОборот" + ?(ДтКт = "Дт", "Кт", "Дт")] < 0, СтрокаТЗФ["СуммаОборот" + ?(ДтКт = "Дт", "Кт", "Дт")], 0);
		Если Не СуммаДляСписания > 0 Тогда Продолжить; КонецЕсли;
		Если ДтКт = "Дт" и СтрокаТЗФ.Флаг = "Д" 
			или ДтКт = "Кт" и СтрокаТЗФ.Флаг = "К" Тогда
			Нстрока = ТаблицаДокументовДолга.Добавить();
			Нстрока.Регистратор 			= СтрокаТЗФ.Регистратор;
			Нстрока.ПроверятьГалочку 		= СтрокаТЗФ.ПроверятьГалочку;
			Нстрока.ЕстьУслуги 				= СтрокаТЗФ.ЕстьУслуги;
			Нстрока.СтатьяДДС_ГФУН			= СтрокаТЗФ.СтатьяДДС_ГФУН;      // fix Suetin 25.06.2019 13:01:54
			Нстрока.СуммаДолгаПоДоговору 	= ?(СуммаДолгаПоДоговору < 0, 0, Мин(СуммаДолгаПоДоговору, СуммаДляСписания));
			СуммаДолгаПоДоговору 			= СуммаДолгаПоДоговору - СуммаДляСписания;
			БылиНайденыСтрокиЗадолженности = Истина;
			Если Не СуммаДолгаПоДоговору > 0 Тогда Прервать; КонецЕсли; 
		//ИначеЕсли ДтКт = "Кт" и СтрокаТЗФ.Флаг = "К" Тогда
		//	Нстрока = ТаблицаДокументовДолга.Добавить();
		//	Нстрока.Регистратор 			= СтрокаТЗФ.Регистратор;
		//	Нстрока.ПроверятьГалочку 		= СтрокаТЗФ.ПроверятьГалочку;
		//	Нстрока.ЕстьУслуги 				= СтрокаТЗФ.ЕстьУслуги;
		//	Нстрока.СтатьяДДС_ГФУН			= СтрокаТЗФ.СтатьяДДС_ГФУН;     // fix Suetin 25.06.2019 13:01:49
		//	Нстрока.СуммаДолгаПоДоговору 	= ?(СуммаДолгаПоДоговору < 0, 0, Мин(СуммаДолгаПоДоговору, СуммаДляСписания));
		//	СуммаДолгаПоДоговору 			= СуммаДолгаПоДоговору - СуммаДляСписания;
		//	БылиНайденыСтрокиЗадолженности = Истина;
		//	Если Не СуммаДолгаПоДоговору > 0 Тогда Прервать; КонецЕсли; 
		ИначеЕсли Не БылиНайденыСтрокиЗадолженности Тогда
			Продолжить;
		ИначеЕсли СуммаДолгаПоДоговору > 0 Тогда
			Продолжить;	
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаДокументовДолга;
КонецФункции

Функция ПолучитьРезерв(Знач Счет, Знач Контрагент, Знач Договор, Знач Выборка_3)
	СуммаРезерва = 0;
	Если Не Счет = ПланыСчетов.Хозрасчетный.РасчетыПоПричитающимсяДивидендам Тогда
		СтруктураПоиска = Новый Структура("Контрагент, Договор", Контрагент, Договор);
		Если Выборка_3.НайтиСледующий(СтруктураПоиска) Тогда
			СуммаРезерва = Выборка_3.Сумма;
		КонецЕсли; 
	КонецЕсли;
	Возврат СуммаРезерва;
КонецФункции

Функция ПолучитьОстаток(Знач Счет, Знач Контрагент, Знач Договор, Знач ОбъектРасчетов, Знач ВыборкаОстатков,Знач ДтКт = "Дт", Знач Суффикс = "")
	СуммаОстатка = 0;
	СтруктураПоиска = Новый Структура("Счет, Контрагент, Договор, ОбъектРасчетов", Счет, Контрагент, Договор, ОбъектРасчетов);
	СписокСтрок = ВыборкаОстатков.НайтиСтроки(СтруктураПоиска);
	КоличествоНайденныхСтрок = СписокСтрок.Количество();	
	//Если ВыборкаОстатков.НайтиСледующий(СтруктураПоиска) Тогда
	Если КоличествоНайденныхСтрок Тогда
		СуммаОстатка = СписокСтрок[0]["СуммаОстаток" + ДтКт + Суффикс];
		//Если ДтКт = "Дт" Тогда
		//	//СуммаОстатка = ВыборкаОстатков.СуммаОстатокДт;
		//	СуммаОстатка = СписокСтрок[0].СуммаОстатокДт;
		//Иначе
		//	//СуммаОстатка = ВыборкаОстатков.СуммаОстатокКт;
		//	СуммаОстатка = СписокСтрок[0].СуммаОстатокКт;
		//КонецЕсли;	
	КонецЕсли; 
	Возврат СуммаОстатка;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли


//ПолучитьТекстЗапросаСЗаказами(ДтКт)
//	ТекстЗапроса = "
//	|ВЫБРАТЬ ПЕРВЫЕ 1	//0
//	|	Инвентаризация.Дата КАК Дата,
//	|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
//	|	Инвентаризация.Номер КАК Номер,
//	|	Инвентаризация.Организация КАК Организация,
//	|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
//	|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
//	|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
//	|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
//	|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
//	|ПОМЕСТИТЬ Шапка
//	|ИЗ 
//	|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
//	|ГДЕ
//	|	Инвентаризация.Ссылка = &Ссылка
//	|
//	|;
//	|/////////////////////////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ //1
//	|	Задолженность.ДебиторКредитор КАК Контрагент,
//	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
//	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
//	|	Задолженность.Подтверждено КАК Подтверждено,
//	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
//	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
//	|	Задолженность.ВИЛС_Договор КАК ДоговорКонтрагента
//	|ПОМЕСТИТЬ Задолженность	
//	|ИЗ 
//	|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
//	|ГДЕ
//	|	Задолженность.Ссылка = &Ссылка
//	|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
//	//Дебиторская)
//	//
//	//|ИТОГИ
//	//|	СУММА(Подтверждено),
//	//|	СУММА(НеПодтверждено)
//	//|ПО
//	//|	СчетРасчетов
//	|;	
//	|/////////////////////////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ //2
//	|	Т.Регистратор КАК Регистратор,
//	|	Т.Организация КАК Организация,
//	|	Т.Контрагент КАК Контрагент,
//	|	Т.Договор КАК Договор,
//	|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги,
//	|	Т.РасчетныйДокумент КАК РасчетныйДокумент
//	|ПОМЕСТИТЬ РегистраторыСУслугами
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		Т.Ссылка КАК Регистратор,
//	|		Т.Ссылка.Организация КАК Организация,
//	|		Т.Ссылка.Контрагент КАК Контрагент,
//	|		Т.Ссылка.Договор КАК Договор,
//	|		ВЫБОР
//	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
//	|				ТОГДА ИСТИНА
//	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ КАК ЕстьУслуги,
//	|		Т.Ссылка КАК РасчетныйДокумент
//	|	ИЗ
//	|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
//	|	ГДЕ
//	|		Т.Ссылка.Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ ШАПКА КАК ШАПКА)	
//	|	    И Т.Ссылка.Контрагент В (ВЫБРАТЬ РАЗЛИЧНЫЕ  Задолженность.Контрагент ИЗ Задолженность КАК Задолженность)
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		Т.Ссылка,
//	|		Т.Ссылка.Организация,
//	|		Т.Ссылка.Контрагент,
//	|		Т.Ссылка.Договор,
//	|		ВЫБОР
//	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
//	|				ТОГДА ИСТИНА
//	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ,
//	|		Т.Ссылка
//	|	ИЗ
//	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
//	|	ГДЕ
//	|		Т.Ссылка.Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ ШАПКА КАК ШАПКА)	
//	|	    И Т.Ссылка.Контрагент В (ВЫБРАТЬ РАЗЛИЧНЫЕ  Задолженность.Контрагент ИЗ Задолженность КАК Задолженность)
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		Т.Ссылка,
//	|		Т.Ссылка.Организация,
//	|		Т.Ссылка.Контрагент,
//	|		Т.Ссылка.Договор,
//	|		ВЫБОР
//	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
//	|				ТОГДА ИСТИНА
//	|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ,
//	|		Т.Ссылка
//	|	ИЗ
//	|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
//	|	ГДЕ
//	|		Т.Ссылка.Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ ШАПКА КАК ШАПКА)	
//	|	    И Т.Ссылка.Контрагент В (ВЫБРАТЬ РАЗЛИЧНЫЕ  Задолженность.Контрагент ИЗ Задолженность КАК Задолженность)
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		Т.Ссылка,
//	|		Т.Ссылка.Организация,
//	|		Т.Контрагент,
//	|		ВЫБОР КОГДА НЕ ЕСТЬNULL(Т.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|			ТОГДА 
//	|				Т.Договор
//	|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) 	 
//	|			ТОГДА
//	|				ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов)
//	|			ИНАЧЕ	
//	|				Т.ДокументРасчетов.Договор
//	|			КОНЕЦ,	
//	|		ЛОЖЬ,
//	|		Т.ДокументРасчетов
//	|	ИЗ
//	|		Документ.ВводОстатков.РасчетыСПартнерами КАК Т
//	|	ГДЕ
//	|		Т.Ссылка.Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ ШАПКА КАК ШАПКА)	
//	|	    И Т.Контрагент В (ВЫБРАТЬ РАЗЛИЧНЫЕ  Задолженность.Контрагент ИЗ Задолженность КАК Задолженность)
//	|	    ) КАК Т
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Т.Регистратор,
//	|	Т.Организация,
//	|	Т.Контрагент,
//	|	Т.Договор,
//	|	Т.РасчетныйДокумент
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	Контрагент,
//	|	Договор
//	|;
//	|///////////////////////////////////////////////////////////////////////////////   
//	|ВЫБРАТЬ	//3
//	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
//	|	ХозрасчетныйОстатки.Субконто2 КАК ДоговорКонтрагента,
//	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
//	|ИЗ
//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
//	|			&КонПериода,
//	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
//	|			, Организация 	 В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ Шапка КАК Шапка)	//&Организация
//	|				И Субконто1  В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.Контрагент ИЗ Задолженность КАК ЗадолженностьНовая)
//	|				И Субконто2  В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДоговорКонтрагента ИЗ Задолженность КАК ЗадолженностьНовая)) КАК ХозрасчетныйОстатки
//	|
//	|;
//	|///////////////////////////////////////////////////////////////////////////////
//	| ВЫБРАТЬ РАЗРЕШЕННЫЕ //4
//	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
//	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
//	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
//	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
//	|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) КАК ОбъектРасчетов,
//	|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) КАК РасчетныйДокумент,
//	|	ЕСТЬNULL(СУММА(ВЫБОР
//	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
//	|				ИНАЧЕ 0
//	|			КОНЕЦ), 0) КАК СуммаОборот,
//	|	СУММА(ВЫБОР
//	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК СуммаОборотДт,
//	|	ЕСТЬNULL(СУММА(ВЫБОР
//	|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
//	|				ИНАЧЕ 0
//	|			КОНЕЦ), 0) КАК СуммаОборотКт,
//	|	ВЫБОР
//	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
//	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
//	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
//	|	КОНЕЦ КАК Счет
//	|ПОМЕСТИТЬ РасчетыПоСрокам
//	|ИЗ
//	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
//	|				ТОГДА ЛОЖЬ
//	|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
//	|				ТОГДА ЛОЖЬ
//	|			ИНАЧЕ ИСТИНА
//	|		КОНЕЦ
//	|	//И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
//	|	//И РасчетыСКлиентамиПоСрокам.ОбъектРасчетов = &ОбъектРасчетов
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор,
//	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
//	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
//	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
//	|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
//	|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО),
//	|	ВЫБОР
//	|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
//	|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
//	|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
//	|	КОНЕЦ
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//    |
//	|ВЫБРАТЬ
//	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
//	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
//	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
//	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
//	|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
//	|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) КАК РасчетныйДокумент,
//	|	ЕСТЬNULL(СУММА(ВЫБОР
//	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|					ТОГДА -(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл)
//	|				ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
//	|			КОНЕЦ), 0),
//	|	ЕСТЬNULL(СУММА(ВЫБОР
//	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
//	|				ИНАЧЕ 0
//	|			КОНЕЦ), 0),
//	|	ЕСТЬNULL(СУММА(ВЫБОР
//	|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
//	|				ИНАЧЕ 0
//	|			КОНЕЦ), 0),
//	|	ВЫБОР
//	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
//	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
//	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
//	|	КОНЕЦ
//	|ИЗ
//	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
//	|				ТОГДА ЛОЖЬ
//	|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
//	|				ТОГДА ЛОЖЬ
//	|			ИНАЧЕ ИСТИНА
//	|		КОНЕЦ
//	|	//И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
//	|	//И РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов = &ОбъектРасчетов
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
//	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
//	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
//	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
//	|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
//	|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО),
//	|	ВЫБОР
//	|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
//	|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
//	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
//	|	КОНЕЦ
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	Контрагент,
//	|	Договор,
//	|	Счет,
//	|	РасчетныйДокумент
//	|;
//	|///////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //5
//	|	ХозрасчетныйОбороты.ДебиторКредитор КАК ДебиторКредитор,
//	|	ХозрасчетныйОбороты.ВИЛС_Договор КАК ВИЛС_Договор,
//	|	ХозрасчетныйОбороты.ЕстьУслуги,
//	|	ХозрасчетныйОбороты.Период КАК Период,
//	|	ХозрасчетныйОбороты.Счет КАК Счет,
//	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
//	|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
//	|   ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
//	|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
//	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
//	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
//	|ИЗ
//	|(ВЫБРАТЬ
//	|	ХозрасчетныйОбороты.ДебиторКредитор КАК ДебиторКредитор,
//	|	ХозрасчетныйОбороты.ВИЛС_Договор КАК ВИЛС_Договор,
//	|	ХозрасчетныйОбороты.ЕстьУслуги,
//	|	ХозрасчетныйОбороты.Период КАК Период,
//	|	ХозрасчетныйОбороты.Счет КАК Счет,
//	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
//	|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
//	|   РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов, 
//	|   ХозрасчетныйОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
//	|   ВЫБОР КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
//	|       ТОГДА
//	|			ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
//	|		ИНАЧЕ
//	|			ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) 
//	|		КОНЕЦ КАК СуммаОборот,
//	|   ВЫБОР КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
//	|       ТОГДА
//	|			ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
//	|		ИНАЧЕ
//	|			ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) 
//	|		КОНЕЦ КАК СуммаОборотДт,
//	|   ВЫБОР КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
//	|       ТОГДА
//	|			ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
//	|		ИНАЧЕ
//	|			ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) 
//	|		КОНЕЦ КАК СуммаОборотКт
//	|ИЗ
//	|	(ВЫБРАТЬ

//	|	ВЫБОР
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто1
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто1
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто1
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто2
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто3
//	|		ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
//	|	КОНЕЦ КАК ДебиторКредитор,
//	|	ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто2
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА ХозрасчетныйОбороты.Субконто3
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|	КОНЕЦ КАК ВИЛС_Договор, // end fix Suetin 17.01.2019 12:58:17

//	|		ХозрасчетныйОбороты.Период КАК Период,
//	|		ХозрасчетныйОбороты.Счет КАК Счет,
//    |	   	ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор, 
//	
//	|       РегистраторыСУслугами.РасчетныйДокумент КАК РасчетныйДокумент,
//	
//	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) = 0
//	|			ТОГДА
//	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
//	//|           КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
//	//|           ТОГДА
//	//|				ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
//	|			ИНАЧЕ
//	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) 
//	|		КОНЕЦ КАК СуммаОборот,		
//	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) = 0
//	|			ТОГДА
//	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
//	//|           КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
//	//|           ТОГДА
//	//|				ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
//	|			ИНАЧЕ
//	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) 
//	|		КОНЕЦ КАК СуммаОборотДт,
//	|		ВЫБОР КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент И НЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) = 0
//	|			ТОГДА
//	|				ЕСТЬNULL(РегистраторыСУслугами.РасчетныйДокумент.СуммаРегл, 0)
//	//|           КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
//	//|           ТОГДА
//	//|				ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
//	|			ИНАЧЕ
//	|				ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) 
//	|		КОНЕЦ КАК СуммаОборотКт,
//	|		ВЫБОР
//	|			КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент 
//	|					И РегистраторыСУслугами.РасчетныйДокумент.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
//	|				ТОГДА ""Деньги""
//	|			КОГДА РегистраторыСУслугами.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент 
//	|					И РегистраторыСУслугами.РасчетныйДокумент.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
//	|				ТОГДА ""Деньги""
//	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
//	|				ТОГДА ""Деньги""
//	|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
//	|				ТОГДА ""Деньги""
//	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
//	|				ТОГДА ""Деньги""
//	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
//	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
//	|				ТОГДА ""Деньги""
//	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
//	|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
//	|				ТОГДА ""Деньги""
//	|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
//	|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
//	|				ТОГДА ""Деньги""
//	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
//	//|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками)
//	//|					И ХозрасчетныйОбороты.КорСубконто1 = &ВТБ_Факторинг
//	//|				ТОГДА ""Деньги""
//	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
//	//|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками)
//	//|					И ХозрасчетныйОбороты.КорСубконто1 = &Транскапиталбанк
//	//|				ТОГДА ""Деньги""
//	|			ИНАЧЕ ""Поставка""
//	|		КОНЕЦ КАК ПроверятьГалочку,
//	|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги
//	|	ИЗ
//	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
//	|				,
//	|				&КонПериода,
//	|				Регистратор,
//	|				ВЫБОР 
//	|					КОГДА Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.СчетРасчетов ИЗ Задолженность КАК ЗадолженностьНовая)	//В (&Счета),
//	|				    	ТОГДА ИСТИНА
//	|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
//	|				    	ТОГДА ИСТИНА
//	|                    ИНАЧЕ ЛОЖЬ КОНЕЦ
//	|				,,//&ВидыСубконто,
//	|				Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ Шапка КАК Шапка)	//= &Организация

//	|	И ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
//	|			ТОГДА Субконто1
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА Субконто1
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА Субконто1
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	|			ТОГДА Субконто2
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	|			ТОГДА Субконто3
//	|		ИНАЧЕ NULL
//	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.Контрагент ИЗ Задолженность КАК ЗадолженностьНовая)    //= &Контрагент	//
//	|	И ВЫБОР
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА Субконто2
//	|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА Субконто3
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|	КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДоговорКонтрагента ИЗ Задолженность КАК ЗадолженностьНовая) 	//= &Договор	//	
//	|,
//	|				,
//	|				) КАК ХозрасчетныйОбороты
//	|    ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами
//	|    	ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
//	
//	|			И ХозрасчетныйОбороты.Организация = РегистраторыСУслугами.Организация
//	|			И ВЫБОР
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто1
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто1
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто1
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто2
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто3
//	|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
//	|			КОНЕЦ = РегистраторыСУслугами.Контрагент
//	|			И ВЫБОР                   // begin fix Suetin 17.01.2019 12:58:11
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто2
//	|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|					ТОГДА ХозрасчетныйОбороты.Субконто3
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|			КОНЕЦ = РегистраторыСУслугами.Договор 
//	|                             ) КАК ХозрасчетныйОбороты
//	|    ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокам
//	|    	ПО ХозрасчетныйОбороты.Регистратор = РасчетыПоСрокам.Регистратор
//	|			//И ХозрасчетныйОбороты.Организация = РасчетыПоСрокам.Организация
//	|			И ХозрасчетныйОбороты.Счет = РасчетыПоСрокам.Счет
//	|			И ХозрасчетныйОбороты.ДебиторКредитор = РасчетыПоСрокам.Контрагент
//	|			И ХозрасчетныйОбороты.ВИЛС_Договор = РасчетыПоСрокам.Договор
//	|			И ХозрасчетныйОбороты.РасчетныйДокумент = РасчетыПоСрокам.РасчетныйДокумент
//	|			
//	|											) КАК ХозрасчетныйОбороты
//	|
//	|СГРУППИРОВАТЬ ПО

//	|	ХозрасчетныйОбороты.ДебиторКредитор,
//	|	ХозрасчетныйОбороты.ВИЛС_Договор, // fix Suetin 17.01.2019 12:58:17
//	|   ХозрасчетныйОбороты.ОбъектРасчетов,
//	|	ХозрасчетныйОбороты.ЕстьУслуги,   // fix Suetin 25.03.2019 18:45:23
//	|	ХозрасчетныйОбороты.Регистратор,
//	|	ХозрасчетныйОбороты.Период,
//	|	ХозрасчетныйОбороты.Счет,
//	|	ХозрасчетныйОбороты.ПроверятьГалочку
//	|
//	//|УПОРЯДОЧИТЬ ПО
//	//|	ХозрасчетныйОбороты.Период
//	|ИТОГИ
//	|	СУММА(СуммаОборот)
//	|ПО
//	//|	Счет.Родитель.Родитель,
//	//|	Счет.Родитель,
//	|	Счет
//	|;
//	|/////////////////////////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ //6
//	|	Задолженность.СчетРасчетов КАК СчетРасчетов,
//	|	Задолженность.Контрагент КАК Контрагент,
//	|	Задолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
//	|	Задолженность.Подтверждено КАК Подтверждено,
//	|	Задолженность.НеПодтверждено КАК НеПодтверждено,
//	|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
//	|ИЗ 
//	|	Задолженность КАК Задолженность
//	|УПОРЯДОЧИТЬ ПО
//	|	СчетРасчетов
//	|ИТОГИ
//	|	СУММА(Подтверждено),
//	|	СУММА(НеПодтверждено)
//	|ПО
//	|	СчетРасчетов ИЕРАРХИЯ
//	|АВТОУПОРЯДОЧИВАНИЕ
//	|;
//	//|/////////////////////////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ   //6
//	//|	ВЫБОР
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто1
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто1
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто1
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто2
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто3
//	//|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Наименование
//	//|	КОНЕЦ КАК ДебиторКредитор,
//	//|	ВЫБОР
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто2
//	//|		КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//|			ТОГДА ХозрасчетныйОстатки.Субконто3
//	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	//|	КОНЕЦ КАК ВИЛС_Договор,
//	//|	ХозрасчетныйОстатки.Счет КАК Счет,
//	//|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК СуммаОстаток,		
//	//|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0) КАК СуммаОстатокДт,
//	//|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) КАК СуммаОстатокКт
//	//
//	//|	ИЗ
//	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(&КонПериода,
//	//|				ВЫБОР 
//	//|					КОГДА Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.СчетРасчетов ИЗ Задолженность КАК ЗадолженностьНовая)
//	//|				    	ТОГДА ИСТИНА
//	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
//	//|				    	ТОГДА ИСТИНА
//	//|                    ИНАЧЕ ЛОЖЬ КОНЕЦ
//	//|				,,
//	//|				Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Шапка.Организация ИЗ Шапка КАК Шапка)
//	//|				И ВЫБОР
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
//	//|						ТОГДА Субконто1
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	//|						ТОГДА Субконто1
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//|						ТОГДА Субконто1
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	//|						ТОГДА Субконто2
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
//	//|						ТОГДА Субконто3
//	//|					ИНАЧЕ NULL
//	//|				КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.Контрагент ИЗ Задолженность КАК ЗадолженностьНовая)
//	//|				И ВЫБОР
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//|						ТОГДА Субконто2
//	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//|						ТОГДА Субконто3
//	//|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	//|				КОНЕЦ В (ВЫБРАТЬ РАЗЛИЧНЫЕ ЗадолженностьНовая.ДоговорКонтрагента ИЗ Задолженность КАК ЗадолженностьНовая)	
//	//|				) КАК ХозрасчетныйОстатки
//	//|;
//	|";


	
	//ПолучитьТекстЗапросаСЗаказами = "
	//|ВЫБРАТЬ ПЕРВЫЕ 1  // 0
	//|	Инвентаризация.Дата КАК Дата,
	//|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	//|	Инвентаризация.Номер КАК Номер,
	//|	Инвентаризация.Организация КАК Организация,
	//|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	//|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	//|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	//|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	//|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	//|ПОМЕСТИТЬ Шапка
	//|ИЗ
	//|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	//|ГДЕ
	//|	Инвентаризация.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ      // 1
	//|	Задолженность.Ссылка.Организация КАК Организация,
	//|	Задолженность.ДебиторКредитор КАК Контрагент,
	//|	Задолженность.ВИЛС_Договор КАК Договор,
	//|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	//|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	//|	Задолженность.Подтверждено КАК Подтверждено,
	//|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	//|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
	//|ПОМЕСТИТЬ Задолженность
	//|ИЗ
	//|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	//|ГДЕ
	//|	Задолженность.Ссылка = &Ссылка
	//|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	//|	//И Задолженность.ВИЛС_Договор = &Договор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ    //2
	//|	Т.Регистратор КАК Регистратор,
	//|	Т.Организация КАК Организация,
	//|	Т.Контрагент КАК Контрагент,
	//|	Т.Договор КАК Договор,
	//|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги
	//|ПОМЕСТИТЬ РегистраторыСУслугами
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Т.Ссылка КАК Регистратор,
	//|		Т.Ссылка.Организация КАК Организация,
	//|		Т.Ссылка.Контрагент КАК Контрагент,
	//|		Т.Ссылка.Договор КАК Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ КАК ЕстьУслуги
	//|	ИЗ
	//|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент
	//|				ИЗ
	//|					Задолженность)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Ссылка,
	//|		Т.Ссылка.Организация,
	//|		Т.Ссылка.Контрагент,
	//|		Т.Ссылка.Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	ИЗ
	//|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент
	//|				ИЗ
	//|					Задолженность)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Ссылка,
	//|		Т.Ссылка.Организация,
	//|		Т.Ссылка.Контрагент,
	//|		Т.Ссылка.Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	ИЗ
	//|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент
	//|				ИЗ
	//|					Задолженность)) КАК Т
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Т.Регистратор,
	//|	Т.Организация,
	//|	Т.Контрагент,
	//|	Т.Договор
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	Контрагент,
	//|	Договор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ   // 3
	//|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	//|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	//|ИЗ
	//|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|			&КонПериода,
	//|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	//|			,
	//|			(Организация, Субконто1, Субконто2) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент,
	//|					Задолженность.Договор
	//|				ИЗ
	//|					Задолженность)) КАК ХозрасчетныйОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ       // 4
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	//|	КОНЕЦ КАК Период,
	//|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL) КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ КАК РасчетныйДокумент,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|			ИНАЧЕ 0
	//|		КОНЕЦ - ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборот,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|			ИНАЧЕ 0
	//|		КОНЕЦ), 0) КАК СуммаОборотДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборотКт,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет
	//|ПОМЕСТИТЬ РасчетыПоСрокам
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	//|ГДЕ
	//|	(РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	//|			(ВЫБРАТЬ
	//|				Задолженность.Организация,
	//|				Задолженность.Контрагент,
	//|				Задолженность.Договор
	//|			ИЗ
	//|				Задолженность)
	//|	И ВЫБОР
	//|   		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|   			ТОГДА ИСТИНА
	//|   		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	//|   			ТОГДА ИСТИНА
	//|   		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	//|   			ТОГДА ИСТИНА
	//|			//КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			//	ТОГДА ЛОЖЬ
	//|			//КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			//	ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ - ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	//|ГДЕ
	//|	(РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	//|			(ВЫБРАТЬ
	//|				Задолженность.Организация,
	//|				Задолженность.Контрагент,
	//|				Задолженность.Договор
	//|			ИЗ
	//|				Задолженность)
	//|	И ВЫБОР
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	//|				ТОГДА ИСТИНА
	//|			//КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			//	ТОГДА ЛОЖЬ
	//|			//КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			//	ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	Контрагент,
	//|	Договор,
	//|	Счет,
	//|	РасчетныйДокумент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ      // 5
	//|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|	ХозрасчетныйОбороты.Договор КАК Договор,
	//|	ХозрасчетныйОбороты.ЕстьУслуги КАК ЕстьУслуги,
	//|	ХозрасчетныйОбороты.Период КАК Период,
	//|	ХозрасчетныйОбороты.Счет КАК Счет,
	//|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	//|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	//|ИЗ
	//|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|		ХозрасчетныйОбороты.Договор КАК Договор,
	//|		ХозрасчетныйОбороты.Период КАК Период,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	//|		ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) КАК СуммаОборот,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК СуммаОборотКт,
	//|		ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	//|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	//|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	//|				ТОГДА ""Деньги""
	//|			ИНАЧЕ ""Поставка""
	//|		КОНЕЦ КАК ПроверятьГалочку,
	//|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	//|		ХозрасчетныйОбороты.СтатьяДДС_ГФУН КАК СтатьяДДС_ГФУН
	//|	ИЗ
	//|		(ВЫБРАТЬ
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто2
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто3
	//|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|			КОНЕЦ КАК Контрагент,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто2
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто3
	//|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|			КОНЕЦ КАК Договор,
	//|			ЕСТЬNULL(РасчетыПоСрокам.Период, ХозрасчетныйОбороты.Период) КАК Период,
	//|			ХозрасчетныйОбороты.Счет КАК Счет,
	//|			ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	//|			ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор,
	//|			РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	//|			ВЫБОР
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	//|				ИНАЧЕ NULL
	//|			КОНЕЦ КАК СтатьяДДС_ГФУН,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0)
	//|			КОНЕЦ КАК СуммаОборот,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	//|			КОНЕЦ КАК СуммаОборотДт,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	//|			КОНЕЦ КАК СуммаОборотКт
	//|		ИЗ
	//|			РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|					,
	//|					&КонПериода,
	//|					Регистратор,
	//|					ВЫБОР
	//|						КОГДА Счет В
	//|								(ВЫБРАТЬ
	//|									Задолженность.СчетРасчетов
	//|								ИЗ
	//|									Задолженность)
	//|							ТОГДА ИСТИНА
	//|						КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|							ТОГДА ИСТИНА
	//|						ИНАЧЕ ЛОЖЬ
	//|					КОНЕЦ,
	//|					,
	//|					(Организация, ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА Субконто3
	//|						ИНАЧЕ NULL
	//|					КОНЕЦ, ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто3
	//|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|					КОНЕЦ) В
	//|						(ВЫБРАТЬ
	//|							Задолженность.Организация,
	//|							Задолженность.Контрагент,
	//|							Задолженность.Договор
	//|						ИЗ
	//|							Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|				ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокам КАК РасчетыПоСрокам
	//|				ПО ХозрасчетныйОбороты.Регистратор = РасчетыПоСрокам.Регистратор
	//|					И ХозрасчетныйОбороты.Организация = РасчетыПоСрокам.Организация
	//|					И ХозрасчетныйОбороты.Счет = РасчетыПоСрокам.Счет
	//|					И (ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто3
	//|						ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|					КОНЕЦ = РасчетыПоСрокам.Контрагент)
	//|					И (ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто3
	//|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|					КОНЕЦ = РасчетыПоСрокам.Договор)) КАК ХозрасчетныйОбороты
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами КАК РегистраторыСУслугами
	//|			ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	//|				И ХозрасчетныйОбороты.Контрагент = РегистраторыСУслугами.Контрагент
	//|				И ХозрасчетныйОбороты.Договор = РегистраторыСУслугами.Договор) КАК ХозрасчетныйОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ХозрасчетныйОбороты.Контрагент,
	//|	ХозрасчетныйОбороты.Договор,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов,
	//|	ХозрасчетныйОбороты.ЕстьУслуги,
	//|	ХозрасчетныйОбороты.Регистратор,
	//|	ХозрасчетныйОбороты.Период,
	//|	ХозрасчетныйОбороты.Счет,
	//|	ХозрасчетныйОбороты.ПроверятьГалочку,
	//|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Контрагент,
	//|	Договор,
	//|	Период,
	//|	Регистратор,
	//|	ОбъектРасчетов,
	//|	Счет,
	//|	СтатьяДДС_ГФУН
	//|ИТОГИ
	//|	СУММА(СуммаОборот)
	//|ПО
	//|	Счет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ      // 6
	//|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	//|	Задолженность.Контрагент КАК Контрагент,
	//|	Задолженность.Договор КАК Договор,
	//|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	//|	Задолженность.Подтверждено КАК Подтверждено,
	//|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	//|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности
	//|ИЗ
	//|	Задолженность КАК Задолженность
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СчетРасчетов
	//|ИТОГИ
	//|	СУММА(Подтверждено),
	//|	СУММА(НеПодтверждено)
	//|ПО
	//|	СчетРасчетов ИЕРАРХИЯ
	//|АВТОУПОРЯДОЧИВАНИЕ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ    // 7
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	//|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток < 0
	//|					ТОГДА -(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток)
	//|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			КОНЕЦ), 0) КАК СуммаОстаток,
	//|	СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаОстатокДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОстатокКт
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	//|			&КонПериода,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	//|				И ВЫБОР
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|						ТОГДА ЛОЖЬ
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|						ТОГДА ЛОЖЬ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК РасчетыСКлиентамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток < 0
	//|					ТОГДА -(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток)
	//|				ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0)
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	//|			&КонПериода,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	//|				И ВЫБОР
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|						ТОГДА ЛОЖЬ
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|						ТОГДА ЛОЖЬ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК РасчетыСПоставщикамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//|";
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	//
	//ПолучитьТекстПросроченногоЗапросаСЗаказами = "
	//|ВЫБРАТЬ ПЕРВЫЕ 1     //0
	//|	Инвентаризация.Дата КАК Дата,
	//|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	//|	Инвентаризация.Номер КАК Номер,
	//|	Инвентаризация.Организация КАК Организация,
	//|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	//|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	//|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	//|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	//|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	//|ПОМЕСТИТЬ Шапка
	//|ИЗ
	//|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	//|ГДЕ
	//|	Инвентаризация.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ                  //1
	//|	Задолженность.Ссылка.Организация КАК Организация,
	//|	Задолженность.ДебиторКредитор КАК Контрагент,
	//|	Задолженность.ВИЛС_Договор КАК Договор,
	//|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	//|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	//|	Задолженность.Подтверждено КАК Подтверждено,
	//|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	//|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	//|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	//|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	//|ПОМЕСТИТЬ Задолженность
	//|ИЗ
	//|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	//|ГДЕ
	//|	Задолженность.Ссылка = &Ссылка
	//|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ          //2
	//|	Т.Регистратор КАК Регистратор,
	//|	Т.Организация КАК Организация,
	//|	Т.Контрагент КАК Контрагент,
	//|	Т.Договор КАК Договор,
	//|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги
	//|ПОМЕСТИТЬ РегистраторыСУслугами
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Т.Ссылка КАК Регистратор,
	//|		Т.Ссылка.Организация КАК Организация,
	//|		Т.Ссылка.Контрагент КАК Контрагент,
	//|		Т.Ссылка.Договор КАК Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ КАК ЕстьУслуги
	//|	ИЗ
	//|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент
	//|				ИЗ
	//|					Задолженность)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Ссылка,
	//|		Т.Ссылка.Организация,
	//|		Т.Ссылка.Контрагент,
	//|		Т.Ссылка.Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	ИЗ
	//|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент
	//|				ИЗ
	//|					Задолженность)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Ссылка,
	//|		Т.Ссылка.Организация,
	//|		Т.Ссылка.Контрагент,
	//|		Т.Ссылка.Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	ИЗ
	//|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент
	//|				ИЗ
	//|					Задолженность)) КАК Т
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Т.Регистратор,
	//|	Т.Организация,
	//|	Т.Контрагент,
	//|	Т.Договор
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	Контрагент,
	//|	Договор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ           //3
	//|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	//|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	//|ИЗ
	//|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|			&КонПериода,
	//|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	//|			,
	//|			(Организация, Субконто1, Субконто2) В
	//|				(ВЫБРАТЬ
	//|					Задолженность.Организация,
	//|					Задолженность.Контрагент,
	//|					Задолженность.Договор
	//|				ИЗ
	//|					Задолженность)) КАК ХозрасчетныйОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ   //4
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	//|	КОНЕЦ КАК Период,
	//|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|				ТОГДА NULL
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|				ТОГДА NULL
	//|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|		КОНЕЦ, NULL) КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ КАК РасчетныйДокумент,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ - ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборот,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборотДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборотКт,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет
	//|ПОМЕСТИТЬ РасчетыПоСрокам
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	//|ГДЕ
	//|	(РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	//|			(ВЫБРАТЬ
	//|				Задолженность.Организация,
	//|				Задолженность.Контрагент,
	//|				Задолженность.Договор
	//|			ИЗ
	//|				Задолженность)
	//|	И ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|				ТОГДА NULL
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|				ТОГДА NULL
	//|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|		КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|				ТОГДА NULL
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|				ТОГДА NULL
	//|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|		КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ - ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	//|ГДЕ
	//|	(РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	//|			(ВЫБРАТЬ
	//|				Задолженность.Организация,
	//|				Задолженность.Контрагент,
	//|				Задолженность.Договор
	//|			ИЗ
	//|				Задолженность)
	//|	И ВЫБОР
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|				ТОГДА NULL
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|				ТОГДА NULL
	//|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|		КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	Контрагент,
	//|	Договор,
	//|	Счет,
	//|	РасчетныйДокумент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //5
	//|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|	ХозрасчетныйОбороты.Договор КАК Договор,
	//|	ХозрасчетныйОбороты.ЕстьУслуги КАК ЕстьУслуги,
	//|	ХозрасчетныйОбороты.Период КАК Период,
	//|	ХозрасчетныйОбороты.Счет КАК Счет,
	//|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	//|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	//|ИЗ
	//|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|		ХозрасчетныйОбороты.Договор КАК Договор,
	//|		ХозрасчетныйОбороты.Период КАК Период,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	//|		ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) КАК СуммаОборот,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК СуммаОборотКт,
	//|		ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	//|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	//|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	//|				ТОГДА ""Деньги""
	//|			ИНАЧЕ ""Поставка""
	//|		КОНЕЦ КАК ПроверятьГалочку,
	//|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	//|		ХозрасчетныйОбороты.СтатьяДДС_ГФУН КАК СтатьяДДС_ГФУН
	//|	ИЗ
	//|		(ВЫБРАТЬ
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто2
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто3
	//|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|			КОНЕЦ КАК Контрагент,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто2
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто3
	//|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|			КОНЕЦ КАК Договор,
	//|			ЕСТЬNULL(РасчетыПоСрокам.Период, ХозрасчетныйОбороты.Период) КАК Период,
	//|			ХозрасчетныйОбороты.Счет КАК Счет,
	//|			ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	//|			ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор,
	//|			РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	//|			ВЫБОР
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	//|				ИНАЧЕ NULL
	//|			КОНЕЦ КАК СтатьяДДС_ГФУН,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0)
	//|			КОНЕЦ КАК СуммаОборот,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	//|			КОНЕЦ КАК СуммаОборотДт,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	//|			КОНЕЦ КАК СуммаОборотКт
	//|		ИЗ
	//|			РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|					,
	//|					&КонПериода,
	//|					Регистратор,
	//|					ВЫБОР
	//|						КОГДА Счет В
	//|								(ВЫБРАТЬ
	//|									Задолженность.СчетРасчетов
	//|								ИЗ
	//|									Задолженность)
	//|							ТОГДА ИСТИНА
	//|						КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|							ТОГДА ИСТИНА
	//|						ИНАЧЕ ЛОЖЬ
	//|					КОНЕЦ,
	//|					,
	//|					(Организация, ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА Субконто3
	//|						ИНАЧЕ NULL
	//|					КОНЕЦ, ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто3
	//|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|					КОНЕЦ) В
	//|						(ВЫБРАТЬ
	//|							Задолженность.Организация,
	//|							Задолженность.Контрагент,
	//|							Задолженность.Договор
	//|						ИЗ
	//|							Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|				ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокам КАК РасчетыПоСрокам
	//|				ПО ХозрасчетныйОбороты.Регистратор = РасчетыПоСрокам.Регистратор
	//|					И ХозрасчетныйОбороты.Организация = РасчетыПоСрокам.Организация
	//|					И ХозрасчетныйОбороты.Счет = РасчетыПоСрокам.Счет
	//|					И (ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто3
	//|						ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|					КОНЕЦ = РасчетыПоСрокам.Контрагент)
	//|					И (ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто3
	//|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|					КОНЕЦ = РасчетыПоСрокам.Договор)) КАК ХозрасчетныйОбороты
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами КАК РегистраторыСУслугами
	//|			ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	//|				И ХозрасчетныйОбороты.Контрагент = РегистраторыСУслугами.Контрагент
	//|				И ХозрасчетныйОбороты.Договор = РегистраторыСУслугами.Договор) КАК ХозрасчетныйОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ХозрасчетныйОбороты.Контрагент,
	//|	ХозрасчетныйОбороты.Договор,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов,
	//|	ХозрасчетныйОбороты.ЕстьУслуги,
	//|	ХозрасчетныйОбороты.Регистратор,
	//|	ХозрасчетныйОбороты.Период,
	//|	ХозрасчетныйОбороты.Счет,
	//|	ХозрасчетныйОбороты.ПроверятьГалочку,
	//|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Контрагент,
	//|	Договор,
	//|	Период,
	//|	Регистратор,
	//|	ОбъектРасчетов,
	//|	Счет,
	//|	СтатьяДДС_ГФУН
	//|ИТОГИ
	//|	СУММА(СуммаОборот)
	//|ПО
	//|	Счет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ         //6
	//|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	//|	Задолженность.Контрагент КАК Контрагент,
	//|	Задолженность.Договор КАК Договор,
	//|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	//|	Задолженность.Подтверждено КАК Подтверждено,
	//|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	//|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	//|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	//|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	//|ИЗ
	//|	Задолженность КАК Задолженность
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СчетРасчетов
	//|ИТОГИ
	//|	СУММА(Подтверждено),
	//|	СУММА(НеПодтверждено),
	//|	СУММА(ВИЛС_Подтверждено1Месяц),
	//|	СУММА(ВИЛС_НеПодтверждено1Месяц),
	//|	СУММА(ВИЛС_Подтверждено2Месяц),
	//|	СУММА(ВИЛС_НеПодтверждено2Месяц)
	//|ПО
	//|	СчетРасчетов ИЕРАРХИЯ
	//|АВТОУПОРЯДОЧИВАНИЕ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ  //7
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	////|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) КАК ОбъектРасчетов,
	//|	ВЫБОР 
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет,
	////|	ЕСТЬNULL(СУММА(ВЫБОР
	////|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток < 0
	////|					ТОГДА -(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток)
	////|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	////|			КОНЕЦ), 0) КАК СуммаОстаток,
	//|	СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаОстатокДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОстатокКт,
	//|	СУММА(0) КАК СуммаОстатокДт1М,
	//|	СУММА(0) КАК СуммаОстатокКт1М,
	//|	СУММА(0) КАК СуммаОстатокДт2М,
	//|	СУММА(0) КАК СуммаОстатокКт2М
	//|ПОМЕСТИТЬ ОстаткиПоОбъектамРасчетов
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	//|			&КонПериода,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	////|				И ВЫБОР
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	////|						ТОГДА ЛОЖЬ
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	////|						ТОГДА ЛОЖЬ
	////|					ИНАЧЕ ИСТИНА
	////|				КОНЕЦ
	//|					) КАК РасчетыСКлиентамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|   СУММА(0),
	//|   СУММА(0),
	//|   СУММА(0),
	//|   СУММА(0)
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	//|			&КонПериода,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	////|				И ВЫБОР
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	////|						ТОГДА ЛОЖЬ
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	////|						ТОГДА ЛОЖЬ
	////|					ИНАЧЕ ИСТИНА
	////|				КОНЕЦ
	//|					) КАК РасчетыСПоставщикамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|

	//|ВЫБРАТЬ
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	////|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) КАК ОбъектРасчетов,
	//|	ВЫБОР 
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет,
	//|   СУММА(0),
	//|   СУММА(0),
	////|	ЕСТЬNULL(СУММА(ВЫБОР
	////|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток < 0
	////|					ТОГДА -(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток)
	////|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	////|			КОНЕЦ), 0) КАК СуммаОстаток,
	//|	СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаОстатокДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОстатокКт,
	//|   СУММА(0),
	//|   СУММА(0)
	//|
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	//|			&КонПериода1М,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	////|				И ВЫБОР
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	////|						ТОГДА ЛОЖЬ
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	////|						ТОГДА ЛОЖЬ
	////|					ИНАЧЕ ИСТИНА
	////|				КОНЕЦ
	//|					) КАК РасчетыСКлиентамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|   СУММА(0),
	//|   СУММА(0),
	////|	ЕСТЬNULL(СУММА(ВЫБОР
	////|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток < 0
	////|					ТОГДА -(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток)
	////|				ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	////|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|   СУММА(0),
	//|   СУММА(0)
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	//|			&КонПериода1М,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	////|				И ВЫБОР
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	////|						ТОГДА ЛОЖЬ
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	////|						ТОГДА ЛОЖЬ
	////|					ИНАЧЕ ИСТИНА
	////|				КОНЕЦ
	//|					) КАК РасчетыСПоставщикамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|

	//|ВЫБРАТЬ
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	////|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) КАК ОбъектРасчетов,
	//|	ВЫБОР 
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет,
	//|   СУММА(0),
	//|   СУММА(0),
	//|   СУММА(0),
	//|   СУММА(0),
	//|	СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаОстатокДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОстатокКт
	//|
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	//|			&КонПериода2М,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	////|				И ВЫБОР
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	////|						ТОГДА ЛОЖЬ
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	////|						ТОГДА ЛОЖЬ
	////|					ИНАЧЕ ИСТИНА
	////|				КОНЕЦ
	//|					) КАК РасчетыСКлиентамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|   СУММА(0),
	//|   СУММА(0),
	//|   СУММА(0),
	//|   СУММА(0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0)
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	//|			&КонПериода2М,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	////|				И ВЫБОР
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	////|						ТОГДА ЛОЖЬ
	////|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	////|						ТОГДА ЛОЖЬ
	////|					ИНАЧЕ ИСТИНА
	////|				КОНЕЦ
	//|					) КАК РасчетыСПоставщикамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	////|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР 
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов 
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями 
	//|			ТОГДА NULL
	//|       ИНАЧЕ  РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ   //8
	//|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|	ХозрасчетныйОбороты.Договор КАК Договор,
	//|	ХозрасчетныйОбороты.Счет КАК Счет,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода2МДт) КАК КонПериода2МДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода2МКт) КАК КонПериода2МКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МКт) КАК ОборотыПериода1МКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МДт) КАК ОборотыПериода1МДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода1МДт) КАК КонПериода1МДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода1МКт) КАК КонПериода1МКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериодаКт) КАК ОборотыПериодаКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериодаДт) КАК ОборотыПериодаДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериодаДт) КАК КонПериодаДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериодаКт) КАК КонПериодаКт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт) КАК СуммаОстатокДт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт) КАК СуммаОстатокКт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт1М) КАК СуммаОстатокДт1М,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт1М) КАК СуммаОстатокКт1М,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт2М) КАК СуммаОстатокДт2М,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт2М) КАК СуммаОстатокКт2М,
	//|	ЗначенияСвойств.Значение КАК Мероприятие,
	//|	ЗначенияСвойствСрокПогашенияЗадолженности.Значение КАК СрокПогашенияЗадолженности
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ КАК Контрагент,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ КАК Договор,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		NULL КАК ОбъектРасчетов,
	//|		ХозрасчетныйОбороты.СуммаОстатокДт КАК КонПериода2МДт,
	//|		ХозрасчетныйОбороты.СуммаОстатокКт КАК КонПериода2МКт,
	//|		0 КАК ОборотыПериода1МКт,
	//|		0 КАК ОборотыПериода1МДт,
	//|		0 КАК КонПериода1МДт,
	//|		0 КАК КонПериода1МКт,
	//|		0 КАК ОборотыПериодаКт,
	//|		0 КАК ОборотыПериодаДт,
	//|		0 КАК КонПериодаДт,
	//|		0 КАК КонПериодаКт,
	//|		0 КАК СуммаОстатокДт,
	//|		0 КАК СуммаОстатокКт,
	//|		0 КАК СуммаОстатокДт1М,
	//|		0 КАК СуммаОстатокКт1М,
	//|		0 КАК СуммаОстатокДт2М,
	//|		0 КАК СуммаОстатокКт2М
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода2М,
	//|				ВЫБОР
	//|					КОГДА Счет В
	//|							(ВЫБРАТЬ
	//|								Задолженность.СчетРасчетов
	//|							ИЗ
	//|								Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|				,
	//|				(Организация, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|				КОНЕЦ) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)) КАК ХозрасчетныйОбороты
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет,
	//|		NULL,
	//|		0,
	//|		0,
	//|		ХозрасчетныйОбороты.СуммаОборотКт,
	//|		ХозрасчетныйОбороты.СуммаОборотДт,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачПериода1М,
	//|				&КонПериода1М,
	//|				Регистратор,
	//|				ВЫБОР
	//|					КОГДА Счет В
	//|							(ВЫБРАТЬ
	//|								Задолженность.СчетРасчетов
	//|							ИЗ
	//|								Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|				,
	//|				(Организация, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|				КОНЕЦ) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность),
	//|				,
	//|				) КАК ХозрасчетныйОбороты
	//|	ГДЕ
	//|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	//|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	//|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	//|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет,
	//|		NULL,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		ХозрасчетныйОбороты.СуммаОстатокДт,
	//|		ХозрасчетныйОбороты.СуммаОстатокКт,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода1М,
	//|				ВЫБОР
	//|					КОГДА Счет В
	//|							(ВЫБРАТЬ
	//|								Задолженность.СчетРасчетов
	//|							ИЗ
	//|								Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|				,
	//|				(Организация, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|				КОНЕЦ) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)) КАК ХозрасчетныйОбороты
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет,
	//|		NULL,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		ХозрасчетныйОбороты.СуммаОборотКт,
	//|		ХозрасчетныйОбороты.СуммаОборотДт,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачПериода,
	//|				&КонПериода,
	//|				Регистратор,
	//|				ВЫБОР
	//|					КОГДА Счет В
	//|							(ВЫБРАТЬ
	//|								Задолженность.СчетРасчетов
	//|							ИЗ
	//|								Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|				,
	//|				(Организация, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|				КОНЕЦ) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность),
	//|				,
	//|				) КАК ХозрасчетныйОбороты
	//|	ГДЕ
	//|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	//|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	//|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	//|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет,
	//|		NULL,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		ХозрасчетныйОбороты.СуммаОстатокДт,
	//|		ХозрасчетныйОбороты.СуммаОстатокКт,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода,
	//|				ВЫБОР
	//|					КОГДА Счет В
	//|							(ВЫБРАТЬ
	//|								Задолженность.СчетРасчетов
	//|							ИЗ
	//|								Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|				,
	//|				(Организация, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто1
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ, ВЫБОР
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто2
	//|					КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|						ТОГДА Субконто3
	//|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|				КОНЕЦ) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)) КАК ХозрасчетныйОбороты
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ОстаткиПоОбъектамРасчетов.Контрагент,
	//|		ОстаткиПоОбъектамРасчетов.Договор,
	//|		ОстаткиПоОбъектамРасчетов.Счет,
	//|		ЕСТЬNULL(ОстаткиПоОбъектамРасчетов.ОбъектРасчетов, NULL),
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт1М,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт1М,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт2М,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт2М
	//|	ИЗ
	//|		ОстаткиПоОбъектамРасчетов КАК ОстаткиПоОбъектамРасчетов) КАК ХозрасчетныйОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойств
	//|		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойств.Ссылка
	//|			И (ЗначенияСвойств.Свойство = &СвойствоМероприятие)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойствСрокПогашенияЗадолженности
	//|		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойствСрокПогашенияЗадолженности.Ссылка
	//|			И (ЗначенияСвойствСрокПогашенияЗадолженности.Свойство = &СвойствоСрокПогашенияЗадолженности)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ХозрасчетныйОбороты.Счет,
	//|	ХозрасчетныйОбороты.Контрагент,
	//|	ХозрасчетныйОбороты.Договор,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов,
	//|	ЗначенияСвойств.Значение,
	//|	ЗначенияСвойствСрокПогашенияЗадолженности.Значение
	//|;
	//|";
	//
	//ПолучитьТекстПросроченногоЗапросаСЗаказамиТекстЗапроса1 = "
	//|ВЫБРАТЬ ПЕРВЫЕ 1	//0
	//|	Инвентаризация.Дата КАК Дата,
	//|	КОНЕЦПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) КАК КонецПериода,
	//|	Инвентаризация.Номер КАК Номер,
	//|	Инвентаризация.Организация КАК Организация,
	//|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	//|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	//|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	//|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	//|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	//|ПОМЕСТИТЬ Шапка
	//|ИЗ 
	//|	Документ.ИнвентаризацияРасчетов КАК Инвентаризация
	//|ГДЕ
	//|	Инвентаризация.Ссылка = &Ссылка
	//|
	//|;
	//|/////////////////////////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ //1
	//|	Задолженность.Ссылка.Организация КАК Организация,
	//|	Задолженность.ДебиторКредитор КАК Контрагент,
	//|	Задолженность.ВИЛС_Договор КАК Договор,
	//|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	//|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	//|	Задолженность.Подтверждено КАК Подтверждено,
	//|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	//|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	//|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	//|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	//|ПОМЕСТИТЬ Задолженность	
	//|ИЗ 
	//|	Документ.ИнвентаризацияРасчетов.Задолженность КАК Задолженность
	//|ГДЕ
	//|	Задолженность.Ссылка = &Ссылка
	//|	И Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности." + ?(ДтКт = "Дт", "Дебиторская", "Кредиторская") + ")
	//|;	
	//|/////////////////////////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ //2
	//|	Т.Регистратор КАК Регистратор,
	//|	Т.Организация КАК Организация,
	//|	Т.Контрагент КАК Контрагент,
	//|	Т.Договор КАК Договор,
	//|	МАКСИМУМ(Т.ЕстьУслуги) КАК ЕстьУслуги	//,
	////|	Т.РасчетныйДокумент КАК РасчетныйДокумент,
	////|   ВЫБОР 
	////|   	КОГДА Т.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	////|   		ТОГДА ЕСТЬNULL(Т.РасчетныйДокумент.ДатаВходящегоДокумента, Т.РасчетныйДокумент.Дата)
	////|   	ИНАЧЕ Т.Регистратор.Дата
	////|   КОНЕЦ КАК Период
	//|ПОМЕСТИТЬ РегистраторыСУслугами
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Т.Ссылка КАК Регистратор,
	//|		Т.Ссылка.Организация КАК Организация,
	//|		Т.Ссылка.Контрагент КАК Контрагент,
	//|		Т.Ссылка.Договор КАК Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ КАК ЕстьУслуги	//,
	//|		//Т.Ссылка КАК РасчетныйДокумент
	//|	ИЗ
	//|		Документ.ПриобретениеТоваровУслуг.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Ссылка,
	//|		Т.Ссылка.Организация,
	//|		Т.Ссылка.Контрагент,
	//|		Т.Ссылка.Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ	//,
	//|		//Т.Ссылка
	//|	ИЗ
	//|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Т.Ссылка,
	//|		Т.Ссылка.Организация,
	//|		Т.Ссылка.Контрагент,
	//|		Т.Ссылка.Договор,
	//|		ВЫБОР
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//|				ТОГДА ИСТИНА
	//|			КОГДА Т.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ	//,
	//|		//Т.Ссылка
	//|	ИЗ
	//|		Документ.ПоступлениеТоваровНаСклад.ВидыЗапасов КАК Т
	//|	ГДЕ
	//|		(Т.Ссылка.Организация, Т.Ссылка.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	//|	
	////|	ОБЪЕДИНИТЬ ВСЕ
	////|	
	////|	ВЫБРАТЬ
	////|		Т.Ссылка,
	////|		Т.Ссылка.Организация,
	////|		Т.Контрагент,
	////|		ВЫБОР КОГДА НЕ ЕСТЬNULL(Т.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|			ТОГДА 
	////|				Т.Договор
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) 	 
	////|			ТОГДА
	////|				ВЫРАЗИТЬ(Т.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов)
	////|			ИНАЧЕ	
	////|				Т.ДокументРасчетов.Договор
	////|			КОНЕЦ,	
	////|		ЛОЖЬ,
	////|		Т.ДокументРасчетов
	////|	ИЗ
	////|		Документ.ВводОстатков.РасчетыСПартнерами КАК Т
	////|	ГДЕ
	////|		(Т.Ссылка.Организация, Т.Контрагент) В (ВЫБРАТЬ Организация, Контрагент ИЗ Задолженность)
	//|	    ) КАК Т
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Т.Регистратор,
	//|	Т.Организация,
	//|	Т.Контрагент,
	//|	Т.Договор	//,
	////|	Т.РасчетныйДокумент	,
	////|   ВЫБОР 
	////|   	КОГДА Т.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	////|   		ТОГДА ЕСТЬNULL(Т.РасчетныйДокумент.ДатаВходящегоДокумента, Т.РасчетныйДокумент.Дата)
	////|   	ИНАЧЕ Т.Регистратор.Дата
	////|   КОНЕЦ
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	Контрагент,
	//|	Договор
	//|;
	//|///////////////////////////////////////////////////////////////////////////////   
	//|ВЫБРАТЬ	//3
	//|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	//|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	//|ИЗ
	//|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|			&КонПериода,
	//|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	//|			, (Организация, Субконто1, Субконто2) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|															) КАК ХозрасчетныйОстатки
	//|
	//|;
	//|///////////////////////////////////////////////////////////////////////////////   
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ	//4
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	//|	КОНЕЦ КАК Период,
	//|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL) КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ КАК РасчетныйДокумент,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|			ИНАЧЕ 0
	//|		КОНЕЦ - ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборот,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|			ИНАЧЕ 0
	//|		КОНЕЦ), 0) КАК СуммаОборотДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРегл + РасчетыСКлиентамиПоСрокам.ДолгРегл	
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОборотКт,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет
	//|ПОМЕСТИТЬ РасчетыПоСрокам
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	//|ГДЕ
	//|	(РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	//|			(ВЫБРАТЬ
	//|				Задолженность.Организация,
	//|				Задолженность.Контрагент,
	//|				Задолженность.Договор
	//|			ИЗ
	//|				Задолженность)
	//|	И ВЫБОР
	//|   		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|   			ТОГДА ИСТИНА
	//|   		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	//|   			ТОГДА ИСТИНА
	//|   		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	//|   			ТОГДА ИСТИНА
	//|			//КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			//	ТОГДА ЛОЖЬ
	//|			//КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			//	ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСКлиентамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСКлиентамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКлиентамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ - ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл + РасчетыСПоставщикамиПоСрокам.ДолгРегл
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	//|ГДЕ
	//|	(РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент, РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор) В
	//|			(ВЫБРАТЬ
	//|				Задолженность.Организация,
	//|				Задолженность.Контрагент,
	//|				Задолженность.Договор
	//|			ИЗ
	//|				Задолженность)
	//|	И ВЫБОР
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	//|				ТОГДА ИСТИНА
	//|			КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	//|				ТОГДА ИСТИНА
	//|			//КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			//	ТОГДА ЛОЖЬ
	//|			//КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			//	ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.ДатаВходящегоДокумента, РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент.Дата)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Период
	//|	КОНЕЦ,
	//|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|			ТОГДА NULL
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|			ТОГДА NULL
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов
	//|	КОНЕЦ, NULL),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	//|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО)
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	//|	КОНЕЦ
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	Контрагент,
	//|	Договор,
	//|	Счет,
	//|	РасчетныйДокумент
	//|;
	//|///////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //5
	//|	ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|	ХозрасчетныйОбороты.Договор КАК Договор,
	//|	ХозрасчетныйОбороты.ЕстьУслуги КАК ЕстьУслуги,
	//|	ХозрасчетныйОбороты.Период КАК Период,
	//|	ХозрасчетныйОбороты.Счет КАК Счет,
	//|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	//|	ХозрасчетныйОбороты.ПроверятьГалочку КАК ПроверятьГалочку,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДДС_ГФУН,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	//|ИЗ
	//|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		ХозрасчетныйОбороты.Контрагент КАК Контрагент,
	//|		ХозрасчетныйОбороты.Договор КАК Договор,
	//|		ХозрасчетныйОбороты.Период КАК Период,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	//|		ХозрасчетныйОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0) КАК СуммаОборот,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	//|		ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК СуммаОборотКт,
	//|		ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	//|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаПоставщику)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПервичныйДокумент
	//|					И ХозрасчетныйОбороты.Регистратор.ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.ОплатаОтКлиента)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	//|				ТОГДА ""Деньги""
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	//|					И ХозрасчетныйОбороты.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)
	//|				ТОГДА ""Деньги""
	//|			ИНАЧЕ ""Поставка""
	//|		КОНЕЦ КАК ПроверятьГалочку,
	//|		РегистраторыСУслугами.ЕстьУслуги КАК ЕстьУслуги,
	//|		ХозрасчетныйОбороты.СтатьяДДС_ГФУН КАК СтатьяДДС_ГФУН
	//|	ИЗ
	//|		(ВЫБРАТЬ
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто1
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто2
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто3
	//|				ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|			КОНЕЦ КАК Контрагент,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто2
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ХозрасчетныйОбороты.Субконто3
	//|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|			КОНЕЦ КАК Договор,
	//|			ЕСТЬNULL(РасчетыПоСрокам.Период, ХозрасчетныйОбороты.Период) КАК Период,
	//|			ХозрасчетныйОбороты.Счет КАК Счет,
	//|			ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	//|			ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, ХозрасчетныйОбороты.Регистратор) КАК Регистратор,
	//|			РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	//|			ВЫБОР
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Аккредитивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧековыеКнижки), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АккредитивыВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто2 КАК Справочник.СтатьиДвиженияДенежныхСредств)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК Справочник.НаправленияДеятельности)
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	//|				КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|					ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств
	//|				ИНАЧЕ NULL
	//|			КОНЕЦ КАК СтатьяДДС_ГФУН,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборот, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборот, 0)
	//|			КОНЕЦ КАК СуммаОборот,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотДт, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	//|			КОНЕЦ КАК СуммаОборотДт,
	//|			ВЫБОР
	//|				КОГДА НЕ ЕСТЬNULL(РасчетыПоСрокам.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	//|					ТОГДА ЕСТЬNULL(РасчетыПоСрокам.СуммаОборотКт, 0)
	//|				ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	//|			КОНЕЦ КАК СуммаОборотКт
	//|		ИЗ
	//|			РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|					,
	//|					&КонПериода,
	//|					Регистратор,
	//|					ВЫБОР
	//|						КОГДА Счет В
	//|								(ВЫБРАТЬ
	//|									Задолженность.СчетРасчетов
	//|								ИЗ
	//|									Задолженность)
	//|							ТОГДА ИСТИНА
	//|						КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|							ТОГДА ИСТИНА
	//|						ИНАЧЕ ЛОЖЬ
	//|					КОНЕЦ,
	//|					,
	//|					(Организация, ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА Субконто3
	//|						ИНАЧЕ NULL
	//|					КОНЕЦ, ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА Субконто3
	//|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|					КОНЕЦ) В
	//|						(ВЫБРАТЬ
	//|							Задолженность.Организация,
	//|							Задолженность.Контрагент,
	//|							Задолженность.Договор
	//|						ИЗ
	//|							Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|				ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокам КАК РасчетыПоСрокам
	//|				ПО ХозрасчетныйОбороты.Регистратор = РасчетыПоСрокам.Регистратор
	//|					И ХозрасчетныйОбороты.Организация = РасчетыПоСрокам.Организация
	//|					И ХозрасчетныйОбороты.Счет = РасчетыПоСрокам.Счет
	//|					И (ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто1
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто3
	//|						ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|					КОНЕЦ = РасчетыПоСрокам.Контрагент)
	//|					И (ВЫБОР
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто2
	//|						КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|							ТОГДА ХозрасчетныйОбороты.Субконто3
	//|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|					КОНЕЦ = РасчетыПоСрокам.Договор)) КАК ХозрасчетныйОбороты
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыСУслугами КАК РегистраторыСУслугами
	//|			ПО ХозрасчетныйОбороты.Регистратор = РегистраторыСУслугами.Регистратор
	//|				И ХозрасчетныйОбороты.Контрагент = РегистраторыСУслугами.Контрагент
	//|				И ХозрасчетныйОбороты.Договор = РегистраторыСУслугами.Договор) КАК ХозрасчетныйОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ХозрасчетныйОбороты.Контрагент,
	//|	ХозрасчетныйОбороты.Договор,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов,
	//|	ХозрасчетныйОбороты.ЕстьУслуги,
	//|	ХозрасчетныйОбороты.Регистратор,
	//|	ХозрасчетныйОбороты.Период,
	//|	ХозрасчетныйОбороты.Счет,
	//|	ХозрасчетныйОбороты.ПроверятьГалочку,
	//|	ЕСТЬNULL(ХозрасчетныйОбороты.СтатьяДДС_ГФУН, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка))
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Контрагент,
	//|	Договор,
	//|	Период,
	//|	Регистратор,
	//|	ОбъектРасчетов,
	//|	Счет,
	//|	СтатьяДДС_ГФУН
	//|ИТОГИ
	//|	СУММА(СуммаОборот)
	//|ПО
	//|	Счет
	//|;
	//|/////////////////////////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ //6
	//|	Задолженность.СчетРасчетов КАК СчетРасчетов,
	//|	Задолженность.Контрагент КАК Контрагент,
	//|	Задолженность.Договор КАК Договор,
	//|	Задолженность.ВидЗадолженности КАК ВидЗадолженности,
	//|	Задолженность.Подтверждено КАК Подтверждено,
	//|	Задолженность.НеПодтверждено КАК НеПодтверждено,
	//|	Задолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	//|	Задолженность.ВИЛС_Подтверждено1Месяц КАК ВИЛС_Подтверждено1Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено1Месяц КАК ВИЛС_НеПодтверждено1Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности1Месяц КАК ВИЛС_ИстекСрокДавности1Месяц,
	//|	Задолженность.ВИЛС_Подтверждено2Месяц КАК ВИЛС_Подтверждено2Месяц,
	//|	Задолженность.ВИЛС_НеПодтверждено2Месяц КАК ВИЛС_НеПодтверждено2Месяц,
	//|	Задолженность.ВИЛС_ИстекСрокДавности2Месяц КАК ВИЛС_ИстекСрокДавности2Месяц
	//|ИЗ 
	//|	Задолженность КАК Задолженность
	//|УПОРЯДОЧИТЬ ПО
	//|	СчетРасчетов
	//|ИТОГИ
	//|	СУММА(Подтверждено),
	//|	СУММА(НеПодтверждено),
	//|	СУММА(ВИЛС_Подтверждено1Месяц),
	//|	СУММА(ВИЛС_НеПодтверждено1Месяц),
	//|	СУММА(ВИЛС_Подтверждено2Месяц),
	//|	СУММА(ВИЛС_НеПодтверждено2Месяц)
	//|ПО
	//|	СчетРасчетов ИЕРАРХИЯ
	//|АВТОУПОРЯДОЧИВАНИЕ
	//|;
	//|////////////////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ	//7
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	//|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО) КАК ОбъектРасчетов,
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ КАК Счет,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток < 0
	//|					ТОГДА -(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток)
	//|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			КОНЕЦ), 0) КАК СуммаОстаток,
	//|	СУММА(ВЫБОР
	//|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток > 0
	//|				ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРеглОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаОстатокДт,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК СуммаОстатокКт
	//|ПОМЕСТИТЬ ОстаткиПоОбъектамРасчетов
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	//|			&КонПериода,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	//|				И ВЫБОР
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|						ТОГДА ЛОЖЬ
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|						ТОГДА ЛОЖЬ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК РасчетыСКлиентамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных
	//|		ИНАЧЕ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами
	//|	КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток < 0
	//|					ТОГДА -(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток)
	//|				ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток + РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0),
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток > 0
	//|					ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0)
	//|ИЗ
	//|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	//|			&КонПериода,
	//|			(АналитикаУчетаПоПартнерам.Организация, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Договор) В
	//|					(ВЫБРАТЬ
	//|						Задолженность.Организация,
	//|						Задолженность.Контрагент,
	//|						Задолженность.Договор
	//|					ИЗ
	//|						Задолженность)
	//|				И ВЫБОР
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыКонтрагентов
	//|						ТОГДА ЛОЖЬ
	//|					КОГДА ОбъектРасчетов ССЫЛКА Справочник.ДоговорыМеждуОрганизациями
	//|						ТОГДА ЛОЖЬ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК РасчетыСПоставщикамиПоСрокам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент,
	//|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор,
	//|	ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов, НЕОПРЕДЕЛЕНО),
	//|	ВЫБОР
	//|		КОГДА НЕ ЕСТЬNULL(РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток, 0) = 0
	//|			ТОГДА РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных
	//|		ИНАЧЕ РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками
	//|	КОНЕЦ
	//|;
	//|/////////////////////////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ //8
	//|	ХозрасчетныйОбороты.Контрагент 					КАК Контрагент,
	//|	ХозрасчетныйОбороты.Договор 					КАК Договор,
	//|	ХозрасчетныйОбороты.Счет 						КАК Счет,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов 				КАК ОбъектРасчетов,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода2МДт) 		КАК КонПериода2МДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода2МКт) 		КАК КонПериода2МКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МКт) 	КАК ОборотыПериода1МКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериода1МДт) 	КАК ОборотыПериода1МДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода1МДт) 		КАК КонПериода1МДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериода1МКт) 		КАК КонПериода1МКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериодаКт) 	КАК ОборотыПериодаКт,
	//|	СУММА(ХозрасчетныйОбороты.ОборотыПериодаДт) 	КАК ОборотыПериодаДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериодаДт)         КАК КонПериодаДт,
	//|	СУММА(ХозрасчетныйОбороты.КонПериодаКт)			КАК КонПериодаКт,
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт) 		КАК СуммаОстатокДт,	        /////////////////////////////////////////////////////////  
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт) 		КАК СуммаОстатокКт,         /////////////////////////////////////////////////////////  
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт1М) 	КАК СуммаОстатокДт1М,	    /////////////////////////////////////////////////////////  
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт1М) 	КАК СуммаОстатокКт1М,       /////////////////////////////////////////////////////////  
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокДт2М) 	КАК СуммаОстатокДт2М,	    /////////////////////////////////////////////////////////  
	//|	СУММА(ХозрасчетныйОбороты.СуммаОстатокКт2М) 	КАК СуммаОстатокКт2М,       /////////////////////////////////////////////////////////  
	//|	ЗначенияСвойств.Значение 						КАК Мероприятие,
	//|	ЗначенияСвойствСрокПогашенияЗадолженности.Значение КАК СрокПогашенияЗадолженности
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ КАК Контрагент,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ КАК Договор,
	//|		ХозрасчетныйОбороты.Счет КАК Счет, 
	//|		NULL КАК ОбъектРасчетов,
	//|		(ХозрасчетныйОбороты.СуммаОстатокДт) КАК КонПериода2МДт,
	//|		(ХозрасчетныйОбороты.СуммаОстатокКт) КАК КонПериода2МКт,
	//|		(0) КАК ОборотыПериода1МКт,
	//|		(0) КАК ОборотыПериода1МДт,
	//|		(0) КАК КонПериода1МДт,
	//|		(0) КАК КонПериода1МКт,
	//|		(0) КАК ОборотыПериодаКт,
	//|		(0) КАК ОборотыПериодаДт,
	//|		(0) КАК КонПериодаДт,
	//|		(0) КАК КонПериодаКт,
	//|		(0) КАК СуммаОстатокДт,
	//|		(0) КАК СуммаОстатокКт,
	//|		(0) КАК СуммаОстатокДт1М,
	//|		(0) КАК СуммаОстатокКт1М,
	//|		(0) КАК СуммаОстатокДт2М,
	//|		(0) КАК СуммаОстатокКт2М
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода2М,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|					) КАК ХозрасчетныйОбороты
	////|	ГДЕ
	////|		ИСТИНА = &КонПериода2МНеМеньше20181231235959
	//|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//
	////|	ВЫБРАТЬ
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ КАК ДебиторКредитор,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ КАК ВИЛС_Договор,
	////|		ХозрасчетныйОбороты.Счет КАК Счет,
	////|		СУММА(ХозрасчетныйОбороты.СуммаОстатокДт) КАК КонПериода2МДт,
	////|		СУММА(ХозрасчетныйОбороты.СуммаОстатокКт) КАК КонПериода2МКт,
	////|		СУММА(0) КАК ОборотыПериода1МКт,
	////|		СУММА(0) КАК ОборотыПериода1МДт,
	////|		СУММА(0) КАК КонПериода1МДт,
	////|		СУММА(0) КАК КонПериода1МКт,
	////|		СУММА(0) КАК ОборотыПериодаКт,
	////|		СУММА(0) КАК ОборотыПериодаДт,
	////|		СУММА(0) КАК КонПериодаДт,
	////|		СУММА(0) КАК КонПериодаКт
	////|	ИЗ
	////|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	////|				&КонПериода2018,
	////|				ВЫБОР
	////|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	////|						ТОГДА ИСТИНА
	////|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	////|						ТОГДА ИСТИНА
	////|					ИНАЧЕ ЛОЖЬ
	////|				КОНЕЦ,
	////|					, (Организация, ВЫБОР
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|								ТОГДА Субконто1
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|								ТОГДА Субконто1
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|								ТОГДА Субконто1
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|								ТОГДА Субконто2
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|								ТОГДА Субконто3
	////|							ИНАЧЕ NULL
	////|						КОНЕЦ, ВЫБОР
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|								ТОГДА Субконто2
	////|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|								ТОГДА Субконто3
	////|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, ДоговорКонтрагента ИЗ Задолженность)
	////|					) КАК ХозрасчетныйОбороты
	////|	ГДЕ
	////|		ЛОЖЬ = &КонПериода2МНеМеньше20181231235959
	////|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	////|	
	////|	ОБЪЕДИНИТЬ ВСЕ
	////|	
	//
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		NULL,
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(ХозрасчетныйОбороты.СуммаОстатокДт),
	//|		(ХозрасчетныйОбороты.СуммаОстатокКт),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода1М,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|					) КАК ХозрасчетныйОбороты
	//|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		NULL,
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(ХозрасчетныйОбороты.СуммаОборотКт),
	//|		(ХозрасчетныйОбороты.СуммаОборотДт),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачПериода,
	//|				&КонПериода,
	//|				Регистратор,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|	ГДЕ
	//|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	//|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	//|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	//|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	//|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		NULL,
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(ХозрасчетныйОбороты.СуммаОстатокДт),
	//|		(ХозрасчетныйОбороты.СуммаОстатокКт),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	//|				&КонПериода,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность)
	//|					) КАК ХозрасчетныйОбороты
	//|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто1
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто2
	//|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|				ТОГДА ХозрасчетныйОбороты.Субконто3
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|		КОНЕЦ,
	//|		ХозрасчетныйОбороты.Счет КАК Счет,
	//|		NULL,
	//|		(0),
	//|		(0),
	//|		(ХозрасчетныйОбороты.СуммаОборотКт),
	//|		(ХозрасчетныйОбороты.СуммаОборотДт),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0)
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачПериода1М,
	//|				&КонПериода1М,
	//|				Регистратор,
	//|				ВЫБОР
	//|					КОГДА Счет В (ВЫБРАТЬ СчетРасчетов ИЗ Задолженность)
	//|						ТОГДА ИСТИНА
	//|					КОГДА Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамВыданным))
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ,
	//|					, (Организация, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто1
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ NULL
	//|						КОНЕЦ, ВЫБОР
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто2
	//|							КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|								ТОГДА Субконто3
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	//|						КОНЕЦ) В (ВЫБРАТЬ Организация, Контрагент, Договор ИЗ Задолженность),
	//|					,
	//|					) КАК ХозрасчетныйОбороты
	//|	ГДЕ
	//|		НЕ(ХозрасчетныйОбороты.Счет = ХозрасчетныйОбороты.КорСчет
	//|					И ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты.КорСубконто1
	//|					И ХозрасчетныйОбороты.Субконто2 = ХозрасчетныйОбороты.КорСубконто2
	//|					И ХозрасчетныйОбороты.Субконто3 = ХозрасчетныйОбороты.КорСубконто3)
	//|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ХозрасчетныйОбороты.Счет,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Организации), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто1
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.РегистрацииВНалоговомОргане), ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Наименование
	////|		КОНЕЦ,
	////|		ВЫБОР
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто2
	////|			КОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	////|				ТОГДА ХозрасчетныйОбороты.Субконто3
	////|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	////|		КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ОстаткиПоОбъектамРасчетов.Контрагент КАК Контрагент,
	//|		ОстаткиПоОбъектамРасчетов.Договор КАК Договор,
	//|		ОстаткиПоОбъектамРасчетов.Счет КАК Счет,
	//|		ЕСТЬNULL(ОстаткиПоОбъектамРасчетов.ОбъектРасчетов, NULL) КАК ОбъектРасчетов,
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		(0),
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт КАК СуммаОстатокДт,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт КАК СуммаОстатокКт,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт КАК СуммаОстатокДт1М,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт КАК СуммаОстатокКт1М,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокДт КАК СуммаОстатокДт2М,
	//|		ОстаткиПоОбъектамРасчетов.СуммаОстатокКт КАК СуммаОстатокКт2М
	//| 	ИЗ ОстаткиПоОбъектамРасчетов
	//|
	//|
	//|									) КАК ХозрасчетныйОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойств
	//|		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойств.Ссылка
	//|			И (ЗначенияСвойств.Свойство = &СвойствоМероприятие)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ЗначенияСвойствСрокПогашенияЗадолженности
	//|		ПО ХозрасчетныйОбороты.Договор = ЗначенияСвойствСрокПогашенияЗадолженности.Ссылка
	//|			И (ЗначенияСвойствСрокПогашенияЗадолженности.Свойство = &СвойствоСрокПогашенияЗадолженности)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ХозрасчетныйОбороты.Счет,
	//|	ХозрасчетныйОбороты.Контрагент,
	//|	ХозрасчетныйОбороты.Договор,
	//|	ХозрасчетныйОбороты.ОбъектРасчетов,
	//|	ЗначенияСвойств.Значение,
	//|  	ЗначенияСвойствСрокПогашенияЗадолженности.Значение
	//|;
	////|///////////////////////////////////////////////////////////////////////////////   
	//|";
	//
