
//&Вместо("ПолучитьДанныеДляПечатнойФормыУПД")
//Функция ВИЛС_ПолучитьДанныеДляПечатнойФормыУПД(ПараметрыПечати, МассивОбъектов)
//	
//	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
//	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
//		КолонкаКодов = "Код";
//	КонецЕсли;
//	
//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	ДанныеДокументов.Ссылка                  КАК Ссылка,
//	|	ДанныеДокументов.Валюта                  КАК Валюта,
//	|	ДанныеДокументов.Организация             КАК Организация,
//	|	ДанныеДокументов.Подразделение           КАК Подразделение,
//	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад
//	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
//	|ИЗ
//	|	Документ.АктВыполненныхРабот КАК ДанныеДокументов
//	|
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка
//	|;";
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	
//	Запрос.Выполнить();
//	
//	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	ПродажиСервер.ПоместитьВременнуюТаблицуДанныхПоставщика(МенеджерВременныхТаблиц);
//	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка КАК Ссылка,
//	|	&ПредставлениеСчетФактура КАК ПредставлениеДокумента,
//	|	2 КАК СтатусУПД,
//	|	ДанныеДокумента.Номер КАК Номер,
//	|	ДанныеДокумента.Дата КАК Дата,
//	|	НЕОПРЕДЕЛЕНО КАК НомерИсправления,
//	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправления,
//	|	ЛОЖЬ КАК Исправление,
//	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактуры,
//	|	НЕОПРЕДЕЛЕНО КАК ДатаСчетаФактуры,
//	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияСчетаФактуры,
//	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияСчетаФактуры,
//	|	ЛОЖЬ КАК КорректировочныйСчетФактура,
//	|	"""" КАК СтрокаПоДокументу,
//	|	НЕОПРЕДЕЛЕНО КАК ВалютаСчетаФактуры,
//	|	ДанныеДокумента.Партнер КАК Партнер,
//	|	ВЫБОР
//	|		КОГДА ДанныеДокумента.Контрагент.ОбособленноеПодразделение
//	|			ТОГДА ДанныеДокумента.Контрагент.ГоловнойКонтрагент
//	|		ИНАЧЕ ДанныеДокумента.Контрагент
//	|	КОНЕЦ КАК Контрагент,
//	|	ДанныеДокумента.НалогообложениеНДС КАК НалогообложениеНДС,
//	|	ДанныеПоставщика.ГоловнаяОрганизация КАК Организация,
//	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
//	|	0 КАК ИндексПодразделения,
//	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
//	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
//	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
//	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
//	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
//	|	ДанныеПоставщика.КПППоставщика КАК КПППоставщика,
//	|	""""                           КАК КПППокупателя,
//	|	ДанныеДокумента.Контрагент.ИНН КАК ИННПокупателя,
//	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
//	|	ДанныеДокумента.Валюта КАК Валюта,
//	|	ДанныеДокумента.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
//	|	ДанныеДокумента.Валюта.Код КАК ВалютаКод,
//	|	ВЫРАЗИТЬ(ДанныеДокумента.ДополнительнаяИнформацияПоДоставке КАК СТРОКА(100)) КАК ДополнительнаяИнформацияПоДоставке,     // fix Suetin 01.02.2019 13:42:38
//	|	ИСТИНА КАК ТолькоУслуги,
//	|	ЛОЖЬ КАК ЭтоПередачаНаКомиссию,
//	|	ДанныеДокумента.Основание КАК Основание,
//	|	ДанныеДокумента.ОснованиеДата КАК ОснованиеДата,
//	|	ДанныеДокумента.ОснованиеНомер КАК ОснованиеНомер,
//	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
//	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
//	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
//	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЛицо,
//	|	НЕОПРЕДЕЛЕНО КАК Кладовщик,
//	|	НЕОПРЕДЕЛЕНО КАК ДолжностьКладовщика
//	|ИЗ
//	|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
//	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументов.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоставщика КАК ДанныеПоставщика
//	|		ПО ДанныеДокумента.Ссылка = ДанныеПоставщика.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
//	|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	
//	|ВЫБРАТЬ
//	|	ТаблицаТоваров.Ссылка                КАК Ссылка,
//	|	ТаблицаТоваров.НоменклатураНабора    КАК НоменклатураНабора,
//	|	ТаблицаТоваров.ХарактеристикаНабора  КАК ХарактеристикаНабора,
//	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки)  КАК НомерСтроки,
//	|	СУММА(ТаблицаТоваров.СуммаБезНДС)    КАК СуммаБезНДС,
//	|	СУММА(ТаблицаТоваров.СуммаНДС)       КАК СуммаНДС
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
//	|ИЗ
//	|	АктВыполненныхРаботТаблицаТоваров КАК ТаблицаТоваров
//	|
//	|ГДЕ
//	|	ТаблицаТоваров.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТоваров.Ссылка,
//	|	ТаблицаТоваров.НоменклатураНабора,
//	|	ТаблицаТоваров.ХарактеристикаНабора
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Ссылка                                    КАК Ссылка,
//	|	Товары.ВариантКомплектацииНоменклатуры           КАК ВариантКомплектацииНоменклатуры,
//	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
//	|	Товары.НоменклатураНабора,
//	|	Товары.ХарактеристикаНабора,
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	ВЫБОР КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
//	|		И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика ТОГДА
//	|		ИСТИНА
//	|	ИНАЧЕ
//	|		ЛОЖЬ
//	|	КОНЕЦ КАК ОсновнаяКомплектующая,
//	|	Товары.СтавкаНДС КАК СтавкаНДС,
//	|	0 КАК КоличествоПоУмолчанию,
//	|	Товары.Количество КАК Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
//	|ИЗ
//	|	АктВыполненныхРаботТаблицаТоваров КАК Товары
//	|
//	|ГДЕ
//	|	Товары.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Т.Ссылка                                                                                КАК Ссылка,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка                                           КАК ВариантКомплектацииНоменклатуры,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец                                  КАК НоменклатураНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика                            КАК ХарактеристикаНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура   КАК Номенклатура,
//	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
//	|	ЛОЖЬ КАК ОсновнаяКомплектующая,
//	|	NULL КАК СтавкаНДС,
//	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоПоУмолчанию,
//	|	0 КАК Количество
//	|ИЗ
//	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Ссылка ИЗ АктВыполненныхРаботТаблицаТоваров КАК Т) КАК Т
//	|		ПО ИСТИНА
//	|ГДЕ
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ВариантКомплектацииНоменклатуры ИЗ АктВыполненныхРаботТаблицаТоваров КАК Т)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Т.Ссылка,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
//	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
//	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
//	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Таблица.Ссылка,
//	|	Таблица.ВариантКомплектацииНоменклатуры,
//	|	Таблица.ВариантРасчетаЦеныНабора,
//	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
//	|	Таблица.НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора,
//	|	Таблица.Номенклатура,
//	|	Таблица.Характеристика,
//	|	МАКСИМУМ(Таблица.СтавкаНДС) КАК СтавкаНДС,
//	|	МАКСИМУМ(Таблица.ОсновнаяКомплектующая) КАК ОсновнаяКомплектующая,
//	|	СУММА(Таблица.КоличествоПоУмолчанию) КАК КоличествоПоУмолчанию,
//	|	СУММА(Таблица.Количество) КАК Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
//	|ИЗ
//	|	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Таблица.Ссылка,
//	|	Таблица.ВариантКомплектацииНоменклатуры,
//	|	Таблица.ВариантРасчетаЦеныНабора,
//	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
//	|	Таблица.НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора,
//	|	Таблица.Номенклатура,
//	|	Таблица.Характеристика
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Результат.Ссылка,
//	|	Результат.ВариантКомплектацииНоменклатуры,
//	|	Результат.ВариантРасчетаЦеныНабора,
//	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
//	|	Результат.НоменклатураНабора,
//	|	Результат.ХарактеристикаНабора,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА Результат.ОсновнаяКомплектующая
//	|				ТОГДА Результат.СтавкаНДС
//	|			ИНАЧЕ null
//	|		КОНЕЦ) КАК СтавкаНДС,
//	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
//	|			КОГДА Результат.КоличествоПоУмолчанию <> 0 И Результат.ОсновнаяКомплектующая
//	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
//	|			ИНАЧЕ null
//	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК Количество,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
//	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
//	|			ИНАЧЕ null
//	|		КОНЕЦ) КАК КоэффициентМаксимум,
//	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
//	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
//	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
//	|			ИНАЧЕ null
//	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК КоэффициентМинимум
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
//	|ИЗ
//	|	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
//	|СГРУППИРОВАТЬ ПО
//	|	Результат.Ссылка,
//	|	Результат.ВариантКомплектацииНоменклатуры,
//	|	Результат.ВариантРасчетаЦеныНабора,
//	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
//	|	Результат.НоменклатураНабора,
//	|	Результат.ХарактеристикаНабора
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры,
//	|	ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах,
//	|	ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора,
//	
//	|	Таблица.Ссылка                            КАК Ссылка,
//	|	Таблица.НоменклатураНабора                КАК НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора              КАК ХарактеристикаНабора,
//	|	Таблица.НомерСтроки                       КАК НомерСтроки,
//	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК КоличествоУпаковок,
//	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК Количество,
//	|	ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.КоэффициентМинимум = ВременнаяТаблицаНаборыДополнительно.КоэффициентМаксимум ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПолныйНабор,
//	|	Таблица.СуммаБезНДС                           КАК СуммаБезНДС,
//	|	Таблица.СуммаНДС                              КАК СуммаНДС,
//	|	ВременнаяТаблицаНаборыДополнительно.СтавкаНДС КАК СтавкаНДС
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборы
//	|ИЗ
//	|	ВременнаяТаблицаНаборыПодготовка КАК Таблица
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
//	|		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
//	|		И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
//	|		И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	
//	|ВЫБРАТЬ
//	|	ТаблицаДокумента.Ссылка КАК Ссылка,
//	
//	|	ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	ТаблицаДокумента.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
//	|	ТаблицаДокумента.НоменклатураНабора КАК НоменклатураНабора,
//	|	ТаблицаДокумента.ХарактеристикаНабора КАК ХарактеристикаНабора,
//	|	ТаблицаДокумента.ЭтоКомплектующие КАК ЭтоКомплектующие,
//	|	ТаблицаДокумента.ЭтоНабор КАК ЭтоНабор,
//	|	ТаблицаДокумента.ПолныйНабор КАК ПолныйНабор,
//	
//	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
//	|	ТаблицаДокумента.Содержание КАК НоменклатураНаименование,
//	|	ВЫБОР
//	|		КОГДА &КолонкаКодов = ""Артикул""
//	|			ТОГДА ТаблицаДокумента.Номенклатура.Артикул
//	|		ИНАЧЕ ТаблицаДокумента.Номенклатура.Код
//	|	КОНЕЦ КАК НоменклатураКод,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
//	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
//	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНаименование,
//	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
//	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
//	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
//	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхожденияКод,
//	|	ТаблицаДокумента.Количество КАК Количество,
//	|	ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.Количество КАК Цена,
//	|	ТаблицаДокумента.СуммаБезНДС КАК СуммаБезНДС,
//	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
//	|	ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС КАК СуммаСНДС,
//	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
//	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
//	|ИЗ
//	|(
//	|	ВЫБРАТЬ
//	|		ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах,
//	|		ТаблицаТоваров.ВариантРасчетаЦеныНабора,
//	|		ТаблицаТоваров.Ссылка,
//	|		ТаблицаТоваров.НоменклатураНабора,
//	|		ТаблицаТоваров.ХарактеристикаНабора,
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ИСТИНА
//	|		ИНАЧЕ
//	|			ЛОЖЬ
//	|		КОНЕЦ КАК ЭтоКомплектующие,
//	|		ЛОЖЬ КАК ЭтоНабор,
//	|		ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ВременнаяТаблицаНаборы.НомерСтроки
//	|		ИНАЧЕ
//	|			ТаблицаТоваров.НомерСтроки
//	|		КОНЕЦ КАК НомерСтрокиНаборы,
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ВременнаяТаблицаНаборы.ПолныйНабор
//	|		ИНАЧЕ
//	|			ЛОЖЬ
//	|		КОНЕЦ КАК ПолныйНабор,
//	|		ТаблицаТоваров.Номенклатура,
//	|		ТаблицаТоваров.Содержание,
//	|		ТаблицаТоваров.Количество,
//	|		ТаблицаТоваров.СтавкаНДС,
//	|		ТаблицаТоваров.СуммаБезНДС,
//	|		ТаблицаТоваров.СуммаНДС
//	|	ИЗ
//	|		АктВыполненныхРаботТаблицаТоваров КАК ТаблицаТоваров
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
//	|			ПО ВременнаяТаблицаНаборы.НоменклатураНабора = ТаблицаТоваров.НоменклатураНабора
//	|			 И ВременнаяТаблицаНаборы.ХарактеристикаНабора = ТаблицаТоваров.ХарактеристикаНабора
//	|			 И ВременнаяТаблицаНаборы.Ссылка = ТаблицаТоваров.Ссылка
//	|
//	|	ГДЕ
//	|		ТаблицаТоваров.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|		ИЛИ (ТаблицаТоваров.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|	        И ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие),
//	|	                                                                ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)))
//	|
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|	ВЫБРАТЬ
//	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах,
//	|		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
//	|		ВременнаяТаблицаНаборы.Ссылка,
//	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
//	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
//	|		ЛОЖЬ КАК ЭтоКомплектующие,
//	|		ИСТИНА КАК ЭтоНабор,
//	|		0 КАК НомерСтроки,
//	|		ВременнаяТаблицаНаборы.НомерСтроки КАК НомерСтрокиНаборы,
//	|		ВременнаяТаблицаНаборы.ПолныйНабор КАК ПолныйНабор,
//	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
//	|		ВременнаяТаблицаНаборы.НоменклатураНабора.НаименованиеПолное,
//	|		ВременнаяТаблицаНаборы.Количество,
//	|		ВременнаяТаблицаНаборы.СтавкаНДС,
//	|		ВременнаяТаблицаНаборы.СуммаБезНДС,
//	|		ВременнаяТаблицаНаборы.СуммаНДС
//	|	ИЗ
//	|		ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
//	|	ГДЕ
//	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор),
//	|	                                                           ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))
//	|) КАК ТаблицаДокумента
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	НомерСтроки,
//	|	ЭтоНабор УБЫВ
//	|ИТОГИ ПО
//	|	Ссылка";
//	Запрос.УстановитьПараметр("ПредставлениеСчетФактура", НСтр("ru='счет-фактура'"));
//	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
//	
//	МассивРезультатов         = Запрос.ВыполнитьПакет();
//	РезультатПоШапке          = МассивРезультатов[0];
//	РезультатПоТабличнойЧасти = МассивРезультатов[6];
//	
//	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
//	                                               РезультатПоШапке, РезультатПоТабличнойЧасти);
//	
//	Возврат СтруктураДанныхДляПечати;
//	
//КонецФункции

&Вместо("ТекстЗапросаДанныхОснованияДляПечатнойФормыСчетФактура")
Функция ВИЛС_ТекстЗапросаДанныхОснованияДляПечатнойФормыСчетФактура()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка                                   КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ДанныеДокументов.Валюта                                   КАК Валюта,
	|	ДанныеДокументов.Организация                              КАК Организация,
	|	ДанныеДокументов.НалогообложениеНДС                       КАК НалогообложениеНДС,
	|	ДанныеДокументов.Подразделение                            КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                  КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)             КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)             КАК Грузополучатель,
	|	ЛОЖЬ                                                      КАК РасчетыЧерезОтдельногоКонтрагента,
	|	НЕОПРЕДЕЛЕНО                                              КАК Номенклатура,
	|	""""                                                      КАК Содержание,
	|	ВЫРАЗИТЬ(ДанныеДокументов.ДополнительнаяИнформацияПоДоставке КАК СТРОКА(100)) КАК ДополнительнаяИнформацияПоДоставке,     // fix Suetin 01.02.2019 13:42:38
	|	ДанныеДокументов.Договор                                  КАК Договор,                                                    // fix Suetin 05.02.2019 2:13:56
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)             КАК Комиссионер,
	|	ДанныеДокументов.Основание                                КАК Основание,
	|	ДанныеДокументов.ОснованиеДата                            КАК ОснованиеДата,
	|	ДанныеДокументов.ОснованиеНомер                           КАК ОснованиеНомер,
	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьЛицо,
	|	НЕОПРЕДЕЛЕНО                                              КАК Кладовщик,
	|	НЕОПРЕДЕЛЕНО                                              КАК ДолжностьКладовщика
	|
	|//ОператорПОМЕСТИТЬ
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&ДокументОснование_АктВыполненныхРабот)";
	
	Возврат ТекстЗапроса;
	
КонецФункции
