
&Вместо("ОбработкаЗаполнения")
Процедура ВИЛС_ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Для Каждого Основание Из ДанныеЗаполнения Цикл
			Если ОбщегоНазначения.ЭтоДокумент(Основание.Метаданные()) Тогда
				НоваяСтрока = ДокументПоручение.Основания.Добавить();
				НоваяСтрока.Основание = Основание;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если ОбщегоНазначения.ЭтоДокумент(ДанныеЗаполнения.Метаданные()) Тогда
			НоваяСтрока = ДокументПоручение.Основания.Добавить();
			НоваяСтрока.Основание = ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
	Статус = 
	Комментарий = 
	Ответственный = Пользователи.ТекущийПользователь();
	ДатаВремяРейсаПланС = ДанныеЗаполнения.ДатаПервогоПоступления;
	ДатаВремяРейсаПланПо = ДанныеЗаполнения.ДатаПоступления;
	//ТранспортноеСредство = 
	//КурьерЭкспедитор =
	//Водитель				=
	Склад					= ДанныеЗаполнения.Склад;
	
	
	
	ДокументПоручение = Документы.ПоручениеЭкспедитору.СоздатьДокумент();
	ДокументПоручениеСсылка = ДокументПоручение.ПолучитьСсылкуНового();
	
	
	
	Если ДокументПоручение.Основания.Количество() > 0 Тогда
		
		ДанныеОснований = Документы.ПоручениеЭкспедитору.ДанныеОснований(ДокументПоручение.Основания.ВыгрузитьКолонку("Основание"));
		
		Если ДанныеОснований.Пункты.Количество() > 0 Тогда
			ДокументПоручение.Пункт = ДанныеОснований.Пункты[0];
		КонецЕсли;
		Если ДанныеОснований.Склады.Количество() > 0 Тогда
			ДокументПоручение.Склад = ДанныеОснований.Склады[0];
		Иначе
			ДокументПоручение.Склад = Справочники.Склады.СкладПоУмолчанию();
		КонецЕсли;
		Если ДанныеОснований.Контакты.Количество() > 0 Тогда
			ДокументПоручение.КонтактноеЛицо = ДанныеОснований.Контакты[0];
		КонецЕсли;
		Если ДанныеОснований.СпособыДоставки.Количество() = 1 Тогда
			ДокументПоручение.СпособДоставки = ДанныеОснований.СпособыДоставки[0];
		КонецЕсли;
		
		Возврат;
	ИначеЕсли ДанныеЗаполнения.Количество() = 1 Тогда
		ДанныеЗаполнения = ДанныеЗаполнения[0];
	Иначе
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ЭтоГруппа") Тогда
			ВызватьИсключение НСтр("ru = 'Не предусмотрен ввод поручения экспедитору на основании группы складов.';
									|en = 'Entry of instruction for the shipping agent based on the warehouse group is not available.'");
		Иначе
			ДокументПоручение.Пункт = ДанныеЗаполнения;
			ДокументПоручение.Склад = ДанныеЗаполнения;
			ДокументПоручение.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Партнеры")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		ДокументПоручение.Пункт = ДанныеЗаполнения;
		ДокументПоручение.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументПоручение.Пункт)
		И Не ЗначениеЗаполнено(ДокументПоручение.КонтактноеЛицо)
		И ТипЗнч(ДокументПоручение.Пункт) = Тип("СправочникСсылка.Партнеры") Тогда
		ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(ДокументПоручение.Пункт, ДокументПоручение.КонтактноеЛицо);
	КонецЕсли;
КонецПроцедуры
