
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавляемыйЭлемент = Элементы.Вставить("Руководитель", Тип("ПолеФормы"), Элементы.ГруппаПараметрыЛево);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.Руководитель";
	ДобавляемыйЭлемент.КнопкаВыбора				= Ложь;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Истина;
	ДобавляемыйЭлемент.Заголовок				= "Руководитель";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 30;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	
	ДобавляемыйЭлемент = Элементы.Вставить("ГлавныйБухгалтер", Тип("ПолеФормы"), Элементы.ГруппаПараметрыЛево);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ГлавныйБухгалтер";
	ДобавляемыйЭлемент.КнопкаВыбора				= Ложь;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Истина;
	ДобавляемыйЭлемент.Заголовок				= "Главный бухгалтер";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 30;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
КонецПроцедуры
