#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
&Вместо("ЗаполнитьСтоимостьТрудозатрат")
Процедура ВИЛС_ЗаполнитьСтоимостьТрудозатрат(Калькуляция, МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
|	ПлановыеТрудозатраты.ВидРабот КАК ВидРабот,
|	ПлановыеТрудозатраты.Период КАК Период
|ПОМЕСТИТЬ ВидыРабот
|ИЗ
|	РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
|ГДЕ
|	ПлановыеТрудозатраты.Калькуляция = &Калькуляция
|
|СГРУППИРОВАТЬ ПО
|	ПлановыеТрудозатраты.Период,
|	ПлановыеТрудозатраты.ВидРабот
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВидыРабот.ВидРабот КАК ВидРабот,
|	ВидыРабот.Период КАК Период,
|	МАКСИМУМ(РасценкиРаботСотрудников.Период) КАК ПериодРасценки
|ПОМЕСТИТЬ ДатыРасценок
|ИЗ
|	ВидыРабот КАК ВидыРабот
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиРаботСотрудников КАК РасценкиРаботСотрудников
|		ПО (РасценкиРаботСотрудников.ВидРабот = ВидыРабот.ВидРабот)
|			И (РасценкиРаботСотрудников.Период <= ВидыРабот.Период)
|
|СГРУППИРОВАТЬ ПО
|	ВидыРабот.ВидРабот,
|	ВидыРабот.Период
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ДатыРасценок.ВидРабот КАК ВидРабот,
|	ДатыРасценок.Период КАК Период,
|	ЕСТЬNULL(РасценкиРаботСотрудников.Расценка, 0) КАК Расценка
|ПОМЕСТИТЬ Расценки
|ИЗ
|	ДатыРасценок КАК ДатыРасценок
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиРаботСотрудников КАК РасценкиРаботСотрудников
|		ПО ДатыРасценок.ВидРабот = РасценкиРаботСотрудников.ВидРабот
|			И ДатыРасценок.ПериодРасценки = РасценкиРаботСотрудников.Период
|
|ИНДЕКСИРОВАТЬ ПО
|	ВидРабот,
|	Период
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПлановыеТрудозатраты.Калькуляция КАК Калькуляция,
|	ПлановыеТрудозатраты.ПартияСпецификация КАК ПартияСпецификация,
|	ПлановыеТрудозатраты.Подразделение КАК Подразделение,
|	ПлановыеТрудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
|	ПлановыеТрудозатраты.ВидРабот КАК ВидРабот,
|	ПлановыеТрудозатраты.Период КАК Период,
|	ПлановыеТрудозатраты.Количество КАК Количество,
|	ПлановыеТрудозатраты.Количество * Расценки.Расценка * ВЫБОР
|		КОГДА КурсыВалютРасценок.Валюта = КурсыВалютУУ.Валюта
|			ТОГДА 1
|		ИНАЧЕ ВЫБОР
|				КОГДА КурсыВалютРасценок.Кратность * КурсыВалютУУ.Курс = 0
|					ТОГДА 1
|				ИНАЧЕ КурсыВалютРасценок.Курс * КурсыВалютУУ.Кратность / (КурсыВалютРасценок.Кратность * КурсыВалютУУ.Курс)
|			КОНЕЦ
|	КОНЕЦ КАК Стоимость,
|	ПлановыеТрудозатраты.ПериодЗатрат КАК ПериодЗатрат,
|	ПлановыеТрудозатраты.Количество * Расценки.Расценка * ВЫБОР
|		КОГДА КурсыВалютРасценок.Валюта = КурсыВалютБУ.Валюта
|			ТОГДА 1
|		ИНАЧЕ ВЫБОР
|				КОГДА КурсыВалютРасценок.Кратность * КурсыВалютБУ.Курс = 0
|					ТОГДА 1
|				ИНАЧЕ КурсыВалютРасценок.Курс * КурсыВалютБУ.Кратность / (КурсыВалютРасценок.Кратность * КурсыВалютБУ.Курс)
|			КОНЕЦ
|	КОНЕЦ КАК СтоимостьРегл
|ПОМЕСТИТЬ ПлановыеТрудозатратыБезСтраховыхВзносов
|ИЗ
|	РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
|		ЛЕВОЕ СОЕДИНЕНИЕ Расценки КАК Расценки
|		ПО (Расценки.ВидРабот = ПлановыеТрудозатраты.ВидРабот)
|			И (Расценки.Период = ПлановыеТрудозатраты.Период)
|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютРасценок
|		ПО (КурсыВалютРасценок.ВидВалюты = ""ВалютаРасценокВидовРабот"")
|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютУУ
|		ПО (КурсыВалютУУ.ВидВалюты = ""ВалютаУпрУчета"")
|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютБУ
|		ПО (КурсыВалютБУ.ВидВалюты = ""ВалютаРеглУчета"")
|ГДЕ
|	ПлановыеТрудозатраты.Калькуляция = &Калькуляция
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВложенныйЗапрос.ГодЗатрат КАК ГодЗатрат,
|	ВложенныйЗапрос.Организация КАК Организация
|ПОМЕСТИТЬ ПериодыЗатратПоОрганизации
|ИЗ
|	(ВЫБРАТЬ
|		НАЧАЛОПЕРИОДА(ПлановыеТрудозатраты.ПериодЗатрат, ГОД) КАК ГодЗатрат,
|		ПлановыеТрудозатраты.Калькуляция.Организация КАК Организация
|	ИЗ
|		ПлановыеТрудозатратыБезСтраховыхВзносов КАК ПлановыеТрудозатраты
|	
|	СГРУППИРОВАТЬ ПО
|		НАЧАЛОПЕРИОДА(ПлановыеТрудозатраты.ПериодЗатрат, ГОД),
|		ПлановыеТрудозатраты.Калькуляция.Организация) КАК ВложенныйЗапрос
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РасчетСтраховыхВзносов.Калькуляция КАК Калькуляция,
|	РасчетСтраховыхВзносов.ПартияСпецификация КАК ПартияСпецификация,
|	РасчетСтраховыхВзносов.Подразделение КАК Подразделение,
|	РасчетСтраховыхВзносов.СтатьяКалькуляции КАК СтатьяКалькуляции,
|	РасчетСтраховыхВзносов.ВидРабот КАК ВидРабот,
|	РасчетСтраховыхВзносов.Период КАК Период,
|	СУММА(РасчетСтраховыхВзносов.Стоимость) КАК Стоимость,
|	РасчетСтраховыхВзносов.ПериодЗатрат КАК ПериодЗатрат,
|	СУММА(РасчетСтраховыхВзносов.Количество) КАК Количество,
|	СУММА(РасчетСтраховыхВзносов.СтоимостьРегл) КАК СтоимостьРегл
|ПОМЕСТИТЬ ПлановыеТрудозатраты
|ИЗ
|	(ВЫБРАТЬ
|		ПлановыеТрудозатратыБезСтраховыхВзносов.Калькуляция КАК Калькуляция,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.ПартияСпецификация КАК ПартияСпецификация,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.Подразделение КАК Подразделение,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.СтатьяКалькуляции КАК СтатьяКалькуляции,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.ВидРабот КАК ВидРабот,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.Период КАК Период,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.Стоимость КАК Стоимость,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.ПериодЗатрат КАК ПериодЗатрат,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.Количество КАК Количество,
|		ПлановыеТрудозатратыБезСтраховыхВзносов.СтоимостьРегл КАК СтоимостьРегл
|	ИЗ
|		ПлановыеТрудозатратыБезСтраховыхВзносов КАК ПлановыеТрудозатратыБезСтраховыхВзносов) КАК РасчетСтраховыхВзносов
|
|СГРУППИРОВАТЬ ПО
|	РасчетСтраховыхВзносов.Период,
|	РасчетСтраховыхВзносов.Подразделение,
|	РасчетСтраховыхВзносов.Калькуляция,
|	РасчетСтраховыхВзносов.ВидРабот,
|	РасчетСтраховыхВзносов.СтатьяКалькуляции,
|	РасчетСтраховыхВзносов.ПериодЗатрат,
|	РасчетСтраховыхВзносов.ПартияСпецификация
|
|ИМЕЮЩИЕ
|	СУММА(РасчетСтраховыхВзносов.Количество) > 0
|
|ИНДЕКСИРОВАТЬ ПО
|	Калькуляция,
|	ПартияСпецификация
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ВидыРабот
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ДатыРасценок
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ Расценки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ПлановыеТрудозатратыБезСтраховыхВзносов
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ПериодыЗатратПоОрганизации";
		
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

	
#КонецЕсли