
&ИзменениеИКонтроль("ПередКомпоновкойМакета")
Процедура ВИЛС_ПередКомпоновкойМакета(Отказ)

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КлючВариантаОтчета"));
	Если ЗначениеПараметра <> Неопределено Тогда
		КлючВариантаОтчета = ЗначениеПараметра.Значение;
		Если НЕ ЗначениеЗаполнено(КлючВариантаОтчета) Тогда
			КлючВариантаОтчета = "СправкаРасчетРезервыОтпусков";
		КонецЕсли;
	Иначе
		КлючВариантаОтчета = "СправкаРасчетРезервыОтпусков";
	КонецЕсли;

	СправкаРасчет  = Ложь;
	ОстаткиОбороты = Ложь;
	ПоСотрудникам  = Ложь;
	Если КлючВариантаОтчета = "ОстаткиОборотыРезервовОтпусков" Тогда
		ОстаткиОбороты = Истина;
	ИначеЕсли КлючВариантаОтчета = "СправкаРасчетРезервыОтпусков" Тогда
		СправкаРасчет = Истина;
	ИначеЕсли КлючВариантаОтчета = "РезервыОтпусковПоСотрудникам" Тогда
		ПоСотрудникам = Истина;
	КонецЕсли;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Организация = ЗначениеПараметра.Значение;

	ПоказательНУ = Ложь;
	ПоказательБУ = Истина;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Показатель"));
	Если ЗначениеПараметра.Значение = Истина Тогда
		ПоказательНУ = Истина;
		ПоказательБУ = Ложь;
	КонецЕсли;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));

	НачалоПериода = ЗначениеПараметра.Значение.ДатаНачала;
	КонецПериода  = ЗначениеПараметра.Значение.ДатаОкончания;

	НастройкиРезервовОтпусков = РезервОтпусков.НастройкиРезервовОтпусков(Организация, КонецПериода);
	МетодНачисленияРезерваОтпусков = НастройкиРезервовОтпусков.МетодНачисленияРезерваОтпусков;
	НормативныйМетод  = МетодНачисленияРезерваОтпусков = Перечисления.МетодыНачисленияРезервовОтпусков.НормативныйМетод;
	МетодОбязательств = МетодНачисленияРезерваОтпусков = Перечисления.МетодыНачисленияРезервовОтпусков.МетодОбязательств;
	ФормироватьРезервОтпусковБУ = НастройкиРезервовОтпусков.ФормироватьРезервОтпусковБУ;
	ФормироватьРезервОтпусковНУ = НастройкиРезервовОтпусков.ФормироватьРезервОтпусковНУ;

	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		Если СправкаРасчет Тогда
			Если НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода) 
				ИЛИ НачалоМесяца(НачалоПериода) <> НачалоПериода
				ИЛИ КонецМесяца(КонецПериода) <> КонецПериода Тогда
				ТекстОшибки = НСтр("ru = 'В качестве периода следует указать целый месяц';
				|en = 'Specify the whole month as a period'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ФормироватьРезервОтпусковБУ
		И ПоказательБУ Тогда
		ТекстОшибки = НСтр("ru = 'В бухгалтерском учете оценочные обязательства не начисляются';
		|en = 'Estimated liabilities are not accrued in bookkeeping'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		Возврат;
	КонецЕсли;

	Если НЕ ФормироватьРезервОтпусковНУ
		И ПоказательНУ Тогда
		ТекстОшибки = НСтр("ru = 'В налоговом учете резервы не формируются';
		|en = 'Reserves are not generated in tax accounting'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		Возврат;
	КонецЕсли;

	Инвентаризация = КонецДня(КонецПериода) = КонецГода(КонецПериода);

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ЗначениеПараметра.Значение = НачалоПериода;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ЗначениеПараметра.Значение = КонецПериода;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериодаОстатков"));
	ЗначениеПараметра.Значение = Макс(КонецДня(НачалоПериода-1), НачалоГода(НачалоПериода));
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериодаОстатков"));
	ЗначениеПараметра.Значение = НачалоГода(НачалоПериода);
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Инвентаризация"));
	ЗначениеПараметра.Значение = Инвентаризация; 
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИгнорироватьОборот"));
	ЗначениеПараметра.Значение = НачалоГода(НачалоПериода) = НачалоДня(Макс(КонецДня(НачалоПериода-1), НачалоГода(НачалоПериода)));
	ЗначениеПараметра.Использование = Истина;

	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);

	Таблица = НайтиПоИмени(КомпоновщикНастроек.Настройки.Структура,"РезервыОтпусков");

	МассивНазванийГруппировок = Новый Массив;
	Если ОстаткиОбороты Тогда
		МассивНазванийГруппировок.Добавить("ГруппировкаТипОценочногоОбязательства");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
			МассивНазванийГруппировок.Добавить("ГруппировкаСтатьяФинансирования");
		КонецЕсли;
	ИначеЕсли ПоСотрудникам Тогда
		МассивНазванийГруппировок.Добавить("ГруппировкаСотрудник");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
			МассивНазванийГруппировок.Добавить("ГруппировкаСтатьяФинансированияСотрудник");
		КонецЕсли;
	Иначе
		МассивНазванийГруппировок.Добавить("ГруппировкаФизическоеЛицо");
	КонецЕсли;

	МассивГруппировок = Новый Массив;

	Если ПоказательНУ Тогда
		Показатель = "НУ";
		Если ОстаткиОбороты Тогда
			СуффиксГруппировки = "ОстаткиОбороты";
		ИначеЕсли ПоСотрудникам Тогда
			СуффиксГруппировки = "";
		Иначе
			Если Инвентаризация Тогда
				СуффиксГруппировки = "МО";
			Иначе
				СуффиксГруппировки = "";
			КонецЕсли;
		КонецЕсли;

	Иначе
		Показатель = "БУ";
		Если ОстаткиОбороты Тогда
			СуффиксГруппировки = "ОстаткиОбороты";
		ИначеЕсли ПоСотрудникам Тогда
			СуффиксГруппировки = "";
		Иначе
			Если Инвентаризация
				ИЛИ МетодОбязательств Тогда
				СуффиксГруппировки = "МО";
			Иначе
				СуффиксГруппировки = "";
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Для Каждого ИмяГруппировки Из МассивНазванийГруппировок Цикл
		ИсходнаяГруппировка     = НайтиПоИмени(Таблица.Строки,ИмяГруппировки);
		ИмяГруппировки          = ИмяГруппировки + Показатель + СуффиксГруппировки;
		ИсходнаяГруппировка.Имя = ИмяГруппировки;
		МассивГруппировок.Добавить(ИсходнаяГруппировка);
	КонецЦикла;

	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(Показатель);

	Для Каждого Группировка Из МассивГруппировок Цикл
		Группировка.Использование = Истина;
	КонецЦикла;

	МассивПоказателейРасчета = Новый Массив;

	Если СправкаРасчет Тогда
		Если Инвентаризация
			ИЛИ (ПоказательБУ И МетодОбязательств) Тогда
			МассивПоказателейРасчета.Добавить("ОстатокОтпуска");
			МассивПоказателейРасчета.Добавить("ОтпускАвансом");
			МассивПоказателейРасчета.Добавить("ОстатокОтпускаРасчетный");
			МассивПоказателейРасчета.Добавить("СреднийЗаработок");
			МассивПоказателейРасчета.Добавить("ТекущаяСтавкаСтраховыхВзносов");
			МассивПоказателейРасчета.Добавить("ТекущаяСтавкаФССНесчастныеСлучаи");
		Иначе
			МассивПоказателейРасчета.Добавить("ФОТ");
			МассивПоказателейРасчета.Добавить("СтраховыеВзносы");
			МассивПоказателейРасчета.Добавить("ФССНесчастныеСлучаи");
			МассивПоказателейРасчета.Добавить("НормативОтчисленийВРезервОтпусков");
		КонецЕсли;

		МассивПоказателейРасчета.Добавить("СуммаРезерваИсчислено" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносовИсчислено" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаиИсчислено" + Показатель);

		Если (ПоказательНУ И Инвентаризация)
			ИЛИ
			(ПоказательБУ И (Инвентаризация ИЛИ МетодОбязательств)) Тогда

			МассивПоказателейРасчета.Добавить("СуммаРезерваНакоплено" + Показатель);
			МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносовНакоплено" + Показатель);
			МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаиНакоплено" + Показатель);
		КонецЕсли;

		МассивПоказателейРасчета.Добавить("СуммаРезерва" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносов" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаи" + Показатель);

	ИначеЕсли ОстаткиОбороты Тогда

		МассивПоказателейРасчета.Добавить("НачальныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("Расход" + Показатель);
		МассивПоказателейРасчета.Добавить("Приход" + Показатель);
		МассивПоказателейРасчета.Добавить("КонечныйОстаток" + Показатель);

	ИначеЕсли ПоСотрудникам Тогда

		// Остатки на начало
		МассивПоказателейРасчета.Добавить("СуммаРезерваНачальныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносовНачальныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаиНачальныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваНачальныйОстатокВсего" + Показатель);

		// Выбыло
		МассивПоказателейРасчета.Добавить("СуммаРезерваРасход" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносовРасход" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаиРасход" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваРасходВсего" + Показатель);

		// Начислено
		МассивПоказателейРасчета.Добавить("СуммаРезерваПриход" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносовПриход" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаиПриход" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваПриходВсего" + Показатель);

		// Остатки на конец
		МассивПоказателейРасчета.Добавить("СуммаРезерваКонечныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваСтраховыхВзносовКонечныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваФССНесчастныеСлучаиКонечныйОстаток" + Показатель);
		МассивПоказателейРасчета.Добавить("СуммаРезерваКонечныйОстатокВсего" + Показатель);

	КонецЕсли;

	Номер = 0;

	Для Каждого Группировка Из МассивГруппировок Цикл
		Группа = Группировка.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		Группа.Расположение = РасположениеПоляКомпоновкиДанных.ОтдельнаяКолонка;
		ОтчетыСервер.ДобавитьВыбранноеПоле(Группа, СтрЗаменить(МассивНазванийГруппировок[Номер], "Группировка", ""));

		Для Каждого ИмяПоказателя Из МассивПоказателейРасчета Цикл
			Группа = Группировка.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			Группа.Расположение = РасположениеПоляКомпоновкиДанных.ОтдельнаяКолонка;
			ОтчетыСервер.ДобавитьВыбранноеПоле(Группа, ИмяПоказателя);
		КонецЦикла;

		Номер = Номер + 1;

	КонецЦикла;

#Удаление
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

#КонецУдаления
#Вставка
	СхемаКомпоновкиДанных = ПолучитьМакет("НоваяСхемаКомпоновкиДанных");

#КонецВставки
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных)));

КонецПроцедуры

//&Перед("ПередЗагрузкойНастроекВКомпоновщик")
//Процедура ВИЛС_ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД)
//	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = "
//	|ВЫБРАТЬ
//	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация КАК Организация,
//	|	ИСТИНА КАК ПоддержкаПБУ18
//	|ПОМЕСТИТЬ ВТ_УчетнаяПолитика
//	|ИЗ
//	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&КонецПериода, Организация = &Организация {(Организация = &Организация)}) КАК УчетнаяПолитикаОрганизацийСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	НастройкиРасчетаРезервовОтпусковСрезПоследних.Организация КАК Организация,
//	|	НастройкиРасчетаРезервовОтпусковСрезПоследних.НормативОтчисленийВРезервОтпусков КАК НормативОтчисленийВРезервОтпусков,
//	|	НастройкиРасчетаРезервовОтпусковСрезПоследних.ПредельнаяВеличинаОтчисленийВРезервОтпусков КАК ПредельнаяВеличинаОтчисленийВРезервОтпусков
//	|ПОМЕСТИТЬ ВТ_НастройкиРасчетаРезервовОтпусков
//	|ИЗ
//	|	РегистрСведений.НастройкиРасчетаРезервовОтпусков.СрезПоследних(&КонецПериода, Организация = &Организация {(Организация = &Организация)}) КАК НастройкиРасчетаРезервовОтпусковСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(ВТ_НастройкиРасчетаРезервовОтпусков.Организация, ВТ_УчетнаяПолитика.Организация) КАК Организация,
//	|	ЕСТЬNULL(ВТ_УчетнаяПолитика.ПоддержкаПБУ18, ИСТИНА) КАК ПоддержкаПБУ18,
//	|	ВТ_НастройкиРасчетаРезервовОтпусков.НормативОтчисленийВРезервОтпусков КАК НормативОтчисленийВРезервОтпусков,
//	|	ВТ_НастройкиРасчетаРезервовОтпусков.ПредельнаяВеличинаОтчисленийВРезервОтпусков КАК ПредельнаяВеличинаОтчисленийВРезервОтпусков
//	|ПОМЕСТИТЬ УчетнаяПолитика
//	|ИЗ
//	|	ВТ_НастройкиРасчетаРезервовОтпусков КАК ВТ_НастройкиРасчетаРезервовОтпусков
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетнаяПолитика КАК ВТ_УчетнаяПолитика
//	|		ПО ВТ_НастройкиРасчетаРезервовОтпусков.Организация = ВТ_УчетнаяПолитика.Организация
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ОценочныеОбязательстваОстаткиИОбороты.Организация КАК Организация,
//	|	ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ВЫБОР
//	|		КОГДА &ИгнорироватьОборот
//	|			ТОГДА 0
//	|		ИНАЧЕ ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
//	|	КОНЕЦ КАК НакопленноеОбязательство,
//	|	ОценочныеОбязательстваОстаткиИОбороты.СуммаНУНачальныйОстаток + ВЫБОР
//	|		КОГДА &ИгнорироватьОборот
//	|			ТОГДА 0
//	|		ИНАЧЕ ОценочныеОбязательстваОстаткиИОбороты.СуммаНУПриход
//	|	КОНЕЦ КАК НакопленныйРезерв
//	|ПОМЕСТИТЬ НакопленныеРезервы
//	|ИЗ
//	|	РегистрНакопления.ОценочныеОбязательства.ОстаткиИОбороты(&НачалоПериодаОстатков, &КонецПериодаОстатков, Период, , Организация = &Организация {(Организация = &Организация)}) КАК ОценочныеОбязательстваОстаткиИОбороты
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА &КлючВариантаОтчета = ""АнализПоСотрудникам""
//	|				ТОГДА ЛОЖЬ
//	|			ИНАЧЕ ИСТИНА
//	|		КОНЕЦ
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ОценочныеОбязательстваОстаткиИОбороты.Организация,
//	|	ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход,
//	|	ОценочныеОбязательстваОстаткиИОбороты.СуммаНУПриход
//	|ИЗ
//	|	РегистрНакопления.ОценочныеОбязательства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Организация = &Организация {(Организация = &Организация)}) КАК ОценочныеОбязательстваОстаткиИОбороты
//	|ГДЕ
//	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОценочныеОбязательстваОстаткиИОбороты.Регистратор КАК Документ.НачислениеОценочныхОбязательствПоОтпускам).КорректировкаОбязательств, ЛОЖЬ)
//	|	И ВЫБОР
//	|			КОГДА &КлючВариантаОтчета = ""АнализПоСотрудникам""
//	|				ТОГДА ЛОЖЬ
//	|			ИНАЧЕ ИСТИНА
//	|		КОНЕЦ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СостоянияСотрудников.Сотрудник.ГоловнаяОрганизация КАК Организация,
//	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
//	|	СостоянияСотрудников.Состояние КАК Состояние
//	|ПОМЕСТИТЬ вт_СостоянияСотрудников
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		СостоянияСотрудников.Сотрудник КАК Сотрудник,
//	|		МАКСИМУМ(СостоянияСотрудников.Период) КАК Период
//	|	ИЗ
//	|		РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
//	|	ГДЕ
//	|		СостоянияСотрудников.Период <= &КонецПериода
//	|		И (СостоянияСотрудников.ДействуетДо >= &НачалоПериодаОстатков
//	|				ИЛИ СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1))
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		СостоянияСотрудников.Сотрудник) КАК ВложенныйЗапрос
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
//	|		ПО ВложенныйЗапрос.Сотрудник = СостоянияСотрудников.Сотрудник
//	|			И ВложенныйЗапрос.Период = СостоянияСотрудников.Период
//	|{ГДЕ
//	|	ВложенныйЗапрос.Сотрудник.*,
//	|	СостоянияСотрудников.Состояние.* КАК СостояниеСотрудника}
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Сотрудник
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасчетРезерваОтпусков.Организация КАК Организация,
//	|	РасчетРезерваОтпусков.ПериодРасчета КАК Период,
//	|	РасчетРезерваОтпусков.Сотрудник КАК ФизическоеЛицо,
//	|	РасчетРезерваОтпусков.Сотрудник.Наименование КАК ФизическоеЛицоНаименование,
//	|	РасчетРезерваОтпусков.ФОТ КАК ФОТ,
//	|	РасчетРезерваОтпусков.СтраховыеВзносы КАК СтраховыеВзносы,
//	|	РасчетРезерваОтпусков.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
//	|	РасчетРезерваОтпусков.СуммаРезерва КАК СуммаРезерваБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносовБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаи КАК СуммаРезерваФССНесчастныеСлучаиБУ,
//	|	РасчетРезерваОтпусков.ОстатокОтпуска КАК ОстатокОтпуска,
//	|	РасчетРезерваОтпусков.ОтпускАвансом КАК ОтпускАвансом,
//	|	ВЫБОР
//	|		КОГДА РасчетРезерваОтпусков.ОстатокОтпуска - РасчетРезерваОтпусков.ОтпускАвансом > 0
//	|			ТОГДА РасчетРезерваОтпусков.ОстатокОтпуска - РасчетРезерваОтпусков.ОтпускАвансом
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК ОстатокОтпускаРасчетный,
//	|	РасчетРезерваОтпусков.СреднийЗаработок КАК СреднийЗаработок,
//	|	РасчетРезерваОтпусков.СуммаРезерваНУ КАК СуммаРезерваНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНУ КАК СуммаРезерваСтраховыхВзносовНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНУ КАК СуммаРезерваФССНесчастныеСлучаиНУ,
//	|	ВЫБОР
//	|		КОГДА УчетнаяПолитика.ПоддержкаПБУ18
//	|			ТОГДА РасчетРезерваОтпусков.СуммаРезерва - РасчетРезерваОтпусков.СуммаРезерваНУ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаРезерваВР,
//	|	ВЫБОР
//	|		КОГДА УчетнаяПолитика.ПоддержкаПБУ18
//	|			ТОГДА РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносов - РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНУ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаРезерваСтраховыхВзносовВР,
//	|	ВЫБОР
//	|		КОГДА УчетнаяПолитика.ПоддержкаПБУ18
//	|			ТОГДА РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаи - РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНУ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаРезерваФССНесчастныеСлучаиВР,
//	|	РасчетРезерваОтпусков.ТекущаяСтавкаСтраховыхВзносов КАК ТекущаяСтавкаСтраховыхВзносов,
//	|	РасчетРезерваОтпусков.ТекущаяСтавкаФССНесчастныеСлучаи КАК ТекущаяСтавкаФССНесчастныеСлучаи,
//	|	УчетнаяПолитика.НормативОтчисленийВРезервОтпусков КАК НормативОтчисленийВРезервОтпусков,
//	|	РасчетРезерваОтпусков.СуммаРезерваНакоплено КАК СуммаРезерваНакопленоБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНакоплено КАК СуммаРезерваСтраховыхВзносовНакопленоБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНакоплено КАК СуммаРезерваФССНесчастныеСлучаиНакопленоБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваНакопленоНУ КАК СуммаРезерваНакопленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНакопленоНУ КАК СуммаРезерваСтраховыхВзносовНакопленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНакопленоНУ КАК СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваИсчислено КАК СуммаРезерваИсчисленоБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовИсчислено КАК СуммаРезерваСтраховыхВзносовИсчисленоБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиИсчислено КАК СуммаРезерваФССНесчастныеСлучаиИсчисленоБУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваИсчисленоНУ КАК СуммаРезерваИсчисленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовИсчисленоНУ КАК СуммаРезерваСтраховыхВзносовИсчисленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ КАК СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ,
//	|	0 КАК КонтрольБУ,
//	|	0 КАК КонтрольНУ,
//	|	0 КАК КонтрольВР,
//	|	УчетнаяПолитика.ПредельнаяВеличинаОтчисленийВРезервОтпусков КАК ПредельнаяВеличинаОтчисленийВРезервОтпусков,
//	|	НакопленныеРезервы.НакопленноеОбязательство КАК НакопленноеОбязательство,
//	|	НакопленныеРезервы.НакопленныйРезерв КАК НакопленныйРезерв,
//	|	вт_СостоянияСотрудников.Состояние КАК СостояниеСотрудника
//	|{ВЫБРАТЬ
//	|	Организация.*,
//	|	Период,
//	|	ФизическоеЛицо.*,
//	|	ФизическоеЛицоНаименование,
//	|	ФОТ,
//	|	СтраховыеВзносы,
//	|	ФССНесчастныеСлучаи,
//	|	СуммаРезерваБУ,
//	|	СуммаРезерваСтраховыхВзносовБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиБУ,
//	|	ОстатокОтпуска,
//	|	ОтпускАвансом,
//	|	ОстатокОтпускаРасчетный,
//	|	СреднийЗаработок,
//	|	СуммаРезерваНУ,
//	|	СуммаРезерваСтраховыхВзносовНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиНУ,
//	|	СуммаРезерваВР,
//	|	СуммаРезерваСтраховыхВзносовВР,
//	|	СуммаРезерваФССНесчастныеСлучаиВР,
//	|	ТекущаяСтавкаСтраховыхВзносов,
//	|	ТекущаяСтавкаФССНесчастныеСлучаи,
//	|	НормативОтчисленийВРезервОтпусков,
//	|	СуммаРезерваНакопленоБУ,
//	|	СуммаРезерваСтраховыхВзносовНакопленоБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиНакопленоБУ,
//	|	СуммаРезерваНакопленоНУ,
//	|	СуммаРезерваСтраховыхВзносовНакопленоНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,
//	|	СуммаРезерваИсчисленоБУ,
//	|	СуммаРезерваСтраховыхВзносовИсчисленоБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиИсчисленоБУ,
//	|	СуммаРезерваИсчисленоНУ,
//	|	СуммаРезерваСтраховыхВзносовИсчисленоНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ,
//	|	КонтрольБУ,
//	|	КонтрольНУ,
//	|	КонтрольВР,
//	|	ПредельнаяВеличинаОтчисленийВРезервОтпусков,
//	|	НакопленноеОбязательство,
//	|	НакопленныйРезерв,
//	|	СостояниеСотрудника.*}
//	|ИЗ
//	|	РегистрСведений.РасчетРезерваОтпусков КАК РасчетРезерваОтпусков
//	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитика КАК УчетнаяПолитика
//	|		ПО РасчетРезерваОтпусков.Организация = УчетнаяПолитика.Организация
//	|		ЛЕВОЕ СОЕДИНЕНИЕ НакопленныеРезервы КАК НакопленныеРезервы
//	|		ПО РасчетРезерваОтпусков.Организация = НакопленныеРезервы.Организация
//	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СостоянияСотрудников КАК вт_СостоянияСотрудников
//	|		ПО РасчетРезерваОтпусков.Организация = вт_СостоянияСотрудников.Организация
//	|			И РасчетРезерваОтпусков.Сотрудник = вт_СостоянияСотрудников.Сотрудник
//	|ГДЕ
//	|	РасчетРезерваОтпусков.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И РасчетРезерваОтпусков.Активность
//	|	И РасчетРезерваОтпусков.Организация = &Организация
//	|{ГДЕ
//	|	РасчетРезерваОтпусков.Сотрудник.*,
//	|	вт_СостоянияСотрудников.Состояние.* КАК СостояниеСотрудника}
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РасчетРезерваОтпусков.Организация,
//	|	РасчетРезерваОтпусков.ПериодРасчета,
//	|	РасчетРезерваОтпусков.Сотрудник,
//	|	РасчетРезерваОтпусков.Сотрудник.Наименование,
//	|	РасчетРезерваОтпусков.ФОТ,
//	|	РасчетРезерваОтпусков.СтраховыеВзносы,
//	|	РасчетРезерваОтпусков.ФССНесчастныеСлучаи,
//	|	РасчетРезерваОтпусков.СуммаРезерва,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносов,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаи,
//	|	РасчетРезерваОтпусков.ОстатокОтпуска,
//	|	РасчетРезерваОтпусков.СреднийЗаработок,
//	|	РасчетРезерваОтпусков.СуммаРезерваНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНУ,
//	|	РасчетРезерваОтпусков.ТекущаяСтавкаСтраховыхВзносов,
//	|	РасчетРезерваОтпусков.ТекущаяСтавкаФССНесчастныеСлучаи,
//	|	УчетнаяПолитика.НормативОтчисленийВРезервОтпусков,
//	|	РасчетРезерваОтпусков.СуммаРезерваНакоплено,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНакоплено,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНакоплено,
//	|	РасчетРезерваОтпусков.СуммаРезерваНакопленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНакопленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваИсчислено,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовИсчислено,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиИсчислено,
//	|	РасчетРезерваОтпусков.СуммаРезерваИсчисленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовИсчисленоНУ,
//	|	РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ,
//	|	УчетнаяПолитика.ПредельнаяВеличинаОтчисленийВРезервОтпусков,
//	|	ВЫБОР
//	|		КОГДА УчетнаяПолитика.ПоддержкаПБУ18
//	|			ТОГДА РасчетРезерваОтпусков.СуммаРезерва - РасчетРезерваОтпусков.СуммаРезерваНУ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА УчетнаяПолитика.ПоддержкаПБУ18
//	|			ТОГДА РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносов - РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНУ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА УчетнаяПолитика.ПоддержкаПБУ18
//	|			ТОГДА РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаи - РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНУ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ,
//	|	НакопленныеРезервы.НакопленноеОбязательство,
//	|	НакопленныеРезервы.НакопленныйРезерв,
//	|	РасчетРезерваОтпусков.ОтпускАвансом,
//	|	вт_СостоянияСотрудников.Состояние
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ФизическоеЛицо,
//	|	Период
//	|";
//	
//	ПолеНабора = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//	ПолеНабора.Поле = "СостояниеСотрудника";
//	ПолеНабора.ПутьКДанным = "СостояниеСотрудника";   
//	ПолеНабора.Заголовок = "Состояние сотрудника";
//	
//	//СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхОстаткиОбороты.Запрос = "
//	//|ВЫБРАТЬ
//	//|	ОценочныеОбязательстваОстаткиИОбороты.Организация КАК Организация,
//	//|	ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства КАК ТипОценочногоОбязательства,
//	//|	ОценочныеОбязательстваОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансирования,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальныйОстатокБУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаНУНачальныйОстаток) КАК НачальныйОстатокНУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход) КАК ПриходБУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаНУПриход) КАК ПриходНУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаРасход) КАК РасходБУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаНУРасход) КАК РасходНУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечныйОстатокБУ,
//	//|	СУММА(ОценочныеОбязательстваОстаткиИОбороты.СуммаНУКонечныйОстаток) КАК КонечныйОстатокНУ
//	//|{ВЫБРАТЬ
//	//|	Организация.*,
//	//|	ТипОценочногоОбязательства.*,
//	//|	СтатьяФинансирования.*,
//	//|	НачальныйОстатокБУ,
//	//|	НачальныйОстатокНУ,
//	//|	ПриходБУ,
//	//|	ПриходНУ,
//	//|	РасходБУ,
//	//|	РасходНУ,
//	//|	КонечныйОстатокБУ,
//	//|	КонечныйОстатокНУ}
//	//|ИЗ
//	//|	РегистрНакопления.ОценочныеОбязательства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , {(Организация = &Организация)}) КАК ОценочныеОбязательстваОстаткиИОбороты
//	//|{ГДЕ
//	//|	ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства.*,
//	//|	ОценочныеОбязательстваОстаткиИОбороты.СтатьяФинансирования.*}
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ОценочныеОбязательстваОстаткиИОбороты.Организация,
//	//|	ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства,
//	//|	ОценочныеОбязательстваОстаткиИОбороты.СтатьяФинансирования
//	//|";
//	
//	СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхПоСотрудникам.Запрос = "
//	|ВЫБРАТЬ
//	|	СостоянияСотрудников.Сотрудник.ГоловнаяОрганизация КАК Организация,
//	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
//	|	СостоянияСотрудников.Состояние КАК Состояние
//	|ПОМЕСТИТЬ вт_СостоянияСотрудников
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		СостоянияСотрудников.Сотрудник КАК Сотрудник,
//	|		МАКСИМУМ(СостоянияСотрудников.Период) КАК Период
//	|	ИЗ
//	|		РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
//	|	ГДЕ
//	|		СостоянияСотрудников.Период <= &КонецПериода
//	|		И (СостоянияСотрудников.ДействуетДо >= &НачалоПериодаОстатков
//	|				ИЛИ СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1))
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		СостоянияСотрудников.Сотрудник) КАК ВложенныйЗапрос
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
//	|		ПО ВложенныйЗапрос.Сотрудник = СостоянияСотрудников.Сотрудник
//	|			И ВложенныйЗапрос.Период = СостоянияСотрудников.Период
//	|{ГДЕ
//	|	ВложенныйЗапрос.Сотрудник.*,
//	|	СостоянияСотрудников.Состояние.* КАК СостояниеСотрудника}
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Сотрудник
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.Организация КАК Организация,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.Сотрудник КАК Сотрудник,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.Сотрудник.Наименование КАК ФизическоеЛицоНаименование,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансированияСотрудник,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНачальныйОстаток КАК СуммаРезерваНачальныйОстатокБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНачальныйОстаток КАК СуммаРезерваСтраховыхВзносовНачальныйОстатокБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНачальныйОстаток КАК СуммаРезерваФССНесчастныеСлучаиНачальныйОстатокБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНачальныйОстаток КАК СуммаРезерваНачальныйОстатокВсегоБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваПриход КАК СуммаРезерваПриходБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовПриход КАК СуммаРезерваСтраховыхВзносовПриходБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиПриход КАК СуммаРезерваФССНесчастныеСлучаиПриходБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваПриход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовПриход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиПриход КАК СуммаРезерваПриходВсегоБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваРасход КАК СуммаРезерваРасходБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовРасход КАК СуммаРезерваСтраховыхВзносовРасходБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиРасход КАК СуммаРезерваФССНесчастныеСлучаиРасходБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваРасход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовРасход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиРасход КАК СуммаРезерваРасходВсегоБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваКонечныйОстаток КАК СуммаРезерваКонечныйОстатокБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовКонечныйОстаток КАК СуммаРезерваСтраховыхВзносовКонечныйОстатокБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиКонечныйОстаток КАК СуммаРезерваФССНесчастныеСлучаиКонечныйОстатокБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваКонечныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовКонечныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиКонечныйОстаток КАК СуммаРезерваКонечныйОстатокВсегоБУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУНачальныйОстаток КАК СуммаРезерваНачальныйОстатокНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУНачальныйОстаток КАК СуммаРезерваСтраховыхВзносовНачальныйОстатокНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУНачальныйОстаток КАК СуммаРезерваФССНесчастныеСлучаиНачальныйОстатокНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУНачальныйОстаток КАК СуммаРезерваНачальныйОстатокВсегоНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУПриход КАК СуммаРезерваПриходНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУПриход КАК СуммаРезерваСтраховыхВзносовПриходНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУПриход КАК СуммаРезерваФССНесчастныеСлучаиПриходНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУПриход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУПриход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУПриход КАК СуммаРезерваПриходВсегоНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУРасход КАК СуммаРезерваРасходНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУРасход КАК СуммаРезерваСтраховыхВзносовРасходНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУРасход КАК СуммаРезерваФССНесчастныеСлучаиРасходНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУРасход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУРасход + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУРасход КАК СуммаРезерваРасходВсегоНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУКонечныйОстаток КАК СуммаРезерваКонечныйОстатокНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУКонечныйОстаток КАК СуммаРезерваСтраховыхВзносовКонечныйОстатокНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУКонечныйОстаток КАК СуммаРезерваФССНесчастныеСлучаиКонечныйОстатокНУ,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУКонечныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУКонечныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУКонечныйОстаток КАК СуммаРезерваКонечныйОстатокВсегоНУ,
//	|	вт_СостоянияСотрудников.Состояние КАК СостояниеСотрудника
//	|{ВЫБРАТЬ
//	|	Организация.*,
//	|	Сотрудник.*,
//	|	СтатьяФинансированияСотрудник.*,
//	|	СуммаРезерваНачальныйОстатокБУ,
//	|	СуммаРезерваСтраховыхВзносовНачальныйОстатокБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиНачальныйОстатокБУ,
//	|	СуммаРезерваНачальныйОстатокВсегоБУ,
//	|	СуммаРезерваПриходБУ,
//	|	СуммаРезерваСтраховыхВзносовПриходБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиПриходБУ,
//	|	СуммаРезерваПриходВсегоБУ,
//	|	СуммаРезерваРасходБУ,
//	|	СуммаРезерваСтраховыхВзносовРасходБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиРасходБУ,
//	|	СуммаРезерваРасходВсегоБУ,
//	|	СуммаРезерваКонечныйОстатокБУ,
//	|	СуммаРезерваСтраховыхВзносовКонечныйОстатокБУ,
//	|	СуммаРезерваФССНесчастныеСлучаиКонечныйОстатокБУ,
//	|	СуммаРезерваКонечныйОстатокВсегоБУ,
//	|	СуммаРезерваНачальныйОстатокНУ,
//	|	СуммаРезерваСтраховыхВзносовНачальныйОстатокНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиНачальныйОстатокНУ,
//	|	СуммаРезерваНачальныйОстатокВсегоНУ,
//	|	СуммаРезерваПриходНУ,
//	|	СуммаРезерваСтраховыхВзносовПриходНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиПриходНУ,
//	|	СуммаРезерваПриходВсегоНУ,
//	|	СуммаРезерваРасходНУ,
//	|	СуммаРезерваСтраховыхВзносовРасходНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиРасходНУ,
//	|	СуммаРезерваРасходВсегоНУ,
//	|	СуммаРезерваКонечныйОстатокНУ,
//	|	СуммаРезерваСтраховыхВзносовКонечныйОстатокНУ,
//	|	СуммаРезерваФССНесчастныеСлучаиКонечныйОстатокНУ,
//	|	СуммаРезерваКонечныйОстатокВсегоНУ,
//	|	СостояниеСотрудника.*}
//	|ИЗ
//	|	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , {(Организация = &Организация)}) КАК ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты
//	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СостоянияСотрудников КАК вт_СостоянияСотрудников
//	|		ПО ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.Организация = вт_СостоянияСотрудников.Организация
//	|			И ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.Сотрудник = вт_СостоянияСотрудников.Сотрудник
//	|{ГДЕ
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.Сотрудник.* КАК Сотрудник,
//	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СтатьяФинансирования.* КАК СтатьяФинансированияСотрудник,
//	|	вт_СостоянияСотрудников.Состояние.* КАК СостояниеСотрудника}
//	|";
//	
//	ПолеНабора = СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхПоСотрудникам.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//	ПолеНабора.Поле = "СостояниеСотрудника";
//	ПолеНабора.ПутьКДанным = "СостояниеСотрудника";   
//	ПолеНабора.Заголовок = "Состояние сотрудника";
//КонецПроцедуры
