&Вместо("ТекстыЗапросовФормыВыбораСотрудников")
Функция ВИЛС_ТекстыЗапросовФормыВыбораСотрудников()
	
	ТекстыЗапросов = Новый Структура("Текст,ТекстЗапросаДляПолученияДанныхДляПодбораСотрудников");
	
	Если ПараметрыСеанса.АльтернативныйПодборСпискаСотрудников Тогда
		
		ТекстыЗапросов.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сотрудники.Ссылка КАК Ссылка,
			|	Сотрудники.ВерсияДанных КАК ВерсияДанных,
			|	Сотрудники.ПометкаУдаления КАК ПометкаУдаления,
			|	Сотрудники.Код КАК Код,
			|	Сотрудники.Наименование КАК Наименование,
			|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,
			|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеДляПодбора.Организация КАК Организация,
			|	Сотрудники.ВАрхиве КАК ВАрхиве,
			|	Сотрудники.УточнениеНаименования КАК УточнениеНаименования,
			|	Сотрудники.ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	Сотрудники.Предопределенный КАК Предопределенный,
			|	Сотрудники.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	ВЫБОР
			|		КОГДА Сотрудники.ПометкаУдаления
			|			ТОГДА 4
			|		ИНАЧЕ 3
			|	КОНЕЦ КАК Пиктограмма,
			|	ДанныеДляПодбора.Филиал КАК Филиал,
			|	ДанныеДляПодбора.Подразделение КАК Подразделение,
			|	ДанныеДляПодбора.Должность КАК Должность,
			|	ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
			|	ДанныеДляПодбора.КоличествоСтавок КАК КоличествоСтавок,
			|	ДанныеДляПодбора.КоличествоСтавокПредставление КАК КоличествоСтавокПредставление,
			|	ВидыЗанятостиСотрудниковДляПодбора.ВидЗанятости КАК ВидЗанятости,
			|	ЕСТЬNULL(ДанныеДляПодбора.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка)) КАК ВидДоговора,
			|	ДанныеОбОплатеТрудаДляПодбора.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	ДанныеОбОплатеТрудаДляПодбора.ФОТ КАК ФОТ,
			|	ДанныеОбОплатеТрудаДляПодбора.Надбавка КАК Надбавка,
			|	ДанныеОбАвансеДляПодбора.СпособРасчетаАванса КАК СпособРасчетаАванса,
			|	ДанныеОбАвансеДляПодбора.Аванс КАК Аванс,
			|	ТекущиеКадровыеДанные.ДатаПриема КАК ДатаПриема,
			|	ТекущиеКадровыеДанные.ДатаУвольнения КАК ДатаУвольнения,
			|	ТекущиеКадровыеДанные.ОформленПоТрудовомуДоговору КАК ОформленПоТрудовомуДоговору,
			|	ВЫБОР
			|		КОГДА РолиСотрудниковРаботник.Сотрудник ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Работник,
			|	ВЫБОР
			|		КОГДА РолиСотрудниковДоговорник.Сотрудник ЕСТЬ NULL 
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Договорник,
			|	СостоянияСотрудников.Состояние КАК Состояние,
			|	ВЫБОР
			|		КОГДА СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
			|		ИНАЧЕ ДОБАВИТЬКДАТЕ(СостоянияСотрудников.ДействуетДо, ДЕНЬ, 1)
			|	КОНЕЦ КАК СостояниеДействуетДо,
			|	ДанныеДляПодбора.ЭтоГоловнойСотрудник КАК ЭтоГоловнойСотрудник,
			|	ДанныеДляПодбора.Начало КАК Начало,
			|	ДанныеДляПодбора.Окончание КАК Окончание,
			|	ВЫБОР
			|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ТОГДА ""99999""
			|		КОГДА ДанныеДляПодбора.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА ""99998""
			|		ИНАЧЕ ДанныеДляПодбора.Подразделение.РеквизитДопУпорядочиванияИерархического
			|	КОНЕЦ КАК ПорядокПодразделения,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДанныеДляПодбора.Должность, ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию.Должность) = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(ДанныеДляПодбора.Должность.РеквизитДопУпорядочивания, ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию.Должность.РеквизитДопУпорядочивания)
			|	КОНЕЦ КАК ПорядокДолжности,
			|	ВЫБОР
			|		КОГДА ДанныеДляПодбора.Филиал <> Значение(Справочник.Организации.ПустаяСсылка)
			|			ТОГДА ДанныеДляПодбора.Филиал
			|		ИНАЧЕ ДанныеДляПодбора.Организация
			|	КОНЕЦ КАК ОрганизацияСотрудника,
			|	ДанныеДляПодбора.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
			//begin fix Клещ А.Н. 19.06.2019  
			|   , ДанныеКонтракта.НомерДоговораКонтракта как ВИЛС_НомерКонтракта
			//end fix Клещ А.Н. 19.06.2019
			|ИЗ
			|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ДанныеДляПодбора.Сотрудник = Сотрудники.Ссылка
			|			И ДанныеДляПодбора.Наименование = Сотрудники.Наименование
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (&ТекстЗапросаДляПолученияДанныхДляПодбораСотрудников) КАК ДанныеСотрудников
			|		ПО ДанныеДляПодбора.Сотрудник = ДанныеСотрудников.Сотрудник
			|			И ДанныеДляПодбора.Наименование = ДанныеСотрудников.Наименование
			|			И ДанныеДляПодбора.Начало = ДанныеСотрудников.Начало
			|			И ВЫБОР
			|					КОГДА ДанныеДляПодбора.Подразделение = ДанныеСотрудников.Подразделение
			|						ТОГДА ИСТИНА
			|					КОГДА ДанныеДляПодбора.Филиал = ДанныеСотрудников.Филиал
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ
			|			И ДанныеДляПодбора.ПоДоговоруГПХ = ДанныеСотрудников.ПоДоговоруГПХ
			//begin fix Клещ А.Н. 19.06.2019  
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СрезПоследних КАК ДанныеКонтракта
			|		ПО ДанныеДляПодбора.ФизическоеЛицо = ДанныеКонтракта.ФизическоеЛицо
			|			И ДанныеДляПодбора.Сотрудник = ДанныеКонтракта.Сотрудник
			|			И ДанныеДляПодбора.Организация = ДанныеКонтракта.ГоловнаяОрганизация}
			//end fix Клещ А.Н. 19.06.2019
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанные
			|		ПО ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанные.ФизическоеЛицо
			|			И ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанные.Сотрудник
			|			И ДанныеДляПодбора.Организация = ТекущиеКадровыеДанные.ГоловнаяОрганизация}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РолиСотрудников КАК РолиСотрудниковРаботник
			|		ПО ДанныеДляПодбора.Сотрудник = РолиСотрудниковРаботник.Сотрудник
			|			И (&ИспользуетсяОтборПоРолиСотрудникаРаботник = ИСТИНА)
			|			И (РолиСотрудниковРаботник.РольСотрудника = ЗНАЧЕНИЕ(Перечисление.РолиСотрудников.Работник))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РолиСотрудников КАК РолиСотрудниковДоговорник
			|		ПО ДанныеДляПодбора.Сотрудник = РолиСотрудниковДоговорник.Сотрудник
			|			И (&ИспользуетсяОтборПоРолиСотрудникаДоговорник = ИСТИНА)
			|			И (РолиСотрудниковДоговорник.РольСотрудника = ЗНАЧЕНИЕ(Перечисление.РолиСотрудников.Договорник))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
			|		ПО ДанныеДляПодбора.Сотрудник = СостоянияСотрудников.Сотрудник
			|			И (СостоянияСотрудников.Период В
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(РегистрСостоянияСотрудников.Период) КАК Период
			|				ИЗ
			|					РегистрСведений.СостоянияСотрудников КАК РегистрСостоянияСотрудников
			|				ГДЕ
			|					ДанныеДляПодбора.Сотрудник = РегистрСостоянияСотрудников.Сотрудник
			|					И РегистрСостоянияСотрудников.Период <= &ДатаОкончания
			|					И (РегистрСостоянияСотрудников.ДействуетДо >= &ДатаНачалаСведений
			|						ИЛИ РегистрСостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1))
			|					И &ОтборСостоянийСотрудника))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыйФОТИтоги КАК ДанныеОбОплатеТрудаДляПодбора
			|		ПО ДанныеДляПодбора.Сотрудник = ДанныеОбОплатеТрудаДляПодбора.Сотрудник
			|			И ДанныеДляПодбора.Организация = ДанныеОбОплатеТрудаДляПодбора.ГоловнаяОрганизация
			|			И (ВЫБОР
			|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|			КОНЕЦ МЕЖДУ ДанныеОбОплатеТрудаДляПодбора.Период И ДанныеОбОплатеТрудаДляПодбора.ДатаОкончания)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеАвансыИнтервальный КАК ДанныеОбАвансеДляПодбора
			|		ПО ДанныеДляПодбора.Сотрудник = ДанныеОбАвансеДляПодбора.Сотрудник
			|			И (ВЫБОР
			|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|			КОНЕЦ МЕЖДУ ДанныеОбАвансеДляПодбора.ДатаНачала И ДанныеОбАвансеДляПодбора.ДатаОкончания)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный КАК ВидыЗанятостиСотрудниковДляПодбора
			|		ПО ДанныеДляПодбора.Сотрудник = ВидыЗанятостиСотрудниковДляПодбора.Сотрудник
			|			И (ВЫБОР
			|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|			КОНЕЦ МЕЖДУ ВидыЗанятостиСотрудниковДляПодбора.ДатаНачала И ВидыЗанятостиСотрудниковДляПодбора.ДатаОкончания)}
			|ГДЕ
			|	ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ ДанныеДляПодбора.Окончание >= &ДатаНачала)
			|	И ДанныеДляПодбора.Организация В(&РазрешенныеОрганизации)";
			
		ТекстыЗапросов.ТекстЗапросаДляПолученияДанныхДляПодбораСотрудников =
			"ВЫБРАТЬ
			|	ДанныеДляПодбораОтобранные.Сотрудник КАК Сотрудник,
			|	ДанныеДляПодбораОтобранные.Наименование КАК Наименование,
			|	ДанныеДляПодбораОтобранные.Начало КАК Начало,
			|	МАКСИМУМ(ДанныеДляПодбораОтборФилиалПодразделение.Филиал) КАК Филиал,
			|	МАКСИМУМ(ДанныеДляПодбораОтборФилиалПодразделение.Подразделение) КАК Подразделение,
			|	ДанныеДляПодбораОтобранные.ПоДоговоруГПХ КАК ПоДоговоруГПХ
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДанныеДляПодбораОтбор.Сотрудник КАК Сотрудник,
			|		ДанныеДляПодбораОтбор.Наименование КАК Наименование,
			|		ДанныеДляПодбораОтбор.ПоДоговоруГПХ КАК ПоДоговоруГПХ,
			|		МАКСИМУМ(ДанныеДляПодбораОтбор.Начало) КАК Начало
			|	ИЗ
			|		РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораОтбор
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 0
			|				1 КАК Поле1
			|			ГДЕ
			|				1 В (&ПараметрЗапроса01)
			|				И 1 В (&ПараметрЗапроса02)
			|				И 1 В (&ПараметрЗапроса03)
			|				И 1 В (&ПараметрЗапроса04)
			|				И 1 В (&ПараметрЗапроса05)
			|				И 1 В (&ПараметрЗапроса06)
			|				И 1 В (&ПараметрЗапроса07)
			|				И 1 В (&ПараметрЗапроса08)
			|				И 1 В (&ПараметрЗапроса09)
			|				И 1 В (&ПараметрЗапроса10)
			|				И 1 В (&ПараметрЗапроса11)
			|				И 1 В (&ПараметрЗапроса12)
			|				И 1 В (&ПараметрЗапроса13)
			|				И 1 В (&ПараметрЗапроса14)
			|				И 1 В (&ПараметрЗапроса15)
			|				И 1 В (&ПараметрЗапроса16)
			|				И 1 В (&ПараметрЗапроса17)
			|				И 1 В (&ПараметрЗапроса18)
			|				И 1 В (&ПараметрЗапроса19)
			|				И 1 В (&ПараметрЗапроса20)
			|				И 1 В (&СписокРазрешенныхОрганизацийФормировался)) КАК ТаблицаПараметров
			|			ПО (ИСТИНА)
			|	ГДЕ
			|		ДанныеДляПодбораОтбор.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
			|		И ДанныеДляПодбораОтбор.Начало <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|		И (ДанныеДляПодбораОтбор.Окончание = ДАТАВРЕМЯ(1, 1, 1)
			|				ИЛИ ДанныеДляПодбораОтбор.Окончание >= &ДатаНачала)
			|		И ДанныеДляПодбораОтбор.ПоДоговоруГПХ В
			|				(ВЫБРАТЬ
			|					МИНИМУМ(ДанныеДляПодбораОтборДоговорник.ПоДоговоруГПХ) КАК ПоДоговоруГПХ
			|				ИЗ
			|					РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораОтборДоговорник
			|				ГДЕ
			|					ДанныеДляПодбораОтбор.Сотрудник = ДанныеДляПодбораОтборДоговорник.Сотрудник
			|					И ДанныеДляПодбораОтбор.Наименование = ДанныеДляПодбораОтборДоговорник.Наименование
			|					И ДанныеДляПодбораОтборДоговорник.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
			|					И ДанныеДляПодбораОтборДоговорник.Начало <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|					И (ДанныеДляПодбораОтборДоговорник.Окончание = ДАТАВРЕМЯ(1, 1, 1)
			|						ИЛИ ДанныеДляПодбораОтборДоговорник.Окончание >= &ДатаНачала)
			|					И &ТекстОтбораДанныеДляПодбораДоговорниковСотрудников
			|				СГРУППИРОВАТЬ ПО
			|					ДанныеДляПодбораОтборДоговорник.Сотрудник,
			|					ДанныеДляПодбораОтборДоговорник.Наименование)
			|		И ДанныеДляПодбораОтбор.Организация В(&РазрешенныеОрганизации)
			|		И &ТекстОтбораДанныеДляПодбораСотрудников
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДанныеДляПодбораОтбор.Сотрудник,
			|		ДанныеДляПодбораОтбор.Наименование,
			|		ДанныеДляПодбораОтбор.ПоДоговоруГПХ) КАК ДанныеДляПодбораОтобранные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораОтборФилиалПодразделение
			|		ПО ДанныеДляПодбораОтобранные.Сотрудник = ДанныеДляПодбораОтборФилиалПодразделение.Сотрудник
			|			И ДанныеДляПодбораОтобранные.Наименование = ДанныеДляПодбораОтборФилиалПодразделение.Наименование
			|			И ДанныеДляПодбораОтобранные.Начало = ДанныеДляПодбораОтборФилиалПодразделение.Начало
			|			И ДанныеДляПодбораОтобранные.ПоДоговоруГПХ = ДанныеДляПодбораОтборФилиалПодразделение.ПоДоговоруГПХ
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеДляПодбораОтобранные.Сотрудник,
			|	ДанныеДляПодбораОтобранные.Наименование,
			|	ДанныеДляПодбораОтобранные.Начало,
			|	ДанныеДляПодбораОтобранные.ПоДоговоруГПХ";
		
	Иначе
		
		ТекстыЗапросов.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сотрудники.Ссылка КАК Ссылка,
			|	Сотрудники.ВерсияДанных КАК ВерсияДанных,
			|	Сотрудники.ПометкаУдаления КАК ПометкаУдаления,
			|	Сотрудники.Код КАК Код,
			|	Сотрудники.Наименование КАК Наименование,
			|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,
			|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеДляПодбора.Организация КАК Организация,
			|	Сотрудники.ВАрхиве КАК ВАрхиве,
			|	Сотрудники.УточнениеНаименования КАК УточнениеНаименования,
			|	Сотрудники.ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	Сотрудники.Предопределенный КАК Предопределенный,
			|	Сотрудники.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	ВЫБОР
			|		КОГДА Сотрудники.ПометкаУдаления
			|			ТОГДА 4
			|		ИНАЧЕ 3
			|	КОНЕЦ КАК Пиктограмма,
			|	ДанныеДляПодбора.Филиал КАК Филиал,
			|	ДанныеДляПодбора.Подразделение КАК Подразделение,
			|	ДанныеДляПодбора.Должность КАК Должность,
			|	ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
			|	ДанныеДляПодбора.КоличествоСтавок КАК КоличествоСтавок,
			|	ДанныеДляПодбора.КоличествоСтавокПредставление КАК КоличествоСтавокПредставление,
			|	ВидыЗанятостиСотрудниковДляПодбора.ВидЗанятости КАК ВидЗанятости,
			|	ЕСТЬNULL(ДанныеДляПодбора.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка)) КАК ВидДоговора,
			|	ДанныеОбОплатеТрудаДляПодбора.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	ДанныеОбОплатеТрудаДляПодбора.ФОТ КАК ФОТ,
			|	ДанныеОбОплатеТрудаДляПодбора.Надбавка КАК Надбавка,
			|	ДанныеОбАвансеДляПодбора.СпособРасчетаАванса КАК СпособРасчетаАванса,
			|	ДанныеОбАвансеДляПодбора.Аванс КАК Аванс,
			|	ТекущиеКадровыеДанные.ДатаПриема КАК ДатаПриема,
			|	ТекущиеКадровыеДанные.ДатаУвольнения КАК ДатаУвольнения,
			|	ТекущиеКадровыеДанные.ОформленПоТрудовомуДоговору КАК ОформленПоТрудовомуДоговору,
			|	ВЫБОР
			|		КОГДА РолиСотрудниковРаботник.Сотрудник ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Работник,
			|	ВЫБОР
			|		КОГДА РолиСотрудниковДоговорник.Сотрудник ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Договорник,
			|	СостоянияСотрудников.Состояние КАК Состояние,
			|	ВЫБОР
			|		КОГДА СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
			|		ИНАЧЕ ДОБАВИТЬКДАТЕ(СостоянияСотрудников.ДействуетДо, ДЕНЬ, 1)
			|	КОНЕЦ КАК СостояниеДействуетДо,
			|	ДанныеДляПодбора.ЭтоГоловнойСотрудник КАК ЭтоГоловнойСотрудник,
			|	ДанныеДляПодбора.Начало КАК Начало,
			|	ДанныеДляПодбора.Окончание КАК Окончание,
			|	ВЫБОР
			|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ТОГДА ""99999""
			|		КОГДА ДанныеДляПодбора.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА ""99998""
			|		ИНАЧЕ ДанныеДляПодбора.Подразделение.РеквизитДопУпорядочиванияИерархического
			|	КОНЕЦ КАК ПорядокПодразделения,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДанныеДляПодбора.Должность, ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию.Должность) = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(ДанныеДляПодбора.Должность.РеквизитДопУпорядочивания, ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию.Должность.РеквизитДопУпорядочивания)
			|	КОНЕЦ КАК ПорядокДолжности,
			|	ВЫБОР
			|		КОГДА ДанныеДляПодбора.Филиал <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ТОГДА ДанныеДляПодбора.Филиал
			|		ИНАЧЕ ДанныеДляПодбора.Организация
			|	КОНЕЦ КАК ОрганизацияСотрудника,
			|	ДанныеДляПодбора.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
			//begin fix Клещ А.Н. 19.06.2019  
			|   , ДанныеКонтракта.НомерДоговораКонтракта как ВИЛС_НомерКонтракта
			//end fix Клещ А.Н. 19.06.2019
			|ИЗ
			|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ДанныеДляПодбора.Сотрудник = Сотрудники.Ссылка
			|			И ДанныеДляПодбора.Наименование = Сотрудники.Наименование
			|			И (ДанныеДляПодбора.ИдентификаторЗаписи В (&ТекстЗапросаДляПолученияДанныхДляПодбораСотрудников))
			//begin fix Клещ А.Н. 19.06.2019  
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СрезПоследних КАК ДанныеКонтракта
			|		ПО ДанныеДляПодбора.ФизическоеЛицо = ДанныеКонтракта.ФизическоеЛицо
			|			И ДанныеДляПодбора.Сотрудник = ДанныеКонтракта.Сотрудник
			|			И ДанныеДляПодбора.Организация = ДанныеКонтракта.ГоловнаяОрганизация}
			//end fix Клещ А.Н. 19.06.2019
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанные
			|		ПО ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанные.ФизическоеЛицо
			|			И ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанные.Сотрудник
			|			И ДанныеДляПодбора.Организация = ТекущиеКадровыеДанные.ГоловнаяОрганизация}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РолиСотрудников КАК РолиСотрудниковРаботник
			|		ПО ДанныеДляПодбора.Сотрудник = РолиСотрудниковРаботник.Сотрудник
			|			И (&ИспользуетсяОтборПоРолиСотрудникаРаботник = ИСТИНА)
			|			И (РолиСотрудниковРаботник.РольСотрудника = ЗНАЧЕНИЕ(Перечисление.РолиСотрудников.Работник))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РолиСотрудников КАК РолиСотрудниковДоговорник
			|		ПО ДанныеДляПодбора.Сотрудник = РолиСотрудниковДоговорник.Сотрудник
			|			И (&ИспользуетсяОтборПоРолиСотрудникаДоговорник = ИСТИНА)
			|			И (РолиСотрудниковДоговорник.РольСотрудника = ЗНАЧЕНИЕ(Перечисление.РолиСотрудников.Договорник))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
			|		ПО ДанныеДляПодбора.Сотрудник = СостоянияСотрудников.Сотрудник
			|			И (СостоянияСотрудников.Период В
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(РегистрСостоянияСотрудников.Период) КАК Период
			|				ИЗ
			|					РегистрСведений.СостоянияСотрудников КАК РегистрСостоянияСотрудников
			|				ГДЕ
			|					ДанныеДляПодбора.Сотрудник = РегистрСостоянияСотрудников.Сотрудник
			|					И РегистрСостоянияСотрудников.Период <= &ДатаОкончания
			|					И (РегистрСостоянияСотрудников.ДействуетДо >= &ДатаНачалаСведений
			|						ИЛИ РегистрСостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1))
			|					И &ОтборСостоянийСотрудника))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыйФОТИтоги КАК ДанныеОбОплатеТрудаДляПодбора
			|		ПО ДанныеДляПодбора.Сотрудник = ДанныеОбОплатеТрудаДляПодбора.Сотрудник
			|			И ДанныеДляПодбора.Организация = ДанныеОбОплатеТрудаДляПодбора.ГоловнаяОрганизация
			|			И (ВЫБОР
			|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|			КОНЕЦ МЕЖДУ ДанныеОбОплатеТрудаДляПодбора.Период И ДанныеОбОплатеТрудаДляПодбора.ДатаОкончания)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеАвансыИнтервальный КАК ДанныеОбАвансеДляПодбора
			|		ПО ДанныеДляПодбора.Сотрудник = ДанныеОбАвансеДляПодбора.Сотрудник
			|			И (ВЫБОР
			|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|			КОНЕЦ МЕЖДУ ДанныеОбАвансеДляПодбора.ДатаНачала И ДанныеОбАвансеДляПодбора.ДатаОкончания)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный КАК ВидыЗанятостиСотрудниковДляПодбора
			|		ПО ДанныеДляПодбора.Сотрудник = ВидыЗанятостиСотрудниковДляПодбора.Сотрудник
			|			И (ВЫБОР
			|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
			|			КОНЕЦ МЕЖДУ ВидыЗанятостиСотрудниковДляПодбора.ДатаНачала И ВидыЗанятостиСотрудниковДляПодбора.ДатаОкончания)}
			|ГДЕ
			|	ИСТИНА
			|	И ДанныеДляПодбора.Организация В(&РазрешенныеОрганизации)";
			
		ТекстыЗапросов.ТекстЗапросаДляПолученияДанныхДляПодбораСотрудников =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДанныеДляПодбораОтбор.ИдентификаторЗаписи КАК ИдентификаторЗаписи
			|ИЗ
			|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораОтбор
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 0
			|			1 КАК Поле1
			|		ГДЕ
			|			1 В (&ПараметрЗапроса01)
			|			И 1 В (&ПараметрЗапроса02)
			|			И 1 В (&ПараметрЗапроса03)
			|			И 1 В (&ПараметрЗапроса04)
			|			И 1 В (&ПараметрЗапроса05)
			|			И 1 В (&ПараметрЗапроса06)
			|			И 1 В (&ПараметрЗапроса07)
			|			И 1 В (&ПараметрЗапроса08)
			|			И 1 В (&ПараметрЗапроса09)
			|			И 1 В (&ПараметрЗапроса10)
			|			И 1 В (&ПараметрЗапроса11)
			|			И 1 В (&ПараметрЗапроса12)
			|			И 1 В (&ПараметрЗапроса13)
			|			И 1 В (&ПараметрЗапроса14)
			|			И 1 В (&ПараметрЗапроса15)
			|			И 1 В (&ПараметрЗапроса16)
			|			И 1 В (&ПараметрЗапроса17)
			|			И 1 В (&ПараметрЗапроса18)
			|			И 1 В (&ПараметрЗапроса19)
			|			И 1 В (&ПараметрЗапроса20)
			|			И 1 В (&СписокРазрешенныхОрганизацийФормировался)) КАК ТаблицаПараметров
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ДанныеДляПодбораОтбор.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
			|	И ДанныеДляПодбораОтбор.Сотрудник = &ДанныеДляПодбораСотрудник
			|	И ДанныеДляПодбораОтбор.Наименование = &ДанныеДляПодбораНаименование
			|	И ДанныеДляПодбораОтбор.Начало <= &ДатаОкончания
			|	И (ДанныеДляПодбораОтбор.Окончание = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ ДанныеДляПодбораОтбор.Окончание >= &ДатаНачала)
			|	И &ТекстОтбораДанныеДляПодбораСотрудников
			|	И ДанныеДляПодбораОтбор.Организация В(&РазрешенныеОрганизации)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВЫБОР
			|		КОГДА ДанныеДляПодбораОтбор.Начало = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ДанныеДляПодбораОтбор.ПоДоговоруГПХ
			|	КОНЕЦ,
			|	ДанныеДляПодбораОтбор.Начало УБЫВ,
			|	ДанныеДляПодбораОтбор.Организация,
			|	ДанныеДляПодбораОтбор.Филиал,
			|	ДанныеДляПодбораОтбор.Подразделение";
		
	КонецЕсли;
	
	Возврат ТекстыЗапросов;
	
КонецФункции
