//begin fix КлещАН 19.10.2018  
&ИзменениеИКонтроль("НазначениеПлатежа")
Функция ВИЛС_НазначениеПлатежа(Объект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить(, "Заказ, Сумма, СтавкаНДС, СуммаНДС");
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Документ", Новый ОписаниеТипов(Документы.ТипВсеСсылки(), "СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДокументов.Колонки.Добавить("Сумма", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	Для Сч = 1 По РасшифровкаПлатежа.Количество() Цикл
		ТаблицаДокументов.Добавить();
	КонецЦикла;
	ТаблицаДокументов.ЗагрузитьКолонку(РасшифровкаПлатежа.ВыгрузитьКолонку("Заказ"), "Документ");
	ТаблицаДокументов.ЗагрузитьКолонку(РасшифровкаПлатежа.ВыгрузитьКолонку("Сумма"), "Сумма");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ИсходнаяТаблица.Документ    КАК Документ,
	|	ИсходнаяТаблица.Сумма       КАК Сумма
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	&ТаблицаДокументов КАК ИсходнаяТаблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерПоДаннымПоставщика       КАК Номер,
	|	ДанныеДокумента.ДатаПоДаннымПоставщика        КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетКомитентуОСписании КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.Номер                         КАК Номер,
	|	ДанныеДокумента.Дата                          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерДекларации               КАК Номер,
	|	НЕОПРЕДЕЛЕНО                                  КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер
	|	
	//++ НЕ УТ
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетОператораСистемыПлатон КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                        КАК Документ,
	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
	|	ДанныеДокумента.НомерПоДаннымПартнера         КАК Номер,
	|	ДанныеДокумента.ДатаПоДаннымПартнера          КАК Дата,
	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
	|	ИСТИНА                                        КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетПереработчика КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.Префикс,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата
	//-- НЕ УТ
	|	
	|");
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаКРаспределению = Объект.РасшифровкаПлатежа.Итог("Сумма");
	ТекстНазначенияПлатежа = "";
	ПредставленияДокументов = ПолучитьПредставленияДокументов();
	
	РеквизитыВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Валюта, "Код, Наименование");
	Если РеквизитыВалюты.Код = "643" Тогда
		ВалютаДляПечати = НСтр("ru = 'руб.';
								|en = 'rub.'");
	Иначе
		ВалютаДляПечати = СокрЛП(РеквизитыВалюты.Наименование);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Документ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
#Удаление		
			ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", "
			+ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Документ, "НаименованиеДляПечати")
			+ " " + Формат(Выборка.Сумма, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
			+ " " + ВалютаДляПечати;
#КонецУдаления
#Вставка
			ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", "
			+ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Документ, "НаименованиеДляПечати");
			//fix + " " + Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
			//fix + " " + ВалютаДляПечати;
#КонецВставки
		Иначе
			ВидДокумента = "";
			ПредставленияДокументов.Свойство(Выборка.Документ.Метаданные().Имя, ВидДокумента);
			Если ЗначениеЗаполнено(ВидДокумента) Тогда
				ПредставлениеДляПечати = НСтр("ru = '%Вид% №%Номер% от %Дата% %Сумма% %Валюта%';
												|en = '%Вид% No.%Номер% dated %Дата% %Сумма% %Валюта%'");
				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Вид%", ВидДокумента);
				Если Выборка.НомерВходящегоДокумента Тогда
					ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Номер%", СокрЛП(Выборка.Номер));
				Иначе
					ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Номер%",
						ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Ложь, Истина));
				КонецЕсли;
				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Дата%", Формат(Выборка.Дата, "ДЛФ=D"));
#Удаление
				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Сумма%",
					Формат(Выборка.Сумма, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Валюта%", ВалютаДляПечати);
#КонецУдаления
#Вставка
				//fix ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Сумма%",
				//fix	Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
				//fix ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Валюта%", ВалютаДляПечати);
				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Сумма%", "");
				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Валюта%", "");
				
				
#КонецВставки
				ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", " + ПредставлениеДляПечати;
			КонецЕсли;
		КонецЕсли;
		СуммаКРаспределению = СуммаКРаспределению - Выборка.Сумма;
	КонецЦикла;
	
	Если СуммаКРаспределению > 0 Тогда
#Удаление
		ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", "
			+ НСтр("ru = 'без указания назначения';
					|en = 'without purpose specification'")
			+ " " + Формат(СуммаКРаспределению, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
			+ " " + ВалютаДляПечати;
#КонецУдаления
#Вставка
		ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", "
			+ НСтр("ru = 'без указания назначения';
					|en = 'without purpose specification'");
			//fix + " " + Формат(СуммаКРаспределению, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
			//fix + " " + ВалютаДляПечати;
#КонецВставки
	КонецЕсли;
	Если СуммаКРаспределению <= 0 Тогда
		ТекстНазначенияПлатежа = НСтр("ru = 'Оплата по';
										|en = 'Payment by'") + Сред(ТекстНазначенияПлатежа, 2);
	Иначе
		ТекстНазначенияПлатежа = НСтр("ru = 'Оплата';
										|en = 'Payment'") + Сред(ТекстНазначенияПлатежа, 2);
	КонецЕсли;
	
	Если Прав(ТекстНазначенияПлатежа, 1) <> "." Тогда
		ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ".";
	КонецЕсли;
	ДлинаТекстаДокументов = СтрДлина(ТекстНазначенияПлатежа);
	
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(
		Объект.Валюта,
		РасшифровкаПлатежа,
		Истина);
	ДлинаТекстаНДС = СтрДлина(ТекстСуммаНДС);
	
	Если ДлинаТекстаДокументов + ДлинаТекстаНДС > 210 Тогда
		ДлинаТекстаДокументов = 207 - ДлинаТекстаНДС;
		ТекстНазначенияПлатежа = Лев(ТекстНазначенияПлатежа, ДлинаТекстаДокументов);
		ТекстПоискаПоследнегоДокумента = ТекстНазначенияПлатежа;
		ПозицияПоследнейЗапятой = 0;
		ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоДокумента, ",");
		Пока НЕ ПозицияЗапятой = 0 Цикл
			ПозицияПоследнейЗапятой = ПозицияПоследнейЗапятой + ПозицияЗапятой;
			ТекстПоискаПоследнегоДокумента = Сред(ТекстПоискаПоследнегоДокумента, ПозицияЗапятой + 1);
			ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоДокумента, ",");
		КонецЦикла;
		ТекстНазначенияПлатежа = Лев(ТекстНазначенияПлатежа, ПозицияПоследнейЗапятой - 1) + "...";
	КонецЕсли;
#Удаление
	ТекстНазначенияПлатежа = СокрЛП(ТекстНазначенияПлатежа) + Символы.ПС + СокрЛП(ТекстСуммаНДС);
#КонецУдаления
#Вставка
	ТекстНазначенияПлатежа = СокрЛП(ТекстНазначенияПлатежа)+?(ЗначениеЗаполнено(Объект.Комментарий)," "+СокрЛП(Объект.Комментарий)+" ","") + Символы.ПС + СокрЛП(ТекстСуммаНДС);
#КонецВставки	
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТекстНазначенияПлатежа;
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТекстНазначенияПлатежа")
Процедура ВИЛС_ЗаполнитьТекстНазначенияПлатежа(Объект) Экспорт
	
	ТекстНазначение = "";
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) Тогда
		ТекстНазначение = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(
			Объект.БанковскийСчетКонтрагента).ТекстНазначения;
	КонецЕсли;
	
	Если ТекстНазначение = "" Тогда
		//++ НЕ УТ
		Если Объект.ПлатежиПо275ФЗ И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			ТекстНазначение = НазначениеПлатежаФЗ275(Объект);
		ИначеЕсли ВыплатаЗарплатыНаЛицевыеСчета(Объект) Тогда
			ТекстНазначение = НазначениеПлатежаПриРасчетахСРаботниками(Объект);
		Иначе
		//-- НЕ УТ
			ТекстНазначение = НазначениеПлатежа(Объект);
		//++ НЕ УТ
		КонецЕсли;
		//-- НЕ УТ
	Иначе
#Удаление		
		ТекстСумма = "Сумма " + Формат(Объект.СуммаДокумента, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
		ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Валюта, Объект.РасшифровкаПлатежа, Истина);
#КонецУдаления
#Вставка		
		ТекстСумма = "Сумма " + Формат(Объект.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
		ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Валюта, Объект.РасшифровкаПлатежа, Истина);
		ТекстНазначение = ?(ЗначениеЗаполнено(Объект.Комментарий),СокрЛП(Объект.Комментарий),"");
#КонецВставки		
		ТекстНазначение = ТекстНазначение + Символы.ПС + ТекстСумма + Символы.ПС + ТекстСуммаНДС;
	КонецЕсли;
	
	Объект.НазначениеПлатежа = ТекстНазначение;
	
КонецПроцедуры      

&ИзменениеИКонтроль("СформироватьВТПеречисленныйНалог")
Функция ВИЛС_СформироватьВТПеречисленныйНалог(Объект, Ведомости, Отказ)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаВедомостей.Ведомость КАК Ведомость,
	|	ОплатаВедомостей.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОплатаВедомостей.Регистратор КАК ПлатежныйДокумент
	|ПОМЕСТИТЬ ВТОплатаВедомостей
	|ИЗ
	|	РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|
	|ГДЕ
	|	ОплатаВедомостей.Ведомость В (&Ведомости)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выплата.ФизическоеЛицо,
	|	Выплата.ПлатежныйДокумент
	|ПОМЕСТИТЬ ВТДокументыУчетаНДФЛ
	|ИЗ
	|	ВТОплатаВедомостей КАК Выплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выплата.ФизическоеЛицо,
	|	Возврат.Ссылка
	|ИЗ
	|	ВТОплатаВедомостей КАК Выплата
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК Возврат
	|		ПО Выплата.ПлатежныйДокумент = Возврат.ДокументВыдачи
	|		И Возврат.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ВТНалогУдержанный
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыУчетаНДФЛ КАК ДокументыУчетаНДФЛ
	|	ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор = ДокументыУчетаНДФЛ.ПлатежныйДокумент
	|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = ДокументыУчетаНДФЛ.ФизическоеЛицо
	|		И &УсловиеСтавкиНДФЛ
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ИсчисленоПоДивидендам,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.КрайнийСрокУплаты
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|		КОГДА НалогУдержанный.РегистрацияВНалоговомОргане = &НалоговыйОрганПлатежа
	|			ТОГДА НалогУдержанный.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаВНалоговыйОрган,
	|	СУММА(НалогУдержанный.Сумма) КАК Сумма
	|ИЗ
	|	ВТНалогУдержанный КАК НалогУдержанный";
	
	Если Объект.ТипНалога = Перечисления.ТипыНалогов.НДФЛСПревышения Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтавкиНДФЛ",
			"РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтавкиНДФЛ",
			"РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	
	НалоговыйОрганОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(
		Объект.Организация, Объект.ДатаПроведенияБанком);
	
	Если ЗначениеЗаполнено(Объект.РегистрацияВНалоговомОргане) Тогда
		Запрос.УстановитьПараметр("НалоговыйОрганПлатежа", Объект.РегистрацияВНалоговомОргане);
	Иначе
		Запрос.УстановитьПараметр("НалоговыйОрганПлатежа", НалоговыйОрганОрганизации);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
#Удаление
	Результат.Следующий();
#КонецУдаления
#Вставка
	РезультатЕсть = Результат.Следующий();
#КонецВставки
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НалогУдержанный.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогУдержанный.Ставка КАК Ставка,
	|	НалогУдержанный.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогУдержанный.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогУдержанный.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	НалогУдержанный.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам,
	|	&РеквизитыПлатежногоПоручения КАК РеквизитыПлатежногоПоручения,
	|	НалогУдержанный.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТНалогПеречисленный
	|ИЗ
	|	ВТНалогУдержанный КАК НалогУдержанный
	|
	|ГДЕ
	|	&УсловиеНаРегистрацию";
	
#Удаление
	Если Объект.СуммаДокумента >= Результат.Сумма Тогда
		Запрос.УстановитьПараметр("УсловиеНаРегистрацию", Истина);
	ИначеЕсли Объект.СуммаДокумента >= Результат.СуммаВНалоговыйОрган Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаРегистрацию",
			"НалогУдержанный.РегистрацияВНалоговомОргане = &НалоговыйОрганПлатежа");
	КонецЕсли;
#КонецУдаления
#Вставка
	//Сообщить("РезультатЕсть " + РезультатЕсть);
	//Сообщить("Объект.СуммаДокумента " + Объект.СуммаДокумента);
	//Сообщить("Результат.Сумма "+Результат.Сумма);
	//Сообщить("Результат.СуммаВНалоговыйОрган "+Результат.СуммаВНалоговыйОрган);
	Если Не РезультатЕсть Тогда
		Запрос.УстановитьПараметр("УсловиеНаРегистрацию", Истина);
	ИначеЕсли Не ЗначениеЗаполнено(Результат.Сумма) Тогда
		Запрос.УстановитьПараметр("УсловиеНаРегистрацию", Истина);
	ИначеЕсли Объект.СуммаДокумента >= Результат.Сумма Тогда
		Запрос.УстановитьПараметр("УсловиеНаРегистрацию", Истина);
	ИначеЕсли Объект.СуммаДокумента >= Результат.СуммаВНалоговыйОрган Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаРегистрацию",
			"НалогУдержанный.РегистрацияВНалоговомОргане = &НалоговыйОрганПлатежа");
	Иначе
		Запрос.УстановитьПараметр("УсловиеНаРегистрацию", Истина);
	КонецЕсли;
#КонецВставки
	
	Если ЗначениеЗаполнено(Объект.НомерВходящегоДокумента) Тогда
		НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.НомерВходящегоДокумента);
	Иначе
		НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РеквизитыПлатежногоПоручения",
		ДенежныеСредстваСервер.РеквизитыПлатежногоПорученияПоДатеНомеру(
			Объект.ДатаПроведенияБанком,
			НомерНаПечать));
	
	Запрос.Выполнить();
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции

&ИзменениеИКонтроль("РассчитатьИЗарегистрироватьПеречисленныйНДФЛ")
Процедура ВИЛС_РассчитатьИЗарегистрироватьПеречисленныйНДФЛ(Объект, Отказ)
	
	МассивВедомостей = Объект.РасшифровкаПлатежа.ВыгрузитьКолонку("Ведомость");
	
	МенеджерВременныхТаблиц = СформироватьВТПеречисленныйНалог(Объект, МассивВедомостей, Отказ);
	
	УчетНДФЛ.СформироватьПеречисленныйНалогПоВременнойТаблице(Объект.Движения, Отказ, Объект.Организация, Объект.ДатаПроведенияБанком, МенеджерВременныхТаблиц, Истина);
	
	ВидПлатежа = Объект.Субконто1;
	Если ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог
		ИЛИ ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогСам
		ИЛИ ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогАкт Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Сумма) КАК СуммаПеречислено
		|ИЗ ВТНалогПеречисленный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцНалоговогоПериода,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ПлатежноеПоручениеДата,
		|	""ХХХХХХХХХХХ"" КАК ПлатежноеПоручениеНомер,
		|	0 КАК Сумма";
		
		Результат = Запрос.ВыполнитьПакет();
		
		Выборка = Результат[0].Выбрать();
		Если Выборка.Следующий() Тогда
#Удаление
			СуммаКРаспределению = Макс(Объект.СуммаДокумента - Выборка.СуммаПеречислено, 0);
#КонецУдаления
#Вставка
			СуммаКРаспределению = Макс(Объект.СуммаДокумента - ?(ЗначениеЗаполнено(Выборка.СуммаПеречислено),Выборка.СуммаПеречислено,0), 0);
#КонецВставки
		Иначе
			СуммаКРаспределению = 0;
		КонецЕсли;
		
		Если СуммаКРаспределению <> 0 Тогда
			
			ПеречисленныйНалог = Результат[1].Выгрузить();
			СтрокаПеречисления = ПеречисленныйНалог.Добавить();
			СтрокаПеречисления.МесяцНалоговогоПериода = МесяцНалоговогоПериода(Объект.ПоказательОснования, Объект.ПоказательПериода);
			СтрокаПеречисления.ПлатежноеПоручениеДата = ?(ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента), Объект.ДатаВходящегоДокумента, Объект.ДатаПроведенияБанком);
			СтрокаПеречисления.ПлатежноеПоручениеНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
				?(ЗначениеЗаполнено(Объект.НомерВходящегоДокумента), Объект.НомерВходящегоДокумента, Объект.Номер), Истина, Истина);
			СтрокаПеречисления.Сумма = СуммаКРаспределению;
			
			НоваяСтрока = УчетНДФЛ.СтрокаУплатыНалоговогоАгента(Объект.Движения, Объект.Организация, Объект.ДатаПроведенияБанком, ВидДвиженияНакопления.Приход, СтрокаПеречисления);
			НоваяСтрока.РеквизитыПлатежногоПоручения = УчетНДФЛ.РеквизитыПлатежногоПорученияПоДатеНомеру(СтрокаПеречисления.ПлатежноеПоручениеДата, СтрокаПеречисления.ПлатежноеПоручениеНомер);
			
			Если ЗначениеЗаполнено(Объект.Субконто2) Тогда
				НоваяСтрока.РегистрацияВНалоговомОргане = Объект.Субконто2;
			ИначеЕсли ЗначениеЗаполнено(Объект.РегистрацияВНалоговомОргане) Тогда
				НоваяСтрока.РегистрацияВНалоговомОргане = Объект.РегистрацияВНалоговомОргане;
			Иначе
				НоваяСтрока.РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(Объект.Организация, Объект.ДатаПроведенияБанком);
			КонецЕсли;
			
			НоваяСтрока.ДатаПлатежа = Объект.ДатаПроведенияБанком;
			
			Объект.Движения.УплатаНДФЛНалоговымиАгентамиКРаспределению.Записать();
			Объект.Движения.УплатаНДФЛНалоговымиАгентамиКРаспределению.Записывать = Ложь;
			
			УчетНДФЛ.СформироватьПеречисленныйНалогПоФизическимЛицам(Объект.Ссылка, Объект.Движения, Отказ, Объект.Организация, Объект.ДатаПроведенияБанком, , НоваяСтрока.РегистрацияВНалоговомОргане, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


//&Вместо("ЗаполнитьТекстНазначенияПлатежа")
//Процедура ВИЛС_ЗаполнитьТекстНазначенияПлатежа(Объект) Экспорт
//	
//	ТекстНазначение = "";
//	
//	Если ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) Тогда
//		ТекстНазначение = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(
//			Объект.БанковскийСчетКонтрагента).ТекстНазначения;
//	КонецЕсли;
//	
//	Если ТекстНазначение = "" Тогда
//		//++ НЕ УТ
//		Если Объект.ПлатежиПо275ФЗ И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
//			ТекстНазначение = НазначениеПлатежаФЗ275(Объект);
//		Иначе
//		//-- НЕ УТ
//			ТекстНазначение = НазначениеПлатежа(Объект);
//		//++ НЕ УТ
//		КонецЕсли;
//		//-- НЕ УТ
//	Иначе
//		ТекстСумма = "Сумма " + Формат(Объект.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
//		ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Валюта, Объект.РасшифровкаПлатежа, Истина);
//		ТекстНазначение = ?(ЗначениеЗаполнено(Объект.Комментарий),СокрЛП(Объект.Комментарий),"");
//		ТекстНазначение = ТекстНазначение + Символы.ПС + ТекстСумма + Символы.ПС + ТекстСуммаНДС;
//	КонецЕсли;
//	
//	Объект.НазначениеПлатежа = ТекстНазначение;
//	
//КонецПроцедуры      

//&Вместо("НазначениеПлатежа")
//Функция ВИЛС_НазначениеПлатежа(Объект)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить(, "Заказ, Сумма, СтавкаНДС, СуммаНДС");
//	ТаблицаДокументов = Новый ТаблицаЗначений;
//	ТаблицаДокументов.Колонки.Добавить("Документ", Новый ОписаниеТипов(Документы.ТипВсеСсылки(), "СправочникСсылка.ДоговорыКонтрагентов"));
//	ТаблицаДокументов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
//	Для Сч = 1 По РасшифровкаПлатежа.Количество() Цикл
//		ТаблицаДокументов.Добавить();
//	КонецЦикла;
//	ТаблицаДокументов.ЗагрузитьКолонку(РасшифровкаПлатежа.ВыгрузитьКолонку("Заказ"), "Документ");
//	ТаблицаДокументов.ЗагрузитьКолонку(РасшифровкаПлатежа.ВыгрузитьКолонку("Сумма"), "Сумма");
//	
//	Запрос = Новый Запрос("
//	|ВЫБРАТЬ
//	|	ИсходнаяТаблица.Документ    КАК Документ,
//	|	ИсходнаяТаблица.Сумма       КАК Сумма
//	|
//	|ПОМЕСТИТЬ ТаблицаДокументов
//	|ИЗ
//	|	&ТаблицаДокументов КАК ИсходнаяТаблица
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Документ
//	|;
//	|/////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ЗаказКлиента КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерПоДаннымПоставщика       КАК Номер,
//	|	ДанныеДокумента.ДатаПоДаннымПоставщика        КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ЗаказПоставщику КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
//	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ОтчетКомиссионера КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ОтчетКомитенту КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ОтчетКомитентуОСписании КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
//	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
//	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ПриобретениеУслугПрочихАктивов КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.Номер                         КАК Номер,
//	|	ДанныеДокумента.Дата                          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ЛОЖЬ                                          КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерДекларации               КАК Номер,
//	|	НЕОПРЕДЕЛЕНО                                  КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ТаможеннаяДекларацияИмпорт КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер
//	|	
//	//++ НЕ УТ
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерВходящегоДокумента       КАК Номер,
//	|	ДанныеДокумента.ДатаВходящегоДокумента        КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ОтчетОператораСистемыПлатон КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокумента.Ссылка                        КАК Документ,
//	|	ДанныеДокумента.Организация.Префикс           КАК Префикс,
//	|	ДанныеДокумента.НомерПоДаннымПартнера         КАК Номер,
//	|	ДанныеДокумента.ДатаПоДаннымПартнера          КАК Дата,
//	|	СУММА(ТаблицаДокументов.Сумма)                КАК Сумма,
//	|	ИСТИНА                                        КАК НомерВходящегоДокумента
//	|ИЗ
//	|	Документ.ОтчетПереработчика КАК ДанныеДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
//	|		ПО ТаблицаДокументов.Документ = ДанныеДокумента.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.Организация.Префикс,
//	|	ДанныеДокумента.Номер,
//	|	ДанныеДокумента.Дата
//	//-- НЕ УТ
//	|	
//	|");
//	
//	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
//	Выборка = Запрос.Выполнить().Выбрать();
//	СуммаКРаспределению = Объект.РасшифровкаПлатежа.Итог("Сумма");
//	ТекстНазначенияПлатежа = "";
//	ПредставленияДокументов = ПолучитьПредставленияДокументов();
//	
//	РеквизитыВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Валюта, "Код, Наименование");
//	Если РеквизитыВалюты.Код = "643" Тогда
//		ВалютаДляПечати = НСтр("ru = 'руб.'");
//	Иначе
//		ВалютаДляПечати = СокрЛП(РеквизитыВалюты.Наименование);
//	КонецЕсли;
//	
//	Пока Выборка.Следующий() Цикл
//		Если ТипЗнч(Выборка.Документ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
//			ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", "
//			+ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Документ, "НаименованиеДляПечати");
//			//fix + " " + Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
//			//fix + " " + ВалютаДляПечати;
//		Иначе
//			ВидДокумента = "";
//			ПредставленияДокументов.Свойство(Выборка.Документ.Метаданные().Имя, ВидДокумента);
//			Если ЗначениеЗаполнено(ВидДокумента) Тогда
//				ПредставлениеДляПечати = НСтр("ru = '%Вид% №%Номер% от %Дата% %Сумма% %Валюта%'");
//				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Вид%", ВидДокумента);
//				Если Выборка.НомерВходящегоДокумента Тогда
//					ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Номер%", СокрЛП(Выборка.Номер));
//				Иначе
//					ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Номер%",
//						ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Ложь, Истина));
//				КонецЕсли;
//				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Дата%", Формат(Выборка.Дата, "ДЛФ=D"));
//				//fix ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Сумма%",
//				//fix	Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
//				//fix ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Валюта%", ВалютаДляПечати);
//				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Сумма%",
//					"");
//				ПредставлениеДляПечати = СтрЗаменить(ПредставлениеДляПечати, "%Валюта%", "");
//				
//				ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", " + ПредставлениеДляПечати;
//			КонецЕсли;
//		КонецЕсли;
//		СуммаКРаспределению = СуммаКРаспределению - Выборка.Сумма;
//	КонецЦикла;
//	
//	Если СуммаКРаспределению > 0 Тогда
//		ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ", "
//			+ НСтр("ru = 'без указания назначения'");
//			//fix + " " + Формат(СуммаКРаспределению, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")
//			//fix + " " + ВалютаДляПечати;
//	КонецЕсли;
//	Если СуммаКРаспределению <= 0 Тогда
//		ТекстНазначенияПлатежа = НСтр("ru = 'Оплата по'") + Сред(ТекстНазначенияПлатежа, 2);
//	Иначе
//		ТекстНазначенияПлатежа = НСтр("ru = 'Оплата'") + Сред(ТекстНазначенияПлатежа, 2);
//	КонецЕсли;
//	
//	Если Прав(ТекстНазначенияПлатежа, 1) <> "." Тогда
//		ТекстНазначенияПлатежа = ТекстНазначенияПлатежа + ".";
//	КонецЕсли;
//	ДлинаТекстаДокументов = СтрДлина(ТекстНазначенияПлатежа);
//	
//	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(
//		Объект.Валюта,
//		РасшифровкаПлатежа,
//		Истина);
//	ДлинаТекстаНДС = СтрДлина(ТекстСуммаНДС);
//	
//	Если ДлинаТекстаДокументов + ДлинаТекстаНДС > 210 Тогда
//		ДлинаТекстаДокументов = 207 - ДлинаТекстаНДС;
//		ТекстНазначенияПлатежа = Лев(ТекстНазначенияПлатежа, ДлинаТекстаДокументов);
//		ТекстПоискаПоследнегоДокумента = ТекстНазначенияПлатежа;
//		ПозицияПоследнейЗапятой = 0;
//		ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоДокумента, ",");
//		Пока НЕ ПозицияЗапятой = 0 Цикл
//			ПозицияПоследнейЗапятой = ПозицияПоследнейЗапятой + ПозицияЗапятой;
//			ТекстПоискаПоследнегоДокумента = Сред(ТекстПоискаПоследнегоДокумента, ПозицияЗапятой + 1);
//			ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоДокумента, ",");
//		КонецЦикла;
//		ТекстНазначенияПлатежа = Лев(ТекстНазначенияПлатежа, ПозицияПоследнейЗапятой - 1) + "...";
//	КонецЕсли;
//	ТекстНазначенияПлатежа = СокрЛП(ТекстНазначенияПлатежа)+?(ЗначениеЗаполнено(Объект.Комментарий)," "+СокрЛП(Объект.Комментарий)+" ","") + Символы.ПС + СокрЛП(ТекстСуммаНДС);
//	
//	Если ПривилегированныйРежим() Тогда
//		УстановитьПривилегированныйРежим(Ложь);
//	КонецЕсли;
//	
//	Возврат ТекстНазначенияПлатежа;
//	
//КонецФункции

//end fix КлещАН 19.10.2018
