#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ТаблицаПравилРасчетаПоказателей")	
Функция ВИЛС_ТаблицаПравилРасчетаПоказателей(ПараметрыОтчета)
	
	// Счета учета финансирования
	СчетаУчетаРасчетыСКлиентами = СчетаУчетаРасчетыСКлиентами();
	СчетаУчетаКредитыИЗаймы = СчетаУчетаКредитыИЗаймы();
	СчетаУчетаПроцентыПоКредитамИЗаймам = СчетаУчетаПроцентыПоКредитамИЗаймам();
	СчетаУчетаЗадолженностьПередПоставщиками = СчетаУчетаЗадолженностьПередПоставщиками();
	
	// Счета учета денежных средств
	СчетаУчетаДенеженыеСредстваНаСчетах = СчетаУчетаДенеженыеСредстваНаСчетах();
	СчетаУчетаДепозиты = СчетаУчетаДепозиты();
	СчетаУчетаАвансыВыданныеПоставщикам = СчетаУчетаАвансыВыданныеПоставщикам();
	СчетаУчетаДенежныхСредстваВПути = СчетаУчетаДенежныхСредстваВПути();
	
	// Счета учета запасов
	СчетаУчетаМатериалыНаСкадах = СчетаУчетаМатериалыНаСкадах();
	СчетаУчетаНДСВходящий = СчетаУчетаНДСВходящий();
	СчетаУчетаПолуфабрикатыНаСкладах = СчетаУчетаПолуфабрикатыНаСкладах();
	СчетаУчетаМатериалыВПереработчике = СчетаУчетаМатериалыВПереработчике();
	СчетаУчетаРасходыБудущихПериодов = СчетаУчетаРасходыБудущихПериодов();
	СчетаУчетаСредстваПроизводства = СчетаУчетаСредстваПроизводства();
	
	// Счета учета производства
	СчетаУчетаПроизводство = СчетаУчетаПроизводство();
	СчетаУчетаОбщепроизводственныеЗатраты = СчетаУчетаОбщепроизводственныеЗатраты();
	СчетаУчетаОбщехозяйственныеЗатраты = СчетаУчетаОбщехозяйственныеЗатраты();
	
	СчетаУчетаГотоваяПродукция = СчетаУчетаГотоваяПродукция();
	
	КорСчетаУчетаПрочихПроизводственныхЗатрат = КорСчетаУчетаПрочихПроизводственныхЗатрат();
	
	// Продажи
	СчетаУчетаНДССПродаж = СчетаУчетаНДССПродаж();
	СчетаУчетаНДССАвансовКлиентам = СчетаУчетаНДССАвансовКлиентам();
	СчетаУчетаНДССАвансовПоставщикам = СчетаУчетаНДССАвансовПоставщикам();
	СчетаУчетаРасчетовПоНДС = СчетаУчетаРасчетовПоНДС();
	СчетаУчетаУправленческихРасходов = СчетаУчетаУправленческихРасходов();
	СчетаУчетаКоммерческиеРасходы = СчетаУчетаКоммерческиеРасходы();
	СчетаУчетаВыручкаОтПродаж = СчетаУчетаВыручкаОтПродаж();
	СчетаУчетаСебестоимостьПродаж = СчетаУчетаСебестоимостьПродаж();
	СчетаУчетаПрочиеРасходы = СчетаУчетаПрочиеРасходы();
	СчетаУчетаПрочиеДоходы = СчетаУчетаПрочиеДоходы();
	
	ПравилаРасчетаПоказателей = Новый ТаблицаЗначений;
	ПравилаРасчетаПоказателей.Колонки.Добавить("ГруппаПоказателей1",   Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("ГруппаПоказателей2",   Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("Пассивный",            Новый ОписаниеТипов("Булево"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("КодПоказателя",        Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("ЭтоГруппа",            Новый ОписаниеТипов("Булево"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("Заголовок",            Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("ЦелевойПараметр",      Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("Обороты",              Новый ОписаниеТипов("СписокЗначений"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("ПоказателиРеглОтчета", Новый ОписаниеТипов("СписокЗначений"));
	
#Область ФинансированиеКонтракта

	// 100 "Финансирование контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя      = "100";
	НовоеПравило.ЭтоГруппа          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Финансирование контракта';
									|en = 'Contract funding'");
	НовоеПравило.ЦелевойПараметр = "ОбъемФинансированияКонтракта";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000001000001, П000001000002, П000001000003");
	
	// 101 "Средства, полученные от заказчика"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя      = "101";
	НовоеПравило.Пассивный          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Средства, полученные от заказчика';
									|en = 'Funds received from the customer'");
	НовоеПравило.ЦелевойПараметр = "ОбъемФинансированияКонтракта";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000001100001, П000001100002, П000001100003, П000001100004, П000001100006, П000001100007");
	
	ИсключаемыеКорСчета = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКорСчета, СчетаУчетаВыручкаОтПродаж);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКорСчета, СчетаУчетаРасчетыСКлиентами);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКорСчета, СчетаУчетаПрочиеРасходы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКорСчета, СчетаУчетаПрочиеДоходы);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасчетыСКлиентами;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ИсключаемыйКорСчет = ИсключаемыеКорСчета;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 102 "Кредиты банка"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя = "102";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Кредиты банка';
									|en = 'Bank credits'");
	НовоеПравило.ЦелевойПараметр = "ОбъемКредитования";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000001200001, П000001200002, П000001200003, П000001200004, П000001200006, П000001200007");
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаКредитыИЗаймы;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 102 "Задолженность по процентам по кредитам"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя = "103";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Задолженность по процентам по кредитам';
									|en = 'Interest debt under credits'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000001300003, П000001300004, П000001300006, П000001300007");
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроцентыПоКредитамИЗаймам;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 104 "Задолженность перед поставщиками"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя = "104";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Задолженность перед поставщиками';
									|en = 'Accounts payable'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000001400003, П000001400004, П000001400005, П000001400006, П000001400007");
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаЗадолженностьПередПоставщиками;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
#КонецОбласти
	
#Область РаспределениеСредствКонтракта

	// 200 "Распределение ресурсов контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя      = "200";
	НовоеПравило.ЭтоГруппа          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Распределение ресурсов контракта';
									|en = 'Allocation of contract resources'");
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002000003");

	#Область ДенежныеСредства
	
	// 210 "Денежные средства"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя      = "210";
	НовоеПравило.ЭтоГруппа          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Распределение ресурсов контракта';
									|en = 'Allocation of contract resources'");
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002100003, П000002100004, П000002100005, П000002100006, П000002100007, П000002100008, П000002100009");
	
	// 211 "Денежные средства на отдельных счетах"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя = "211";
	НовоеПравило.Заголовок = НСтр("ru = 'Денежные средства на отдельных счетах';
									|en = 'Cash on separate accounts'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002110003, П000002110004, П000002110006, П000002110007, П000002110008, П000002110009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаДенеженыеСредстваНаСчетах;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ИсключаемыйКорСчет = СчетаУчетаДенежныхСредстваВПути;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаДенеженыеСредстваНаСчетах;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаДенежныхСредстваВПути;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);

	// 212 "Денежные средства на депозитах в банке"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя = "212";
	НовоеПравило.Заголовок = НСтр("ru = 'Денежные средства на депозитах в банке';
									|en = 'Cash on deposit bank accounts'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002120003, П000002120004, П000002120007");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаДепозиты;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 213 "Авансы, выданные поставщикам"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя = "213";
	НовоеПравило.Заголовок = НСтр("ru = 'Авансы, выданные поставщикам';
									|en = 'Advance payments to suppliers'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002130003, П000002130004, П000002130005, П000002130006, П000002130007, П000002130009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаАвансыВыданныеПоставщикам;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	#КонецОбласти
	
	#Область Запасы
	
	// 220 "Запасы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя      = "220";
	НовоеПравило.ЭтоГруппа          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Запасы';
									|en = 'Inventory'");
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002200003, П000002200004, П000002200005, П000002200006, П000002200007, П000002200008, П000002200009");
	
	// 221 "Материалы на складах"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "221";
	НовоеПравило.Заголовок = НСтр("ru = 'Материалы на складах';
									|en = 'Materials in warehouses'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002210003, П000002210004, П000002210005, П000002210006, П000002210007, П000002210008, П000002210009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаМатериалыНаСкадах;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 222 "НДС входящий"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "222";
	НовоеПравило.Заголовок = НСтр("ru = 'НДС входящий';
									|en = 'Incoming VAT'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002220003, П000002220004, П000002220007, П000002220009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДСВходящий;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 223 "Полуфабрикаты на складах"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "223";
	НовоеПравило.Заголовок = НСтр("ru = 'Полуфабрикаты на складах';
									|en = 'Semi-finished products at warehouses'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002230003, П000002230004, П000002230005, П000002230006, П000002230007, П000002230008, П000002230009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПолуфабрикатыНаСкладах;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 224 "Материалы, переданные в переработку"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "224";
	НовоеПравило.Заголовок = НСтр("ru = 'Материалы, переданные в переработку';
									|en = 'Materials transferred to tolling'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002240003, П000002240004, П000002240007, П000002240009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаМатериалыВПереработчике;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 225 "Расходы будущих периодов"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "225";
	НовоеПравило.Заголовок = НСтр("ru = 'Расходы будущих периодов';
									|en = 'Deferred expenses'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002250003, П000002250004, П000002250007");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасходыБудущихПериодов;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	//begin fix Клещ А.Н. 14.10.2019 
	МассивИсключаемыхСчетов = Новый Массив;
	МассивИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	МассивИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	ОтборОборотов.ИсключаемыйКорСчет = МассивИсключаемыхСчетов;
	//end fix Клещ А.Н. 14.10.2019
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 226 "Средства производства"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "226";
	НовоеПравило.Заголовок = НСтр("ru = 'Средства производства';
									|en = 'Production means'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002260003, П000002260004, П000002260005, П000002260006, П000002260007, П000002260008, П000002260009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаСредстваПроизводства;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	#КонецОбласти
	
	#Область Производство
	
	// 230 "Производство"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя      = "230";
	НовоеПравило.ЭтоГруппа          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Производство';
									|en = 'Manufacturing'");
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002300003, П000002300004, П000002300005, П000002300006, П000002300007, П000002300008, П000002300009");
	
	// 231 "Затраты на материалы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "231";
	НовоеПравило.Заголовок = НСтр("ru = 'Затраты на материалы';
									|en = 'Material costs'");
	НовоеПравило.ЦелевойПараметр = "ЗатратыНаМатериалы";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002310001, П000002310002, П000002310003, П000002310004, П000002310005, П000002310006, П000002310007, П000002310008, П000002310009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.МатериальныеЗатраты;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыНаСкадах;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.МатериальныеЗатраты;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыВПереработчике;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаГотоваяПродукция;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыВПереработчике;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.МатериальныеЗатраты;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	ОтборОборотов.КорНаправлениеДеятельности = "КонтрактыГОЗ";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.МатериальныеЗатраты;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	ОтборОборотов.КорНаправлениеДеятельности = "ИнаяДеятельность";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	//begin fix Клещ А.Н. 15.10.2019  
	ОтборОборотов = ОтборОборотов();
	
	МассивСчетов20 = Новый Массив;
	МассивСчетов20.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	ОтборОборотов.Счет = МассивСчетов20;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	МассивСчетов21 = Новый Массив;
	МассивСчетов21.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	ОтборОборотов.КорСчет = МассивСчетов21;
	//ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	//end fix Клещ А.Н. 15.10.2019
	
	// 232 "Затраты на оплату труда"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "232";
	НовоеПравило.Заголовок = НСтр("ru = 'Затраты на оплату труда';
									|en = 'Labor compensation costs'");
	НовоеПравило.ЦелевойПараметр = "ЗатратыНаОплатуТруда";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002320001, П000002320002, П000002320003, П000002320006");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ТипыЗатрат = Новый Массив;
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.СдельнаяОплатаТруда);
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.Прочее);
	ОтборОборотов.Субконто1 = ТипыЗатрат;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасчетыПоОплатеТруда();
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ТипыЗатрат = Новый Массив;
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.СдельнаяОплатаТруда);
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.Прочее);
	ОтборОборотов.Субконто1 = ТипыЗатрат;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРезервовОтпусков();
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	//begin fix Клещ А.Н. 14.10.2019  
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ТипыЗатрат = Новый Массив;
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.СдельнаяОплатаТруда);
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.Прочее);
	ОтборОборотов.Субконто1 = ТипыЗатрат;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасходыБудущихПериодов;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	//end fix Клещ А.Н. 14.10.2019
	
	// 233 "Прочие производственные затраты"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "233";
	НовоеПравило.Заголовок = НСтр("ru = 'Прочие производственные затраты';
									|en = 'Other manufacturing costs'");
	НовоеПравило.ЦелевойПараметр = "ПрочиеПроизводственныеЗатраты";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002330001, П000002330002, П000002330003, П000002330004, П000002330005, П000002330006, П000002330007, П000002330008, П000002330009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыНаСкадах;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыВПереработчике;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = КорСчетаУчетаПрочихПроизводственныхЗатрат;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	ОтборОборотов.КорНаправлениеДеятельности = "КонтрактыГОЗ";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	ОтборОборотов.КорНаправлениеДеятельности = "ИнаяДеятельность";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасходыБудущихПериодов;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ТипыЗатрат = Новый Массив;
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.Работы);
	ТипыЗатрат.Добавить(Перечисления.ТипыЗатратРегл.Прочее);
	ОтборОборотов.Субконто1 = ТипыЗатрат;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаЗадолженностьПередПоставщиками;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 234 "Общепроизводственные затраты"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "234";
	НовоеПравило.Заголовок = НСтр("ru = 'Общепроизводственные затраты';
									|en = 'General manufacturing costs'");
	НовоеПравило.ЦелевойПараметр = "ОбщепроизводственныеЗатраты";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002340001, П000002340002, П000002340003, П000002340006");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.КорСчет = СчетаУчетаОбщепроизводственныеЗатраты;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 235 "Общехозяйственные затраты"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "235";
	НовоеПравило.Заголовок = НСтр("ru = 'Общехозяйственные затраты';
									|en = 'General business costs'");
	НовоеПравило.ЦелевойПараметр = "ОбщехозяйственныеЗатраты";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002350001, П000002350002, П000002350003, П000002350006");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.Прочее;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаОбщехозяйственныеЗатраты;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 236 "Полуфабрикаты собственного производства, внутренние работы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "236";
	НовоеПравило.Заголовок = НСтр("ru = 'Полуфабрикаты собственного производства, внутренние работы';
									|en = 'Own-produced semi-finished products, in-house works'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002360003, П000002360004");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.Субконто1 = Перечисления.ТипыЗатратРегл.МатериальныеЗатраты;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПолуфабрикатыНаСкладах;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(Перечисления.ТипыЗатратРегл.Работы);
	МассивСубконто.Добавить(Перечисления.ТипыЗатратРегл.МатериальныеЗатраты);
	ОтборОборотов.Субконто1 = МассивСубконто;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.ИзменяетсяПодразделение = Истина;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 237 "Выпуск полуфабрикатов, внутренних работ"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "237";
	НовоеПравило.Заголовок = НСтр("ru = 'Выпуск полуфабрикатов, внутренних работ';
									|en = 'Release of semi-finished products, in-house works'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002370003, П000002370007");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПолуфабрикатыНаСкладах;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыНаСкадах;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	МассивКорСубконто = Новый Массив;
	МассивКорСубконто.Добавить(Перечисления.ТипыЗатратРегл.Работы);
	МассивКорСубконто.Добавить(Перечисления.ТипыЗатратРегл.МатериальныеЗатраты);
	ОтборОборотов.КорСубконто1 = МассивКорСубконто;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
	ОтборОборотов.ИзменяетсяПодразделение = Истина;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 238 "Выпуск продукции"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "238";
	НовоеПравило.Заголовок = НСтр("ru = 'Выпуск продукции';
									|en = 'Product release'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002380003, П000002380007");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаГотоваяПродукция;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаСебестоимостьПродаж;
	ОтборОборотов.КорНаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	#КонецОбласти
	
	#Область ГотоваяПродукцияНаСкладе
	
	// 240 "Готовая продукция на складе"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "240";
	НовоеПравило.КодПоказателя = "241";
	НовоеПравило.Заголовок = НСтр("ru = 'Готовая продукция на складе';
									|en = 'Finished products in warehouse'");
	НовоеПравило.ЦелевойПараметр = "";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000002400003, П000002400004, П000002400005, П000002400006, П000002400007, П000002400008, П000002400009");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаГотоваяПродукция;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	#КонецОбласти
	
#КонецОбласти

#Область ОтгрузкаПродукцииВыполнениеРабот

	// 300 Отгрузка продукции, выполнение работ"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "301";
	НовоеПравило.КодПоказателя = "301";
	НовоеПравило.Заголовок = НСтр("ru = 'Отгрузка продукции, выполнение работ';
									|en = 'Product shipment, work performance'");
	НовоеПравило.ЦелевойПараметр = "ОбъемФинансированияКонтракта";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003000001, П000003000002, П000003000003");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаВыручкаОтПродаж;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// Корректировки, реализации материалов
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеДоходы;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
	ОтборОборотов.КорСчет = СчетаУчетаРасчетыСКлиентами;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);

	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасчетыСКлиентами;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
	ОтборОборотов.КорСчет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 310 "Себестоимость реализованной продукции"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "310";
	НовоеПравило.КодПоказателя = "310";
	НовоеПравило.Заголовок = НСтр("ru = 'Себестоимость реализованной продукции';
									|en = 'Sold goods cost'");
	НовоеПравило.ЦелевойПараметр = "Затраты";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003100001, П000003100002, П000003100003, П000003100004, П000003100006");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаСебестоимостьПродаж;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// Ошибки округления, корректировки реализации и реализации материалов, полуфабрикатов, списания задолженности
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПроизводство;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПроизводство;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПрочиеДоходы;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыНаСкадах;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаМатериалыВПереработчике;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаСредстваПроизводства;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПолуфабрикатыНаСкладах;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаГотоваяПродукция;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаАвансыВыданныеПоставщикам;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// Курсовые разницы
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаЗадолженностьПередПоставщиками;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 320 "Управленческие расходы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "320";
	НовоеПравило.КодПоказателя = "320";
	НовоеПравило.Заголовок = НСтр("ru = 'Административно - управленческие расходы';
									|en = 'Administrative and management expenses'");
	НовоеПравило.ЦелевойПараметр = "УправленческиеРасходы";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003200001, П000003200002, П000003200003, П000003200006");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаУправленческихРасходов;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 330 "Коммерческие расходы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "330";
	НовоеПравило.КодПоказателя = "330";
	НовоеПравило.Заголовок = НСтр("ru = 'Коммерческие расходы';
									|en = 'Selling expenses '");
	НовоеПравило.ЦелевойПараметр = "КоммерческиеРасходы";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003300001, П000003300002, П000003300003, П000003300004");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаПроизводства();//FIX Клещ А.Н. СчетаУчетаКоммерческиеРасходы;
	ОтборОборотов.КорСчет   = ПолучитьСчетКоммерческиеРасходы();
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";

	
	//	ОтборОборотов.Счет = ПолучитьСчетРасходовНаПродажу();//FIX Клещ А.Н.СчетаУчетаКоммерческиеРасходы;
	//ОтборОборотов.КорСчет   = ПолучитьСчетКоммерческиеРасходы();
	//ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	////ОтборОборотов.НаправлениеДеятельности = "Контракт";
	//ОтборОборотов.КорНаправлениеДеятельности = "Контракт";//FIX Клещ А.Н.ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 340 "Проценты по кредитам банка"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "340";
	НовоеПравило.КодПоказателя = "340";
	НовоеПравило.Заголовок = НСтр("ru = 'Проценты по кредитам банка';
									|en = 'Bank loan interest'");
	НовоеПравило.ЦелевойПараметр = "ПроцентыПоКредитам";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003400001, П000003400002, П000003400003, П000003400004");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.КорСчет   = СчетаУчетаПроцентыПоКредитамИЗаймам;
	ОтборОборотов.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	// 350 "НДС с выручки от продаж"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "350";
	НовоеПравило.КодПоказателя = "350";
	НовоеПравило.Заголовок = НСтр("ru = 'НДС с выручки от продаж';
									|en = 'VAT from sales revenue'");
	НовоеПравило.ЦелевойПараметр = "СуммаНДС";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003500003, П000003500006");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДССПродаж;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПрочиеДоходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	#Область НДССАвансов
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДССАвансовКлиентам;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.Множитель = 1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаНДССАвансовКлиентам;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДССАвансовПоставщикам;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.Множитель = 1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаНДССАвансовПоставщикам;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	#КонецОбласти
	
	// 360 "Прибыль контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "360";
	НовоеПравило.КодПоказателя = "360";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Прибыль контракта';
									|en = 'Contract profit'");
	НовоеПравило.ЦелевойПараметр = "ПрибыльКонтракта";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000003600001, П000003600002, П000003600003");
	
	МассивОтборовОборотов = Новый Массив;
	//+ Выручка
	ПравилоВыручка = ПравилаРасчетаПоказателей.Найти("301", "КодПоказателя");
	Для каждого Оборот Из ПравилоВыручка.Обороты Цикл
		ОтборОборотов = ОтборОборотов();
		ЗаполнитьЗначенияСвойств(ОтборОборотов, Оборот.Значение);
		МассивОтборовОборотов.Добавить(ОтборОборотов);
	КонецЦикла;
	//- Себестоимость готовой продукции/работ
	ПравилоСебестоимость = ПравилаРасчетаПоказателей.Найти("320", "КодПоказателя");
	Для каждого Оборот Из ПравилоСебестоимость.Обороты Цикл
		ОтборОборотов = ОтборОборотов();
		ЗаполнитьЗначенияСвойств(ОтборОборотов, Оборот.Значение);
		ОтборОборотов.Множитель = ОтборОборотов.Множитель * (-1);
		МассивОтборовОборотов.Добавить(ОтборОборотов);
	КонецЦикла;
	//- Управленческие расходы 
	ПравилоУправленческиеРасходы = ПравилаРасчетаПоказателей.Найти("330", "КодПоказателя");
	Для каждого Оборот Из ПравилоУправленческиеРасходы.Обороты Цикл
		ОтборОборотов = ОтборОборотов();
		ЗаполнитьЗначенияСвойств(ОтборОборотов, Оборот.Значение);
		ОтборОборотов.Множитель = ОтборОборотов.Множитель * (-1);
		МассивОтборовОборотов.Добавить(ОтборОборотов);
	КонецЦикла;
	//- Коммерческие расходы 
	ПравилоКоммерческиеРасходы = ПравилаРасчетаПоказателей.Найти("340", "КодПоказателя");
	Для каждого Оборот Из ПравилоКоммерческиеРасходы.Обороты Цикл
		ОтборОборотов = ОтборОборотов();
		ЗаполнитьЗначенияСвойств(ОтборОборотов, Оборот.Значение);
		ОтборОборотов.Множитель = ОтборОборотов.Множитель * (-1);
		МассивОтборовОборотов.Добавить(ОтборОборотов);
	КонецЦикла;
	//- Проценты по кредитам банка
	ПравилоПроцентыПоКредитам = ПравилаРасчетаПоказателей.Найти("350", "КодПоказателя");
	Для каждого Оборот Из ПравилоПроцентыПоКредитам.Обороты Цикл
		ОтборОборотов = ОтборОборотов();
		ЗаполнитьЗначенияСвойств(ОтборОборотов, Оборот.Значение);
		ОтборОборотов.Множитель = ОтборОборотов.Множитель * (-1);
		МассивОтборовОборотов.Добавить(ОтборОборотов);
	КонецЦикла;
	
	Для каждого ОтборОборотов Из МассивОтборовОборотов Цикл
		Если ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт Тогда
			ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
		ИначеЕсли ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.ОборотКт Тогда
			ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
		КонецЕсли;
		ДобавитьОборот(НовоеПравило, ОтборОборотов);
	КонецЦикла;
	
	//- НДС с выручки от продаж
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДССПродаж;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаПрочиеРасходы;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаРасчетовПоНДС;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.КорСчет = СчетаУчетаПрочиеДоходы;
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
	ОтборОборотов.Множитель = 1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДССАвансовКлиентам;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
	ОтборОборотов.Множитель = -1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаНДССАвансовПоставщикам;
	ОтборОборотов.НаправлениеДеятельности = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
	ОтборОборотов.Множитель = 1;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	#КонецОбласти
	
	// 400 "(+) Привлечение ресурсов в контракт / (-) Перенаправление ресурсов контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "400";
	НовоеПравило.ГруппаПоказателей2 = "400";
	НовоеПравило.КодПоказателя      = "400";
	НовоеПравило.ЭтоГруппа          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = '(+) Привлечение ресурсов в контракт / (-) Перенаправление ресурсов контракта';
									|en = '(+) Raise resources to contract / (-) Forward contract resources'");
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000004000003, П000004000005, П000004000006, П000004000008, П000004000009");
	
	// 500 "Средства, списанные в счет прибыли контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "501";
	НовоеПравило.КодПоказателя = "501";
	НовоеПравило.Заголовок = НСтр("ru = 'Средства, списанные в счет прибыли контракта';
									|en = 'Funds written off to contract profit account'");
	НовоеПравило.ЦелевойПараметр = "СписаниеДенежныхСредствСОтдельногоСчета";
	ДобавитьПоказателиРеглОтчета(НовоеПравило, "П000005000001, П000005000002, П000005000003");
	
	ОтборОборотов = ОтборОборотов();
	ОтборОборотов.Счет = СчетаУчетаДенеженыеСредстваНаСчетах;
	ОтборОборотов.НаправлениеДеятельности    = "Контракт";
	ОтборОборотов.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
	ТипыПлатежейФЗ275 = Новый Массив;
	ТипыПлатежейФЗ275.Добавить(Справочники.ТипыПлатежейФЗ275.ПеречислениеПрибылиГоловномуИсполнителю);
	ТипыПлатежейФЗ275.Добавить(Справочники.ТипыПлатежейФЗ275.ПеречисленияПрибылиИсполнителю);
	ТипыПлатежейФЗ275.Добавить(Справочники.ТипыПлатежейФЗ275.СписаниеНаВозмещениеЗатратЗаСчетСобственныхСредств);
	ТипыПлатежейФЗ275.Добавить(Справочники.ТипыПлатежейФЗ275.ПеречислениеДенежныхСредствПослеЗавершенияГосконтракта);
	ОтборОборотов.ТипыПлатежейФЗ275 = ТипыПлатежейФЗ275;
	ДобавитьОбороты(НовоеПравило, ОтборОборотов, ПараметрыОтчета.Детализация);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.КодПоказателя) Тогда
		ПравилаКУдалению = Новый Массив;
		Для каждого Правило Из ПравилаРасчетаПоказателей Цикл
			Если Правило.ГруппаПоказателей1 <> ПараметрыОтчета.КодПоказателя
				 И Правило.ГруппаПоказателей2 <> ПараметрыОтчета.КодПоказателя
				 И Правило.КодПоказателя <> ПараметрыОтчета.КодПоказателя Тогда
				ПравилаКУдалению.Добавить(Правило);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Правило Из ПравилаКУдалению Цикл
			ПравилаРасчетаПоказателей.Удалить(Правило);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПравилаРасчетаПоказателей;
	
КонецФункции

Функция ПолучитьСчетРасходовНаПродажу()
	
	Результат = Новый Массив ;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетКоммерческиеРасходы()
	
	Результат = Новый Массив ;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.КоммерческиеРасходы);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетСебестоимостьПродажНеЕНВД()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажу))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы))
	|";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Результат = ТЗ.ВыгрузитьКолонку("Ссылка") ;
	Возврат Результат;
	
КонецФункции

Функция СчетаПроизводства()
	
Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции
#КонецЕсли