#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	
// begin fix Suetin 12.09.2019 13:04:57 Возможно исправят в будущих релизах...
&ИзменениеИКонтроль("ПередЗаполнениемПанелиБыстрыхНастроек")
Процедура ВИЛС_ПередЗаполнениемПанелиБыстрыхНастроек(ЭтаФорма, ПараметрыЗаполнения)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		#Удаление
		ЭлементыПользовательскихНастроек = ПараметрыЗаполнения.ОтчетОбъектИлиПолноеИмя.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		#КонецУдаления
		#Вставка 
		ЭлементыПользовательскихНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		#КонецВставки
		Для Каждого ЭлементОтбора Из ЭлементыПользовательскихНастроек Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер") Тогда
				ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Контрагент";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
// end fix Suetin 12.09.2019 13:05:20
#КонецОбласти

#КонецЕсли