#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	
// begin fix Suetin 12.09.2019 13:04:57 Возможно исправят в будущих релизах...
&Вместо("ПередЗаполнениемПанелиБыстрыхНастроек")
Процедура ВИЛС_ПередЗаполнениемПанелиБыстрыхНастроек(ЭтаФорма, ПараметрыЗаполнения)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		//#Удаление    // begin fix Suetin 17.09.2019 15:06:09
		//ЭлементыПользовательскихНастроек = ПараметрыЗаполнения.ОтчетОбъектИлиПолноеИмя.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		//#КонецУдаления
		//#Вставка 
		//ЭлементыПользовательскихНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		//#КонецВставки
		Если ТипЗнч(ПараметрыЗаполнения.ОтчетОбъектИлиПолноеИмя) = Тип("Строка") Тогда
			ЭлементыПользовательскихНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		Иначе
			ЭлементыПользовательскихНастроек = ПараметрыЗаполнения.ОтчетОбъектИлиПолноеИмя.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		КонецЕсли;	   // end fix Suetin 17.09.2019 15:06:14
		Для Каждого ЭлементОтбора Из ЭлементыПользовательскихНастроек Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер") Тогда
				ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Контрагент";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
// end fix Suetin 12.09.2019 13:05:20
#КонецОбласти

#КонецЕсли