
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Сотрудник") Тогда 
		
		ВызватьИсключение("Некорректные параметры при вызове формы, не передан сотрудник");
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Сотрудник",Параметры.Сотрудник);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,ВыбраннаяСтрока.ДокументРегистратор);
КонецПроцедуры
