
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_КоличествоШТ", Тип("ПолеФормы"), Элементы.Продукция, Элементы.Продукция.ПодчиненныеЭлементы.УслугиВидЦены); 													 
	ДобавляемыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 			= "Объект.Продукция.ВИЛС_КоличествоШТ";
	ДобавляемыйЭлемент.Заголовок 			= "ШТ";
	
	ДобавляемыйЭлемент = Элементы.Вставить("ДополнительнаяИнформацияПоДоставке", Тип("ПолеФормы"), Элементы.ГруппаДополнительнаяИнформация); 													 
	ДобавляемыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 			= "Объект.ДополнительнаяИнформацияПоДоставке";
	ДобавляемыйЭлемент.Заголовок 			= "Гос. номер автомобиля";
	ДобавляемыйЭлемент.Высота				= 1;
	ДобавляемыйЭлемент.МаксимальнаяВысота	= 1;
	ДобавляемыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
КонецПроцедуры
