
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)   // begin fix Suetin 15.04.2019 10:46:27 ВРЕМЕННО
	Элементы.НомерВходящегоДокумента.Видимость = Истина;
	Элементы.НомерВходящегоДокумента.Доступность = Истина;
	Элементы.ДатаВходящегоДокумента.Видимость = Истина;
	Элементы.ДатаВходящегоДокумента.Доступность = Истина;
	Элементы.ПорядокРасчетов.Видимость = Истина;
	Элементы.ПорядокРасчетов.Доступность = Истина;
КонецПроцедуры                                                          // end fix Suetin 15.04.2019 10:46:36
