#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Если ПравоДоступа("Изменение", Метаданные.Документы.ВИЛС_ИнвентаризацияТМЦВЭксплуатации) Тогда
		
		// Сличительная ведомость (ИНВ-19)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ИнвентаризацияТМЦВЭксплуатации";
		КомандаПечати.Представление = НСтр("ru = 'Инвентаризация ТМЦ в эксплуатации (ВИЛС)';
											|en = 'Inventory of in-service materials (VILS)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
		// Инвентаризационная опись (ИНВ-3)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьИНВ3";
		КомандаПечати.Идентификатор = "ИНВ3";
		КомандаПечати.Представление = НСтр("ru = 'Инвентаризационная опись (ИНВ-3) (ВИЛС)';
											|en = 'Stocktaking sheet (INV-3) (VILS)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
		// begin fix Suetin 13.01.2020 11:42:17
		// Сличительная ведомость (ИНВ-19)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьИНВ19";
		КомандаПечати.Идентификатор = "ИНВ19";
		КомандаПечати.Представление = НСтр("ru = 'Сличительная ведомость (ИНВ-19)';
											|en = 'Inventory reconciliation report (INV-19)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		// end fix Suetin 13.01.2020 11:42:21
	КонецЕсли;
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнвентаризацияТМЦВЭксплуатации") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ИнвентаризацияТМЦВЭксплуатации", НСтр("ru = 'Инвентаризация ТМЦ в эксплуатации'"),
			ПечатьИнвентаризацияТМЦВЭксплуатации(МассивОбъектов, ОбъектыПечати), , "Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.ПФ_MXL_ИнвентаризацияТМЦВЭксплуатации");
	КонецЕсли;
КонецПроцедуры

Функция ПечатьИнвентаризацияТМЦВЭксплуатации(МассивОбъектов, ОбъектыПечати)
	Макет = Документы.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.ПолучитьМакет("ПФ_MXL_ИнвентаризацияТМЦВЭксплуатации");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Дата КАК Дата,
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Номенклатура КАК Номенклатура,
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Номер КАК Номер,
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Организация КАК Организация,
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Подразделение КАК Подразделение,
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.ФизЛицо КАК ФизЛицо,
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Подразделение КАК Подразделение,
	|		ФизЛицо КАК ФизЛицо,
	|		Номенклатура КАК Номенклатура,
	|		КолУчет КАК КолУчет,
	|		КолФакт КАК КолФакт,
	|		Излишки КАК Излишки,
	|		Недостача КАК Недостача
	|	) КАК Товары
	|ИЗ
	|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации КАК ВИЛС_ИнвентаризацияТМЦВЭксплуатации
	|ГДЕ
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары.Номенклатура.Наименование";
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());

		ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабличныйДокумент.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	Возврат(ТабличныйДокумент);
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыИНВ3(ПараметрыПечати, ДокументОснование) Экспорт
	
	ДанныеДокумента = Документы.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.ПолучитьДанныеДокумента(ПараметрыПечати, ДокументОснование);
	
	Если ДанныеДокумента.ОписаниеОшибки <> Неопределено Тогда
		Если ДанныеДокумента.ОписаниеОшибки = "НетИнвентаризацийВПериоде" Тогда
			ТекстСообщения = НСтр("ru = 'Печать %Документ% не выполнена: в указанный инвентаризационный период не найдены пересчеты товаров.';
									|en = '%Документ% is not printed: goods recounts are not found in the specified stocktaking period.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка(ДокументОснование));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ДокументОснование);
		ИначеЕсли ДанныеДокумента.ОписаниеОшибки = "НетЦенПоСебестоимости" Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось получить цены по себестоимости для документа %Документ%: с %ПериодС% по %ПериодПо% не произведен расчет себестоимости.';
									|en = 'Cannot receive prices by cost for document %Документ%: cost is not calculated from %ПериодС% to %ПериодПо%.'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ДокументОснование);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПериодС%", Формат(НачалоМесяца(ДанныеДокумента.РезультатПоШапке.ДатаНачала),"ДЛФ=DD"));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПериодПо%", Формат(КонецМесяца(ДанныеДокумента.РезультатПоШапке.ДатаОкончания),"ДЛФ=DD"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДанныеДокумента.ПоПредварительномуРасчету Тогда
		ТекстСообщения = НСтр("ru = 'При печати документа %Документ% использовались данные предварительного расчета себестоимости.';
								|en = 'Data of the preliminary cost calculation was used while printing document %Документ%.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ДокументОснование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Новый Структура(
		"РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатКурсВалюты",
		ДанныеДокумента.РезультатПоШапке,
		ДанныеДокумента.РезультатПоТабличнойЧасти,
		ДанныеДокумента.РезультатКурсВалюты);
	
КонецФункции

// Функция получает данные документа.
// Используется при получении данных для печатной формы ИНВ3 и для выгрузки данных при обмене.
//
Функция ПолучитьДанныеДокумента(ПараметрыПечати, ДокументОснование) Экспорт
	
	СтруктураВозврата = Новый Структура(
		"РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатКурсВалюты, ОписаниеОшибки, ПоПредварительномуРасчету");
	СтруктураВозврата.ОписаниеОшибки = Неопределено;
	СтруктураВозврата.ПоПредварительномуРасчету = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
		
	ЗапросПредварительныхДанных = Новый Запрос;
	ЗапросПредварительныхДанных.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризационнаяОпись.Дата 			КАК Дата,
	|	ИнвентаризационнаяОпись.Дата 			КАК ДатаНачала,
	|	ИнвентаризационнаяОпись.Дата 			КАК ДатаОкончания,
	|	НЕОПРЕДЕЛЕНО 							КАК ВидЦены,
	|	ИнвентаризационнаяОпись.Подразделение 	КАК Склад,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости) КАК ИсточникИнформацииОЦенахДляПечати,
	|	ИнвентаризационнаяОпись.Организация		КАК Организация,
	|	РасчетСебестоимостиТоваровОрганизации.Ссылка.ПредварительныйРасчет КАК ПредварительныйРасчет
	|ИЗ
	|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации КАК ИнвентаризационнаяОпись
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимостиТоваровОрганизации
	|		ПО (РасчетСебестоимостиТоваровОрганизации.Организация = ИнвентаризационнаяОпись.Организация)
	|			И (РасчетСебестоимостиТоваровОрганизации.Ссылка.Проведен)
	|			И (РасчетСебестоимостиТоваровОрганизации.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ИнвентаризационнаяОпись.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ИнвентаризационнаяОпись.Дата, МЕСЯЦ))
	|ГДЕ
	|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетСебестоимостиТоваровОрганизации.Ссылка.Дата УБЫВ";
	
	ЗапросПредварительныхДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);	
 	ПредварительныеДанныеРезультат = ЗапросПредварительныхДанных.Выполнить().Выбрать();
		
	Если НЕ ПредварительныеДанныеРезультат.Следующий() Тогда
		СтруктураВозврата.ОписаниеОшибки = "НетИнвентаризацийВПериоде";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ПредварительныйРасчет 			  = ПредварительныеДанныеРезультат.ПредварительныйРасчет;
	ИсточникИнформацииОЦенахДляПечати = ПредварительныеДанныеРезультат.ИсточникИнформацииОЦенахДляПечати;
	ДатаНачала 						  = ПредварительныеДанныеРезультат.ДатаНачала;
	ДатаОкончания 					  = КонецДня(ПредварительныеДанныеРезультат.ДатаОкончания);
	Склад							  = ПредварительныеДанныеРезультат.Склад;	
	Организация 					  = ПредварительныеДанныеРезультат.Организация;
	ВидЦены 						  = ПредварительныеДанныеРезультат.ВидЦены;
				
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", 	   ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	   ДатаОкончания);
	Запрос.УстановитьПараметр("Склад", 			   Склад);
	Запрос.УстановитьПараметр("ДатаОстатков", 	   ДатаОкончания + 1);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Организация", 	   Организация);
	Запрос.УстановитьПараметр("ВидЦены", 		   ВидЦены);
	
	// Ответственные лица в печатной форме
	СтруктураОтветственных = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Организация, КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Руководитель", 		   СтруктураОтветственных.Руководитель);
	Запрос.УстановитьПараметр("ДолжностьРуководителя", СтруктураОтветственных.РуководительДолжность);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер", 	   СтруктураОтветственных.ГлавныйБухгалтер);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.Ссылка 			КАК Склад,
	|	Склады.Подразделение 	КАК Подразделение
	|ПОМЕСТИТЬ ТекущийСклад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ    
	|	Склады.Подразделение = &Склад
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Руководитель КАК Руководитель,
	|	&ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	&ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияПредставление,
	|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).КодПоОКПО КАК ОрганизацияПоОКПО,
	|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).Префикс КАК Префикс,
	|	ТекущийСклад.Склад.ТекущийОтветственный КАК Кладовщик,                                // begin fix Suetin 02.12.2019 16:01:14
	|	ТекущийСклад.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ИнвентаризационнаяОпись.Подразделение.Наименование КАК ПодразделениеПредставление,    // end fix Suetin 02.12.2019 16:01:19
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания,
	|	ТекущийСклад.Склад КАК Склад,
	|	ИнвентаризационнаяОпись.Дата КАК ОснованиеДата,
	|	ИнвентаризационнаяОпись.Номер КАК ОснованиеНомер,
	|	ИнвентаризационнаяОпись.Номер КАК НомерДокумента,
	|	ИнвентаризационнаяОпись.Дата КАК ДатаДокумента,
	|	ИнвентаризационнаяОпись.Ссылка КАК Ссылка,
	|	&ДатаОкончания КАК ДатаСнятияОстатков
	|ИЗ
	|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации КАК ИнвентаризационнаяОпись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущийСклад КАК ТекущийСклад
	|		ПО ИнвентаризационнаяОпись.Подразделение = ТекущийСклад.Подразделение
	|ГДЕ
	|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризационнаяОпись.Ссылка.Организация 							КАК Организация,
	|	ИнвентаризационнаяОпись.Ссылка.Подразделение 						КАК Подразделение,
	|	ИнвентаризационнаяОпись.ФизЛицо 									КАК ФизическоеЛицо,
	|	ИнвентаризационнаяОпись.Номенклатура 								КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) 		КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) 				КАК Серия,
	|	ИнвентаризационнаяОпись.Номенклатура.НаименованиеПолное 			КАК ТоварНаименование,
	|	"""" 																КАК ХарактеристикаНаименование,
	|	"""" 																КАК СерияНаименование,
	|	ИнвентаризационнаяОпись.КолУчет										КАК КоличествоПоУчету,
	|	ИнвентаризационнаяОпись.КолФакт										КАК КоличествоФактическое,
	|	ИнвентаризационнаяОпись.Номенклатура.Код 							КАК ТоварКод,
	|	ИнвентаризационнаяОпись.Номенклатура.ЕдиницаИзмерения.Код 			КАК ЕдиницаИзмеренияКод,
	|	ИнвентаризационнаяОпись.Номенклатура.ЕдиницаИзмерения.Наименование 	КАК ЕдиницаИзмеренияНаименование,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ПОМЕСТИТЬ ТаблицаИнвентаризации 
	|ИЗ
	|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары КАК ИнвентаризационнаяОпись
	|ГДЕ
	|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИнвентаризации.Номенклатура 											КАК Номенклатура,
	|	ТаблицаИнвентаризации.Характеристика 										КАК Характеристика,
	|	ТаблицаИнвентаризации.Серия 												КАК Серия,
	|	ТаблицаИнвентаризации.ТоварНаименование 									КАК ТоварНаименование,
	|	ТаблицаИнвентаризации.ХарактеристикаНаименование 							КАК ХарактеристикаНаименование,
	|	ТаблицаИнвентаризации.СерияНаименование 									КАК СерияНаименование,
	|	СУММА(ТаблицаИнвентаризации.КоличествоПоУчету) 								КАК КоличествоПоУчету,
	|	СУММА(ТаблицаИнвентаризации.КоличествоФактическое) 							КАК КоличествоФактическое,
	|	ВЫБОР КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток,0) = 0 ТОГДА 0 ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток КОНЕЦ КАК Цена,
	|	СУММА(ТаблицаИнвентаризации.КоличествоПоУчету 		* ВЫБОР КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток,0) = 0 ТОГДА 0 ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток КОНЕЦ) КАК СуммаПоУчету,
	|	СУММА(ТаблицаИнвентаризации.КоличествоФактическое 	* ВЫБОР КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток,0) = 0 ТОГДА 0 ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток КОНЕЦ) КАК СуммаФактическая,
	|	ТаблицаИнвентаризации.ЕдиницаИзмеренияКод 									КАК ЕдиницаИзмеренияКод,
	|	ТаблицаИнвентаризации.ЕдиницаИзмеренияНаименование 							КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаИнвентаризации.ТоварКод 												КАК ТоварКод,
	|	ТаблицаИнвентаризации.ЭтоВозвратнаяТара 									КАК ЭтоВозвратнаяТара,
	|   ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)									КАК ТипЗапасов
	|ИЗ
	|	ТаблицаИнвентаризации КАК ТаблицаИнвентаризации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&ДатаОстатков,
	|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецодеждаВЭксплуатацииВспомогательный),
	|					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаВЭксплуатацииВспомогательный),
	|					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИнвентарьИХозяйственныеПринадлежностиВЭксплуатации)),
	|				,
	|				(Организация, Подразделение, Субконто1) В
	|					(ВЫБРАТЬ
	|						ТаблицаИнвентаризации.Организация,
	|						ТаблицаИнвентаризации.Подразделение,
	|						ТаблицаИнвентаризации.Номенклатура
	|					ИЗ
	|						ТаблицаИнвентаризации КАК ТаблицаИнвентаризации)) КАК ХозрасчетныйОстатки
	|			ПО ТаблицаИнвентаризации.Организация = ХозрасчетныйОстатки.Организация
	|				И ТаблицаИнвентаризации.Подразделение = ХозрасчетныйОстатки.Подразделение
	|				И ТаблицаИнвентаризации.Номенклатура = ХозрасчетныйОстатки.Субконто1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИнвентаризации.Номенклатура,
	|	ТаблицаИнвентаризации.Характеристика,
	|	ТаблицаИнвентаризации.Серия,
	|	ТаблицаИнвентаризации.ТоварНаименование,
	|	ТаблицаИнвентаризации.ХарактеристикаНаименование,
	|	ТаблицаИнвентаризации.СерияНаименование,
	|	ВЫБОР КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток,0) = 0 ТОГДА 0 ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток КОНЕЦ,
	|	ТаблицаИнвентаризации.ЕдиницаИзмеренияКод,
	|	ТаблицаИнвентаризации.ЕдиницаИзмеренияНаименование,
	|	ТаблицаИнвентаризации.ТоварКод,
	|	ТаблицаИнвентаризации.ЭтоВозвратнаяТара,
	|   ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварНаименование,
	|	Номенклатура";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.Код", "Номенклатура." + КолонкаКодов);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результаты = Запрос.ВыполнитьПакет();
	РезультатПоШапке = Результаты[1];
	РезультатПоТабличнойЧасти = Результаты[3];
	РезультатКурсВалюты = Неопределено;
	
	СтруктураВозврата.РезультатПоШапке          = РезультатПоШапке;
	СтруктураВозврата.РезультатПоТабличнойЧасти = РезультатПоТабличнойЧасти;
	СтруктураВозврата.РезультатКурсВалюты       = РезультатКурсВалюты;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция получает данные для формирования печатной формы ИНВ19
//
Функция ПолучитьДанныеДляПечатнойФормыИНВ19(ПараметрыПечати, ДокументОснование) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
			
	ЗапросПредварительныхДанных = Новый Запрос;
	ЗапросПредварительныхДанных.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризационнаяОпись.Дата КАК Дата,
	|	НАЧАЛОПЕРИОДА(ИнвентаризационнаяОпись.Дата, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ИнвентаризационнаяОпись.Дата, МЕСЯЦ) КАК ДатаОкончания,
	|	НЕОПРЕДЕЛЕНО КАК ВидЦены,
	|	ИнвентаризационнаяОпись.Подразделение КАК Склад,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости) КАК ИсточникИнформацииОЦенахДляПечати,
	|	ИнвентаризационнаяОпись.Организация,
	|	РасчетСебестоимостиТоваровОрганизации.Ссылка.ПредварительныйРасчет
	|ИЗ
	|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации КАК ИнвентаризационнаяОпись
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимостиТоваровОрганизации
	|		ПО (РасчетСебестоимостиТоваровОрганизации.Организация = ИнвентаризационнаяОпись.Организация)
	|			И (РасчетСебестоимостиТоваровОрганизации.Ссылка.Проведен)
	|			И (РасчетСебестоимостиТоваровОрганизации.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ИнвентаризационнаяОпись.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ИнвентаризационнаяОпись.Дата, МЕСЯЦ))
	|ГДЕ
	|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетСебестоимостиТоваровОрганизации.Ссылка.Дата УБЫВ";
	
	ЗапросПредварительныхДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);	
 	ПредварительныеДанныеРезультат = ЗапросПредварительныхДанных.Выполнить().Выбрать();
			
	Если НЕ ПредварительныеДанныеРезультат.Следующий() Тогда
		ТекстСообщения = НСтр("ru = 'Печать %Документ% не выполнена: в указанный инвентаризационный период не найдены пересчеты товаров.';
								|en = '%Документ% is not printed: goods recounts are not found in the specified stocktaking period.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка(ДокументОснование));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОснование);
		Возврат Неопределено
	КонецЕсли;
	
	ПредварительныйРасчет 			  = ПредварительныеДанныеРезультат.ПредварительныйРасчет;
	ИсточникИнформацииОЦенахДляПечати = ПредварительныеДанныеРезультат.ИсточникИнформацииОЦенахДляПечати;
	ДатаНачала 						  = ПредварительныеДанныеРезультат.ДатаНачала;
	ДатаОкончания 					  = КонецДня(ПредварительныеДанныеРезультат.ДатаОкончания);
	Склад							  = ПредварительныеДанныеРезультат.Склад;	
	Организация 					  = ПредварительныеДанныеРезультат.Организация;
	ВидЦены 						  = ПредварительныеДанныеРезультат.ВидЦены;
				
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", 	   ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	   ДатаОкончания);
	Запрос.УстановитьПараметр("Склад", 			   Склад);
	Запрос.УстановитьПараметр("ДатаОстатков", 	   ДатаОкончания + 1);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Организация", 	   Организация);
	Запрос.УстановитьПараметр("ВидЦены", 		   ВидЦены);
		
	// Ответственные лица в печатной форме
	СтруктураОтветственных = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Организация, КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Руководитель", 		   СтруктураОтветственных.Руководитель);
	Запрос.УстановитьПараметр("ДолжностьРуководителя", СтруктураОтветственных.РуководительДолжность);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер", 	   СтруктураОтветственных.ГлавныйБухгалтер);
	
	Если ПредварительныеДанныеРезультат.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости Тогда
		
		Если ПредварительныеДанныеРезультат.ПредварительныйРасчет = Null Тогда
			
			ТекстСообщения = НСтр("ru = 'Не удалось получить цены по себестоимости для документа %Документ%: с %ПериодС% по %ПериодПо% не произведен расчет себестоимости.';
									|en = 'Cannot receive prices by cost for document %Документ%: cost is not calculated from %ПериодС% to %ПериодПо%.'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ДокументОснование);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПериодС%", Формат(НачалоМесяца(ДатаНачала),"ДЛФ=DD"));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПериодПо%", Формат(КонецМесяца(ДатаОкончания),"ДЛФ=DD"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		Если ПредварительныеДанныеРезультат.ПредварительныйРасчет Тогда
			
			ТекстСообщения = НСтр("ru = 'При печати документа %Документ% использовались данные предварительного расчета себестоимости.';
									|en = 'Data of the preliminary cost calculation was used while printing document %Документ%.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ДокументОснование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Недостача КАК Количество,
			|	""1_Списание"" КАК Операция
			|ПОМЕСТИТЬ КоличествоНоменклатуры
			|ИЗ
			|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &ДокументОснование
			|	И Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И НЕ Товары.Недостача = 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Излишки,
			|	""2_Оприходование""
			|ИЗ
			|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &ДокументОснование
			|	И Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И НЕ Товары.Излишки = 0
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			//|	ЦеныНоменклатуры.АналитикаУчетаНоменклатуры,
			|	ЦеныНоменклатуры.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатуры.ВидЗапасов,
			|	ЦеныНоменклатуры.Организация,
			|	(ЦеныНоменклатуры.СтоимостьРегл
			|		+ ЦеныНоменклатуры.ДопРасходыРегл
			|		+ ЦеныНоменклатуры.ТрудозатратыРегл
			|		+ ЦеныНоменклатуры.ПостатейныеПостоянныеРегл
			|		+ ЦеныНоменклатуры.ПостатейныеПеременныеРегл) КАК СтоимостьРегл
			|ПОМЕСТИТЬ ЦеныНоменклатуры
			|ИЗ
			|	РегистрСведений.СтоимостьТоваров.СрезПоследних(
			|			&ДатаОкончания,
			|			(АналитикаУчетаНоменклатуры.Номенклатура, Организация, РазделУчета) В
			|				(ВЫБРАТЬ
			|					Таблица.Номенклатура,
			|					&Организация,
			|					ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
			|				ИЗ
			|					КоличествоНоменклатуры КАК Таблица)) КАК ЦеныНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.СтоимостьРегл, 0) КАК ЧИСЛО(31,2)) КАК Стоимость,
			|	СУММА(КоличествоНоменклатурыПоВидамЗапасов.Количество) КАК Количество,
			|	КоличествоНоменклатурыПоВидамЗапасов.Операция КАК Операция,
			|	"""" КАК ХарактеристикаПредставление,
			|	"""" КАК СерияПредставление,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.Код КАК ТоварКод,
			|	ЛОЖЬ КАК ЭтоВозвратнаяТара
			|ИЗ
			|	КоличествоНоменклатуры КАК КоличествоНоменклатурыПоВидамЗапасов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
			|		ПО КоличествоНоменклатурыПоВидамЗапасов.Номенклатура = ЦеныНоменклатуры.Номенклатура
			//|			И КоличествоНоменклатурыПоВидамЗапасов.ВидЗапасов = ЦеныНоменклатуры.ВидЗапасов
			|			И (ЦеныНоменклатуры.Организация = &Организация)
			|
			|СГРУППИРОВАТЬ ПО
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
			|	КоличествоНоменклатурыПоВидамЗапасов.Операция,
			|	"""",
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.НаименованиеПолное,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.ЕдиницаИзмерения.Код,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.ЕдиницаИзмерения.Наименование,
			|	КоличествоНоменклатурыПоВидамЗапасов.Номенклатура.Код,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.СтоимостьРегл, 0) КАК ЧИСЛО(31,2)),
			|	""""
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТоварНаименование,
			//|	ХарактеристикаПредставление,
			//|	СерияПредставление,
			|	Операция
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Руководитель КАК Руководитель,
			|	&ДолжностьРуководителя КАК ДолжностьРуководителя,
			|	&ГлавныйБухгалтер КАК ГлавныйБухгалтер,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияПредставление,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).КодПоОКПО КАК ОрганизацияПоОКПО,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).Префикс КАК Префикс,
			|	ИнвентаризационнаяОпись.ФизЛицо КАК Кладовщик,
			//|	ИнвентаризационнаяОпись.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
			|	"""" КАК ДолжностьКладовщика,
			|	ИнвентаризационнаяОпись.Подразделение.Наименование КАК ПодразделениеПредставление,
			|	&ДатаНачала КАК ДатаНачала,
			|	&ДатаОкончания КАК ДатаОкончания,
			|	ИнвентаризационнаяОпись.Дата КАК ОснованиеДата,
			|	ИнвентаризационнаяОпись.Номер КАК ОснованиеНомер,
			|	ИнвентаризационнаяОпись.Номер КАК НомерДокумента,
			|	ИнвентаризационнаяОпись.Дата КАК ДатаДокумента,
			|	ИнвентаризационнаяОпись.Ссылка КАК Ссылка,
			|	&ДатаОкончания КАК ДатаСнятияОстатков
			|ИЗ
			|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации КАК ИнвентаризационнаяОпись
			|ГДЕ
			|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК НоменклатураСписание,
			|	Товары.Характеристика КАК ХарактеристикаСписание,
			|	Товары.Серия КАК СерияСписание,
			|	Товары.НоменклатураОприходование КАК НоменклатураОприходование,
			|	Товары.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
			|	Товары.СерияОприходование КАК СерияОприходование,
			|	СУММА(Товары.Количество) КАК Количество
			|ИЗ
			|	Документ.ПересортицаТоваров.Товары КАК Товары
			|ГДЕ ЛОЖЬ И
			|	Товары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И Товары.Ссылка.Склад = &Склад
			|	И Товары.Ссылка.Организация = &Организация
			|	И Товары.Ссылка.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Номенклатура,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.НоменклатураОприходование,
			|	Товары.ХарактеристикаОприходование,
			|	Товары.СерияОприходование
			|";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.Код", "Номенклатура." + КолонкаКодов);
			
			Запрос.Текст = ТекстЗапроса;
			
			Результаты = Запрос.ВыполнитьПакет();
			РезультатПоШапке = Результаты[3];
			РезультатПоТабличнойЧасти = Результаты[2];
			РезультатКурсВалюты = Неопределено;
			РезультатСвязанныеТовары = Результаты[4];
			
		Иначе
			// Фактический расчет
						
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Недостача КАК Количество,
			|	""1_Списание"" КАК Операция
			|ПОМЕСТИТЬ КоличествоНоменклатуры
			|ИЗ
			|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &ДокументОснование
			|	И Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И НЕ Товары.Недостача = 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Излишки,
			|	""2_Оприходование""
			|ИЗ
			|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Товары КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &ДокументОснование
			|	И Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И НЕ Товары.Излишки = 0
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыКОформлениюОтчетовКомитенту.ВидЗапасов КАК ВидЗапасов,
			|	ТоварыКОформлениюОтчетовКомитенту.КорВидЗапасов КАК НовыйВидЗапасов,
			|	ТоварыКОформлениюОтчетовКомитенту.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			|ПОМЕСТИТЬ ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров
			|ИЗ
			|	КоличествоНоменклатуры КАК КоличествоНоменклатурыПоВидамЗапасов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ТоварыКОформлениюОтчетовКомитенту
			|		ПО //(ТоварыКОформлениюОтчетовКомитенту.ВидЗапасов = КоличествоНоменклатурыПоВидамЗапасов.ВидЗапасов) И
			|			(ТоварыКОформлениюОтчетовКомитенту.АналитикаУчетаНоменклатуры.Номенклатура = КоличествоНоменклатурыПоВидамЗапасов.Номенклатура)
			|			//И (ТоварыКОформлениюОтчетовКомитенту.АналитикаУчетаНоменклатуры.Характеристика = КоличествоНоменклатурыПоВидамЗапасов.АналитикаУчетаНоменклатуры.Характеристика)
			|			//И КоличествоНоменклатурыПоВидамЗапасов.АналитикаУчетаНоменклатуры.Серия = ТоварыКОформлениюОтчетовКомитенту.АналитикаУчетаНоменклатуры.Серия
			|ГДЕ
			|	//КоличествоНоменклатурыПоВидамЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТОвар) И
			|	ТоварыКОформлениюОтчетовКомитенту.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&ДокументОснование КАК Документ,
			|	ВЫБОР
			|		КОГДА ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.ВидЗапасов ЕСТЬ NULL 
			|			ТОГДА ТоварыИнвентаризации.Номенклатура
			|		ИНАЧЕ ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.АналитикаУчетаНоменклатуры.Номенклатура
			|	КОНЕЦ КАК Номенклатура,
			//|	ВЫБОР
			//|		КОГДА ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.ВидЗапасов ЕСТЬ NULL 
			//|			ТОГДА ТоварыИнвентаризации.ВидЗапасов
			//|		ИНАЧЕ ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.НовыйВидЗапасов
			//|	КОНЕЦ КАК ВидЗапасов,
			|	ТоварыИнвентаризации.Количество КАК Количество,
			|	ТоварыИнвентаризации.Операция КАК Операция
			|ПОМЕСТИТЬ ТаблицаИнвентаризации
			|ИЗ
			|	КоличествоНоменклатуры КАК ТоварыИнвентаризации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров КАК ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров
			|		ПО //(ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.ВидЗапасов = ТоварыИнвентаризации.ВидЗапасов) И
			|			(ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.АналитикаУчетаНоменклатуры.Номенклатура = ТоварыИнвентаризации.Номенклатура)
			|			//И (ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.АналитикаУчетаНоменклатуры.Характеристика = ТоварыИнвентаризации.АналитикаУчетаНоменклатуры.Характеристика)
			|			//И (ВидыЗапасовИАналитикиУчетаНоменклатурыКомиссионныхТоваров.АналитикаУчетаНоменклатуры.Серия = ТоварыИнвентаризации.АналитикаУчетаНоменклатуры.Серия)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&ДокументОснование КАК Документ,
			|	ТаблицаИнвентаризации.Номенклатура КАК Номенклатура,
			//|	ТаблицаИнвентаризации.ВидЗапасов КАК ВидЗапасов,
			|	ВЫБОР
			|		КОГДА СУММА(ЕСТЬNULL(СебестоимостьТоваровПоРегистратору.Количество, 0)) = 0
			|			ТОГДА 0
			|		ИНАЧЕ СУММА(ЕСТЬNULL(СебестоимостьТоваровПоРегистратору.СтоимостьРегл, 0)
			|				+ ЕСТЬNULL(СебестоимостьТоваровПоРегистратору.ДопРасходыРегл, 0)
			|				+ ЕСТЬNULL(СебестоимостьТоваровПоРегистратору.ТрудозатратыРегл, 0)
			|				+ ЕСТЬNULL(СебестоимостьТоваровПоРегистратору.ПостатейныеПостоянныеРегл, 0)
			|				+ ЕСТЬNULL(СебестоимостьТоваровПоРегистратору.ПостатейныеПеременныеРегл, 0))
			|			/ СУММА(СебестоимостьТоваровПоРегистратору.Количество)
			|	КОНЕЦ КАК Цена
			|ПОМЕСТИТЬ ТаблицаЦен
			|ИЗ
			|	ТаблицаИнвентаризации КАК ТаблицаИнвентаризации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваровПоРегистратору
			|		ПО ТаблицаИнвентаризации.Номенклатура = СебестоимостьТоваровПоРегистратору.АналитикаУчетаНоменклатуры.Номенклатура
			|			//И ТаблицаИнвентаризации.ВидЗапасов = СебестоимостьТоваровПоРегистратору.ВидЗапасов
			|			И (СебестоимостьТоваровПоРегистратору.Регистратор = &ДокументОснование)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаИнвентаризации.Документ,
			|	ТаблицаИнвентаризации.Номенклатура //,
			//|	СебестоимостьТоваровПоРегистратору.АналитикаУчетаНоменклатуры,
			//|	ТаблицаИнвентаризации.ВидЗапасов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаИнвентаризации.Номенклатура КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаЦен.Цена, 0) КАК ЧИСЛО(31,2)) КАК Стоимость,
			|	СУММА(ТаблицаИнвентаризации.Количество) КАК Количество,
			|	ТаблицаИнвентаризации.Операция КАК Операция,
			|	"""" КАК ХарактеристикаПредставление,
			|	"""" КАК СерияПредставление,
			|	ТаблицаИнвентаризации.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
			|	ТаблицаИнвентаризации.Номенклатура.Код КАК ТоварКод,
			|	ТаблицаИнвентаризации.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
			|	ТаблицаИнвентаризации.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
			|	ЛОЖЬ КАК ЭтоВозвратнаяТара
			|ИЗ
			|	ТаблицаИнвентаризации КАК ТаблицаИнвентаризации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
			|		ПО //ТаблицаИнвентаризации.ВидЗапасов = ТаблицаЦен.ВидЗапасов И
			|			ТаблицаИнвентаризации.Номенклатура = ТаблицаЦен.Номенклатура
			|			И &ДокументОснование = ТаблицаЦен.Документ
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаИнвентаризации.Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
			|	ТаблицаИнвентаризации.Операция,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаЦен.Цена, 0) КАК ЧИСЛО(31,2)),
			|	"""",
			|	ТаблицаИнвентаризации.Номенклатура.НаименованиеПолное,
			|	ТаблицаИнвентаризации.Номенклатура.ЕдиницаИзмерения.Код,
			|	"""",
			|	ТаблицаИнвентаризации.Номенклатура.Код,
			|	ТаблицаИнвентаризации.Номенклатура.ЕдиницаИзмерения.Наименование
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТоварНаименование,
			|	ХарактеристикаПредставление,
			|	СерияПредставление,
			|	Операция
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Руководитель КАК Руководитель,
			|	&ДолжностьРуководителя КАК ДолжностьРуководителя,
			|	&ГлавныйБухгалтер КАК ГлавныйБухгалтер,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияПредставление,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).КодПоОКПО КАК ОрганизацияПоОКПО,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).Префикс КАК Префикс,
			|	ИнвентаризационнаяОпись.ФизЛицо КАК Кладовщик,
			//|	ИнвентаризационнаяОпись.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
			|	"""" КАК ДолжностьКладовщика,
			|	ИнвентаризационнаяОпись.Подразделение.Наименование КАК ПодразделениеПредставление,
			|	&ДатаНачала КАК ДатаНачала,
			|	&ДатаОкончания КАК ДатаОкончания,
			|	ИнвентаризационнаяОпись.Дата КАК ОснованиеДата,
			|	ИнвентаризационнаяОпись.Номер КАК ОснованиеНомер,
			|	ИнвентаризационнаяОпись.Номер КАК НомерДокумента,
			|	ИнвентаризационнаяОпись.Дата КАК ДатаДокумента,
			|	ИнвентаризационнаяОпись.Ссылка КАК Ссылка,
			|	&ДатаОкончания КАК ДатаСнятияОстатков
			|ИЗ
			|	Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации КАК ИнвентаризационнаяОпись
			|ГДЕ
			|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.Номенклатура КАК НоменклатураСписание,
			|	Товары.Характеристика КАК ХарактеристикаСписание,
			|	Товары.Серия КАК СерияСписание,
			|	Товары.НоменклатураОприходование КАК НоменклатураОприходование,
			|	Товары.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
			|	Товары.СерияОприходование КАК СерияОприходование,
			|	СУММА(Товары.Количество) КАК Количество
			|ИЗ
			|	Документ.ПересортицаТоваров.Товары КАК Товары
			|ГДЕ ЛОЖЬ И
			|	Товары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И Товары.Ссылка.Склад = &Склад
			|	И Товары.Ссылка.Организация = &Организация
			|	И Товары.Ссылка.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Номенклатура,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.НоменклатураОприходование,
			|	Товары.ХарактеристикаОприходование,
			|	Товары.СерияОприходование
			|";			
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.Код", "Номенклатура." + КолонкаКодов);
			
			Запрос.Текст = ТекстЗапроса;
			
			Результаты = Запрос.ВыполнитьПакет();
			РезультатПоШапке = Результаты[5];
			РезультатПоТабличнойЧасти = Результаты[4];
			РезультатКурсВалюты = Неопределено;
			РезультатСвязанныеТовары = Результаты[6];
			
		КонецЕсли;
				
	//ИначеЕсли ПредварительныеДанныеРезультат.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда 
	//	
	//	ТекстЗапроса =
	//	"ВЫБРАТЬ
	//	|	СписаниеНедостачТоваровВидЗапасов.Номенклатура КАК Номенклатура,
	//	|	СписаниеНедостачТоваровВидЗапасов.Характеристика КАК Характеристика,
	//	|	СписаниеНедостачТоваровВидЗапасов.Серия КАК Серия,
	//	|	СписаниеНедостачТоваровВидЗапасов.Количество КАК Количество,
	//	|	""1_Списание"" КАК Операция,
	//	|	NULL КАК СвязаннаяНоменклатура,
	//	|	NULL КАК СвязаннаяХарактеристика,
	//	|	NULL КАК СвязаннаяСерия
	//	|ПОМЕСТИТЬ ВложенныйЗапрос
	//	|ИЗ
	//	|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровВидЗапасов
	//	|ГДЕ
	//	|	СписаниеНедостачТоваровВидЗапасов.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|	И СписаниеНедостачТоваровВидЗапасов.Ссылка.Склад = &Склад
	//	|	И СписаниеНедостачТоваровВидЗапасов.Ссылка.Организация = &Организация
	//	|	И СписаниеНедостачТоваровВидЗапасов.Ссылка.Проведен
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
	//	|	ОприходованиеИзлишковТоваровТовары.Характеристика,
	//	|	ОприходованиеИзлишковТоваровТовары.Серия,
	//	|	ОприходованиеИзлишковТоваровТовары.Количество,
	//	|	""2_Оприходование"",
	//	|	NULL,
	//	|	NULL,
	//	|	NULL
	//	|ИЗ
	//	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
	//	|ГДЕ
	//	|	ОприходованиеИзлишковТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Склад = &Склад
	//	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Организация = &Организация
	//	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Проведен
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПересортицаТоваровТовары.Номенклатура,
	//	|	ПересортицаТоваровТовары.Характеристика,
	//	|	ПересортицаТоваровТовары.Серия,
	//	|	ПересортицаТоваровТовары.Количество,
	//	|	""3_ПересортицаСписание"",
	//	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	//	|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
	//	|	ПересортицаТоваровТовары.СерияОприходование
	//	|ИЗ
	//	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	//	|ГДЕ
	//	|	ПересортицаТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|	И ПересортицаТоваровТовары.Ссылка.Склад = &Склад
	//	|	И ПересортицаТоваровТовары.Ссылка.Организация = &Организация
	//	|	И ПересортицаТоваровТовары.Ссылка.Проведен
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	//	|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
	//	|	ПересортицаТоваровТовары.СерияОприходование,
	//	|	ПересортицаТоваровТовары.Количество,
	//	|	""4_ПересортицаОприходование"",
	//	|	ПересортицаТоваровТовары.Номенклатура,
	//	|	ПересортицаТоваровТовары.Характеристика,
	//	|	ПересортицаТоваровТовары.Серия
	//	|ИЗ
	//	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	//	|ГДЕ
	//	|	ПересортицаТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|	И ПересортицаТоваровТовары.Ссылка.Склад = &Склад
	//	|	И ПересортицаТоваровТовары.Ссылка.Организация = &Организация
	//	|	И ПересортицаТоваровТовары.Ссылка.Проведен
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПорчаТоваровТовары.Номенклатура,
	//	|	ПорчаТоваровТовары.Характеристика,
	//	|	ПорчаТоваровТовары.Серия,
	//	|	ПорчаТоваровТовары.Количество,
	//	|	""1_Списание"",
	//	|	NULL,
	//	|	NULL,
	//	|	NULL
	//	|ИЗ
	//	|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	//	|ГДЕ
	//	|	ПорчаТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|	И ПорчаТоваровТовары.Ссылка.Склад = &Склад
	//	|	И ПорчаТоваровТовары.Ссылка.Организация = &Организация
	//	|	И ПорчаТоваровТовары.Ссылка.Проведен
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПорчаТоваровТовары.НоменклатураОприходование,
	//	|	ПорчаТоваровТовары.ХарактеристикаОприходование,
	//	|	ПорчаТоваровТовары.Серия,
	//	|	ПорчаТоваровТовары.Количество,
	//	|	""2_Оприходование"",
	//	|	NULL,
	//	|	NULL,
	//	|	NULL
	//	|ИЗ
	//	|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	//	|ГДЕ
	//	|	ПорчаТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|	И ПорчаТоваровТовары.Ссылка.Склад = &Склад
	//	|	И ПорчаТоваровТовары.Ссылка.Организация = &Организация
	//	|	И ПорчаТоваровТовары.Ссылка.Проведен
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВложенныйЗапрос.Номенклатура,
	//	|	ВложенныйЗапрос.Характеристика,
	//	|	ВложенныйЗапрос.Серия,
	//	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	//	|	ВложенныйЗапрос.Операция,
	//	|	ВложенныйЗапрос.СвязаннаяНоменклатура,
	//	|	ВложенныйЗапрос.СвязаннаяХарактеристика,
	//	|	ВложенныйЗапрос.СвязаннаяСерия,
	//	|	&ВидЦены КАК ВидЦен
	//	|ПОМЕСТИТЬ ТаблицаТовары
	//	|ИЗ
	//	|	ВложенныйЗапрос КАК ВложенныйЗапрос
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВложенныйЗапрос.Операция,
	//	|	ВложенныйЗапрос.СвязаннаяНоменклатура,
	//	|	ВложенныйЗапрос.СвязаннаяХарактеристика,
	//	|	ВложенныйЗапрос.СвязаннаяСерия,
	//	|	ВложенныйЗапрос.Номенклатура,
	//	|	ВложенныйЗапрос.Характеристика,
	//	|	ВложенныйЗапрос.Серия
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	//	|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	//	|	ЦеныНоменклатуры.Упаковка,
	//	|	ЦеныНоменклатуры.Цена
	//	|ПОМЕСТИТЬ ЦеныНоменклатуры
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	//	|			&ДатаОкончания,
	//	|			(ВидЦены, Номенклатура, Характеристика) В
	//	|				(ВЫБРАТЬ
	//	|					Таблица.ВидЦен,
	//	|					Таблица.Номенклатура,
	//	|					Таблица.Характеристика
	//	|				ИЗ
	//	|					ТаблицаТовары КАК Таблица)) КАК ЦеныНоменклатуры
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	//	|	ТаблицаТовары.Характеристика КАК Характеристика,
	//	|	ТаблицаТовары.Серия КАК Серия,
	//	|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	//	|	ТаблицаТовары.Серия.Наименование КАК СерияПредставление,
	//	|	ТаблицаТовары.Количество,
	//	|	ВЫБОР
	//	|		КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки ЕСТЬ NULL 
	//	|				И &ТекстЗапросаКоэффициентУпаковки <> 0
	//	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки
	//	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	//	|	КОНЕЦ КАК Стоимость,
	//	|	ТаблицаТовары.Операция,
	//	|	ТаблицаТовары.СвязаннаяНоменклатура,
	//	|	ТаблицаТовары.СвязаннаяХарактеристика,
	//	|	ТаблицаТовары.СвязаннаяСерия,
	//	|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	//	|	ТаблицаТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	//	|	ТаблицаТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	//	|	ТаблицаТовары.Номенклатура.Код КАК ТоварКод,
	//	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	//	|ИЗ
	//	|	ТаблицаТовары КАК ТаблицаТовары
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	//	|		ПО ТаблицаТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	//	|			И ТаблицаТовары.Характеристика = ЦеныНоменклатуры.Характеристика
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ТоварНаименование,
	//	|	ХарактеристикаПредставление,
	//	|	СерияПредставление,
	//	|	ТаблицаТовары.Операция
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	&Руководитель КАК Руководитель,
	//	|	&ДолжностьРуководителя КАК ДолжностьРуководителя,
	//	|	&ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	//	|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияПредставление,
	//	|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).КодПоОКПО КАК ОрганизацияПоОКПО,
	//	|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).Префикс КАК Префикс,
	//	|	ИнвентаризационнаяОпись.Склад.ТекущийОтветственный КАК Кладовщик,
	//	|	ИнвентаризационнаяОпись.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	//	|	ИнвентаризационнаяОпись.Склад.Наименование КАК ПодразделениеПредставление,
	//	|	&ДатаНачала КАК ДатаНачала,
	//	|	&ДатаОкончания КАК ДатаОкончания,
	//	|	ИнвентаризационнаяОпись.Дата КАК ОснованиеДата,
	//	|	ИнвентаризационнаяОпись.Номер КАК ОснованиеНомер,
	//	|	ИнвентаризационнаяОпись.Номер КАК НомерДокумента,
	//	|	ИнвентаризационнаяОпись.Дата КАК ДатаДокумента,
	//	|	ИнвентаризационнаяОпись.Ссылка КАК Ссылка,
	//	|	&ДатаОкончания КАК ДатаСнятияОстатков
	//	|ИЗ
	//	|	Документ.ИнвентаризационнаяОпись КАК ИнвентаризационнаяОпись
	//	|ГДЕ
	//	|	ИнвентаризационнаяОпись.Ссылка = &ДокументОснование
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК КоэффициентПересчета
	//	|ИЗ
	//	|	РегистрСведений.КурсыВалют.СрезПоследних(
	//	|			&ДатаОкончания,
	//	|			Валюта В
	//	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	//	|					ВЫРАЗИТЬ(Таблица.ВидЦен КАК Справочник.ВидыЦен).ВалютаЦены
	//	|				ИЗ
	//	|					ТаблицаТовары КАК Таблица)) КАК КурсыВалютСрезПоследних";
	//	
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	//			"&ТекстЗапросаКоэффициентУпаковки",
	//			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	//			"ЦеныНоменклатуры.Упаковка",
	//			"ЦеныНоменклатуры.Номенклатура"));
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.Код", "Номенклатура." + КолонкаКодов);
	//	
	//	Запрос.Текст = ТекстЗапроса;
	//	
	//	Результаты = Запрос.ВыполнитьПакет();
	//	РезультатПоШапке = Результаты[4];
	//	РезультатПоТабличнойЧасти = Результаты[3];
	//	РезультатКурсВалюты = Результаты[5];
	//	РезультатСвязанныеТовары = Неопределено;
		
	КонецЕсли;
		
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РезультатПоШапке",			РезультатПоШапке);
	СтруктураВозврата.Вставить("РезультатПоТабличнойЧасти", РезультатПоТабличнойЧасти);
	СтруктураВозврата.Вставить("РезультатКурсВалюты", 		РезультатКурсВалюты);
	СтруктураВозврата.Вставить("РезультатСвязанныеТовары",  РезультатСвязанныеТовары);
	
	Возврат СтруктураВозврата
	
КонецФункции
 
#КонецОбласти

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
