
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Дата КАК Дата,
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Номенклатура КАК Номенклатура,
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Номер КАК Номер,
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Организация КАК Организация,
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Подразделение КАК Подразделение,
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.ФизЛицо КАК ФизЛицо,
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Подразделение КАК Подразделение,
	|		ФизЛицо КАК ФизЛицо,
	|		Номенклатура КАК Номенклатура,
	|		КолУчет КАК КолУчет,
	|		КолФакт КАК КолФакт,
	|		Излишки КАК Излишки,
	|		Недостача КАК Недостача
	|	) КАК Товары
	|ИЗ
	|	Документ.ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации КАК ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации
	|ГДЕ
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентТМЦ_ИнвентаризацияТМЦВЭксплуатации.Товары.Номенклатура.Наименование";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
