
&ИзменениеИКонтроль("ТекстДанныеПоТрудозатратам")
Функция ВИЛС_ТекстДанныеПоТрудозатратам(ПараметрыРасчета)

	ДляРасшифровки 				= РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	РасчетСебестоимостиВыполнен = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетСебестоимостиВыполненДляРасшифровки(ПараметрыРасчета);

	// Данные по трудозатратам выбираются в одну таблицу т.к. источники данных для плана и факта одинаковые.
	// Исключением являются выпуски без заказа 2.1, для них данные выбираются из документов производства без заказов.
	//
	Текст = "
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ВидРабот,
	|	СУММА(ДД.Количество) КАК Количество,
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл
	|ПОМЕСТИТЬ ТекущиеТрудозатратыНЗП
	|ИЗ
	|	ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	//++ НЕ УТКА
	|	И ДД.ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- НЕ УТКА
	|	И ДД.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ВидРабот
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	ВидРабот
	|;
	// производство 2.2
	|ВЫБРАТЬ
	|	ДД.Организация								КАК Организация,
	|	ДД.Подразделение							КАК Подразделение,
	|	ДД.ВидРабот									КАК ВидРабот,
	|	ДД.ПартияПроизводства.ГруппаПродукции		КАК ГруппаПродукции,
	|	ДД.ПартияПроизводства.Назначение			КАК Назначение,
	|	ДД.ПартияПроизводства						КАК ПартияПроизводства,
	|	ДД.ПартияПроизводства.ВидДеятельностиНДС	КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО								КАК ЗаказНаПроизводство,
	|	0											КАК КодСтрокиПродукция,
	|	ЕСТЬNULL(ДД.ПартияПроизводства.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	СУММА(ДД.Количество)						КАК Количество,
	|	СУММА(ДД.НормативнаяСтоимость)				КАК НормативнаяСтоимость,
	|	СУММА(ДД.Стоимость)							КАК Стоимость,
	|	СУММА(ДД.СтоимостьРегл)						КАК СтоимостьРегл
	|ПОМЕСТИТЬ ДанныеПоТрудозатратам
	|ИЗ
	|	ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ДД
	|
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
#Удаление
	|	И ДД.СлужебноеВидДвиженияПриход
	|
#КонецУдаления
#Вставка
	|	И ДД.СлужебноеВидДвиженияПриход
	//без учета страховых   // begin fix Suetin 09.09.2020 3:26:31
	|	И ДД.ВидФондаВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыФондовВзносов.ПустаяСсылка)               
	// без учета страховых  // end fix Suetin 09.09.2020 3:26:36
	|
#КонецВставки
	|СГРУППИРОВАТЬ ПО
	|	ДД.Подразделение,
	|	ДД.ВидРабот,
	|	ДД.ПартияПроизводства.Назначение,
	|	ДД.ПартияПроизводства.ВидДеятельностиНДС,
	|	ЕСТЬNULL(ДД.ПартияПроизводства.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ДД.Организация,
	|	ДД.ПартияПроизводства,
	|	ДД.ПартияПроизводства.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства.ГруппаПродукции
	|";

	РасчетСебестоимостиЛокализация.ДополнитьЗапросДаннымиПоТрудозатратам(Текст);

	Текст = Текст + ";";

	Если РасчетСебестоимостиВыполнен ИЛИ ДляРасшифровки Тогда
		Текст = СтрЗаменить(Текст,
		"ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства",
		"РегистрНакопления.ТрудозатратыНезавершенногоПроизводства");
		Текст = СтрЗаменить(Текст,
		"ДД.СлужебноеВидДвиженияПриход",
		"ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДД.Активность");
	КонецЕсли;

	Возврат Текст;

КонецФункции
