
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Реквизит = Новый РеквизитФормы("ВИЛС_НомерКонтракта",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)),,"Номер контракта");
	МассивДобавляемых = Новый Массив;
	МассивДобавляемых.Добавить(Реквизит);
	ИзменитьРеквизиты(МассивДобавляемых);
	НовыйЭлемент = Элементы.Вставить("ВИЛС_НомерКонтракта",Тип("ПолеФормы"),Элементы.ДатыПриемаУвольнения,Элементы.ДатаПриема);
	НовыйЭлемент.ПутьКДанным = "ВИЛС_НомерКонтракта";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Ширина = 6;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеДанныеКонтрактаДоговораСотрудникаСрезПоследних.НомерДоговораКонтракта КАК Номер
	|ИЗ
	|	РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СрезПоследних(, Сотрудник = &Сотрудник) КАК ОсновныеДанныеКонтрактаДоговораСотрудникаСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЭтотОбъект["ВИЛС_НомерКонтракта"] = Выборка.Номер;
КонецПроцедуры

&Вместо("КадровыеДокументы")
&НаКлиенте
Процедура ВИЛС_КадровыеДокументы(Команда)
	
	СтандартнаяОбработка = Истина;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ГосударственнаяСлужбаКлиент");
		Модуль.ОткрытьФормуКадровыхПриказовВоеннослужащих(ЭтотОбъект, СтандартнаяОбработка);
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		ОписаниеФормы = СотрудникиКлиентСервер.ОбщееОписаниеДополнительнойФормы("ОбщаяФорма.ВИЛС_ВсеКадровыеДокументы");
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("СотрудникСсылка");
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("Заголовок", "Сотрудник.Наименование");
		//СотрудникиКлиентСервер.ОписаниеДополнительнойФормы("ЖурналДокументов.ВИЛС_ВсеКадровыеДокументы")
		
		СотрудникиКлиент.ОткрытьДополнительнуюФорму(ОписаниеФормы,ЭтотОбъект, Истина);
		//ОткрытьФорму("ОбщаяФорма.ВИЛС_ВсеКадровыеДокументы")
	КонецЕсли;
	
КонецПроцедуры