#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
#Область Печать
	
&Вместо("ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная")
Функция ВИЛС_ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(ТаблицаНакладных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаНакладных.ПорядковыйНомер КАК ПорядковыйНомер
	|ПОМЕСТИТЬ ТаблицаТранспортныхНакладныхБезОснований
	|ИЗ
	|	&ТаблицаНакладных КАК ТаблицаНакладных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаНакладных.ТранспортнаяНакладная КАК Документ.ТранспортнаяНакладная) КАК ТранспортнаяНакладная,
	|	ТаблицаНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Проведен КАК ДокументОснованиеПроведен,
	|	ТранспортнаяНакладнаяДокументыОснования.НомерСтроки КАК НомерСтрокиВТранспортнойНакладной
	|ПОМЕСТИТЬ ТаблицаТранспортныхНакладных
	|ИЗ
	|	ТаблицаТранспортныхНакладныхБезОснований КАК ТаблицаНакладных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ПО ТаблицаНакладных.ТранспортнаяНакладная = ТранспортнаяНакладнаяДокументыОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК Ссылка,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Номер КАК Номер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Дата КАК Дата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация КАК Организация,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузополучатель КАК Грузополучатель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузоотправитель КАК Грузоотправитель,	
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаказчикПеревозки КАК ЗаказчикПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетЗаказчикаПеревозки КАК БанковскийСчетЗаказчикаПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Отпустил КАК Кладовщик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Перевозчик КАК Перевозчик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Водитель КАК Водитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВидПеревозки КАК ВидПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильМарка КАК МаркаАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГосударственныйНомер КАК ГосНомерАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресПогрузки КАК ПунктПогрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресДоставки КАК ПунктРазгрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.СрокДоставки КАК СрокДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннахАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильВместимостьВКубическихМетрах КАК ВместимостьВКубическихМетрахАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильТип КАК ТипАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаБрутто КАК МассаБрутто,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	НЕ МИНИМУМ(ТаблицаТранспортныхНакладных.ДокументОснованиеПроведен) КАК ЕстьНепроведенныеДокументыОснования
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Номер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Дата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузополучатель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузоотправитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаказчикПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетЗаказчикаПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Отпустил,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ОтпустилДолжность,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Перевозчик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Водитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВидПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильМарка,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГосударственныйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресПогрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.СрокДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГрузоподъемностьВТоннах,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильВместимостьВКубическихМетрах,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильТип,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаБрутто,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутреннийЗапрос.Ссылка,
	|	ВнутреннийЗапрос.ПорядковыйНомер,
	|   ЕСТЬNULL(ВнутреннийЗапрос.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|   ВнутреннийЗапрос.Упаковка 							КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|	ВнутреннийЗапрос.НаименованиеВидаНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная КАК Ссылка,
	|		ДокументыОснования.ПорядковыйНомер КАК ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ КАК НаименованиеВидаНоменклатуры
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДавальцу.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТКА
//++ НЕ УТ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровСХранения.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТ
//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратСырьяДавальцу.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТКА
	|
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)) КАК ВнутреннийЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВнутреннийЗапрос.ПорядковыйНомер,
	|	ВнутреннийЗапрос.НаименованиеВидаНоменклатуры
	// begin fix Suetin 14.02.2019 11:59:58
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТТН.ТранспортнаяНакладная 				КАК ТранспортнаяНакладная,
	|	ТТН.ТранспортнаяНакладная.Руководитель 	КАК Руководитель,
	|	ТТН.ПорядковыйНомер 					КАК ПорядковыйНомер,
	|	ТТН.ДокументОснование 					КАК ДокументОснование,
	|	ТТН.ДокументОснованиеПроведен 			КАК ДокументОснованиеПроведен,
	|	ТТН.ДокументОснование.Номер 			КАК Номер,
	|	ТТН.ДокументОснование.Дата 				КАК Дата
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТТН
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТТН.ПорядковыйНомер
	|";
	// end fix Suetin 14.02.2019 12:00:09
	Запрос.УстановитьПараметр("ТаблицаНакладных", ТаблицаНакладных);
	Запрос.УстановитьПараметр("НаименованиеДляПечатиВидовНоменклатуры", Константы.НаименованиеДляПечатиВидовНоменклатуры.Получить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТаблицаРезультата", РезультатЗапроса[2].Выгрузить());
	СтруктураРезультата.Вставить("РезультатИменаТоваров", РезультатЗапроса[3]);
	// begin fix Suetin 14.02.2019 12:05:32	
	СтруктураРезультата.Вставить("ТаблицаНомеровДокументов", РезультатЗапроса[4]);
	// end fix Suetin 14.02.2019 12:05:40	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураРезультата
	
КонецФункции

&Вместо("ПолучитьДанныеДляПечатнойФормыТТН")
Функция ВИЛС_ПолучитьДанныеДляПечатнойФормыТТН(ТаблицаНакладных)

	МассивОбъектов = ТаблицаНакладных.ВыгрузитьКолонку("ТранспортнаяНакладная");

	УстановитьПривилегированныйРежим(Истина);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	ТаблицаНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаНакладных.ПорядковыйНомер КАК ПорядковыйНомер
	|ПОМЕСТИТЬ ТаблицаТранспортныхНакладныхБезОснований
	|ИЗ
	|	&ТаблицаНакладных КАК ТаблицаНакладных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Проведен КАК ДокументОснованиеПроведен,
	|	ТранспортнаяНакладнаяДокументыОснования.НомерСтроки КАК НомерСтрокиВТранспортнойНакладной
	|ПОМЕСТИТЬ ТаблицаТранспортныхНакладных
	|ИЗ
	|	ТаблицаТранспортныхНакладныхБезОснований КАК ТаблицаНакладных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ПО ТаблицаНакладных.ТранспортнаяНакладная = ТранспортнаяНакладнаяДокументыОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ВидКорректировки КАК ХозяйственнаяОперация
	|
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	//++ НЕ УТ
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ОтгрузкаТоваровСХранения КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	//-- НЕ УТ
	//++ НЕ УТКА
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВозвратСырьяДавальцу КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаДавальцу КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	//-- НЕ УТКА
	// begin fix Suetin 23.09.2019 18:51:37
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных 
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ДанныеДокументов.Ссылка)
	|
	// end fix Suetin 23.09.2019 18:51:49
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК ДокументОснование,
	|	ЛОЖЬ КАК Корректировочный
	|
	|ПОМЕСТИТЬ СчетаФактурыОснования
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ДанныеДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("ТаблицаНакладных", ТаблицаНакладных);

	Запрос.Выполнить();

	РеализацияТоваровУслугЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ВозвратТоваровПоставщикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	КорректировкаРеализацииЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПеремещениеТоваровЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	//++ НЕ УТ
	ОтгрузкаТоваровСХраненияЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПередачаТоваровХранителюЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПередачаСырьяПереработчикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
	//-- НЕ УТ
	ВИЛС_ПоместитьВременнуюТаблицуТоваровДляЗаказаПоставщику(МенеджерВременныхТаблиц);      // fix Suetin 24.09.2019 12:11:07
	//++ НЕ УТКА
	ВозвратСырьяДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	ПараметрыЗаполнения.ПересчитыватьВВалютуРегл = Ложь;
	ПередачаДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
	//-- НЕ УТКА
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);	
	ПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц);
	МассивОбъектовОтветственныеЛица = Неопределено;
	Если Не ЗначениеЗаполнено(МассивОбъектов) Тогда 
		МассивОбъектовОтветственныеЛица = Новый Массив;
		МассивОбъектовОтветственныеЛица.Добавить(Документы.ТранспортнаяНакладная.ПустаяСсылка());
	Иначе
		МассивОбъектовОтветственныеЛица = МассивОбъектов;
	КонецЕсли;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектовОтветственныеЛица, МенеджерВременныхТаблиц);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТаблицаТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваровТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТаблицаТоваров.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период,
	|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ТаблицаПериодовЦен
	|ИЗ
	|	ПеремещениеТоваровТаблицаТоваров КАК ПеремещениеТоваровТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ПеремещениеТоваровТаблицаТоваров.Ссылка.ВидЦены = ЦеныНоменклатуры.ВидЦены
	|			И ПеремещениеТоваровТаблицаТоваров.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ПеремещениеТоваровТаблицаТоваров.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ПеремещениеТоваровТаблицаТоваров.Ссылка.Дата >= ЦеныНоменклатуры.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТаблицаТоваров.Ссылка,
	|	ПеремещениеТоваровТаблицаТоваров.Номенклатура,
	|	ПеремещениеТоваровТаблицаТоваров.Характеристика,
	|	ЦеныНоменклатуры.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ТаблицаТоваров.Номенклатура) КАК Количество,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|ПОМЕСТИТЬ КоличествоТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК Ссылка,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Номер КАК Номер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Дата КАК Дата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация КАК Организация,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузополучатель КАК Грузополучатель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузоотправитель КАК Грузоотправитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Плательщик КАК Плательщик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаказчикПеревозки КАК ЗаказчикПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация.Префикс КАК Префикс,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Отпустил КАК Кладовщик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОтветственныеЛица.РуководительНаименование, """") КАК СТРОКА(500)) КАК Руководитель,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОтветственныеЛица.РуководительДолжность, """") КАК СТРОКА(500)) КАК ДолжностьРуководителя,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование, """") КАК СТРОКА(500)) КАК ГлавныйБухгалтер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетПлательщика КАК БанковскийСчетПлательщика,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетЗаказчикаПеревозки КАК БанковскийСчетЗаказчикаПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетПеревозчика КАК БанковскийСчетПеревозчика,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Перевозчик КАК Перевозчик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Водитель КАК Водитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВидПеревозки КАК ВидПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаРегистрационныйНомер КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаСерия КАК ЛицензионнаяКарточкаСерия,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаНомер КАК ЛицензионнаяКарточкаНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаВид КАК ЛицензионнаяКарточкаВид,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильМарка КАК МаркаАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГосударственныйНомер КАК ГосНомерАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Прицеп КАК Прицеп,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ГосударственныйНомерПрицепа КАК ГосНомерПрицепа,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьНомер КАК ДоверенностьНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьДата КАК ДоверенностьДата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	ВЫБОР
	|		КОГДА ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе = ЗНАЧЕНИЕ(Перечисление.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав)
	|			ТОГДА ЕСТЬNULL(ТаблицаТранспортныхНакладных.ДокументОснование.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ КАК Валюта,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресПогрузки КАК ПунктПогрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресДоставки КАК ПунктРазгрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.СрокДоставки КАК СрокДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаБрутто КАК МассаБрутто,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаНетто КАК МассаНетто,
	|	ВЫБОР
	|		КОГДА ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе = ЗНАЧЕНИЕ(Перечисление.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав)
	|			ТОГДА ЕСТЬNULL(КоличествоТоваров.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНаименований,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе КАК ВыводДанныхОТоварномСоставе,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.УдостоверениеНомер КАК УдостоверениеНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.УдостоверениеСерия КАК УдостоверениеСерия,
	|	НЕ МИНИМУМ(ТаблицаТранспортныхНакладных.ДокументОснованиеПроведен) КАК ЕстьНепроведенныеДокументыОснования
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоТоваров КАК КоличествоТоваров
	|		ПО ТаблицаТранспортныхНакладных.ТранспортнаяНакладная = КоличествоТоваров.ТранспортнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ТаблицаТранспортныхНакладных.ТранспортнаяНакладная = ТаблицаОтветственныеЛица.Ссылка
	|
	|СГРУППИРОВАТЬ ПО 
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Номер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Дата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузополучатель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузоотправитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Плательщик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаказчикПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация.Префикс,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Отпустил,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ОтпустилДолжность,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОтветственныеЛица.РуководительНаименование, """") КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОтветственныеЛица.РуководительДолжность, """") КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование, """") КАК СТРОКА(500)),
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетПлательщика,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетЗаказчикаПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетПеревозчика,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Перевозчик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Водитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВидПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаСерия,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЛицензионнаяКарточкаВид,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильМарка,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГосударственныйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Прицеп,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ГосударственныйНомерПрицепа,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьДата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьВыдана,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ДоверенностьЛицо,
	|	ВЫБОР
	|		КОГДА ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе = ЗНАЧЕНИЕ(Перечисление.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав)
	|			ТОГДА ЕСТЬNULL(ТаблицаТранспортныхНакладных.ДокументОснование.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресПогрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.СрокДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаБрутто,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаНетто,
	|	ВЫБОР
	|		КОГДА ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе = ЗНАЧЕНИЕ(Перечисление.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав)
	|			ТОГДА ЕСТЬNULL(КоличествоТоваров.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаданиеНаПеревозку,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.УдостоверениеНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.УдостоверениеСерия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Ссылка КАК Документ.РеализацияТоваровУслуг)                     КАК Ссылка,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.НоменклатураНабора КАК Справочник.Номенклатура)                 КАК НоменклатураНабора,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ХарактеристикаНабора КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНабора,
	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки)                                                     КАК НомерСтроки,
	|	СУММА(ВЫБОР
	|		КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|						ТОГДА ТаблицаТоваров.Количество
	|					ИНАЧЕ ВЫБОР 
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = Значение(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|								ТОГДА 0
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ
	|				КОНЕЦ * &ТекстЗапросаВесУпаковки
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                                                                  КАК МассаБрутто,
	|	СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1)                        КАК МассаНетто,
	|	СУММА(ТаблицаТоваров.СуммаБезНДС)                                                       КАК СуммаБезНДС,
	|	СУММА(ТаблицаТоваров.СуммаНДС)                                                          КАК СуммаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|
	|ГДЕ
	|	ТаблицаТоваров.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.НоменклатураНабора,
	|	ТаблицаТоваров.ХарактеристикаНабора
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка                                    КАК Ссылка,
	|	Товары.ВариантКомплектацииНоменклатуры           КАК ВариантКомплектацииНоменклатуры,
	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	|	Товары.НоменклатураНабора,
	|	Товары.ХарактеристикаНабора,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	ВЫБОР КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	|		И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ОсновнаяКомплектующая,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	|		И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика ТОГДА
	|		Товары.НомерГТД
	|	ИНАЧЕ
	|		NULL
	|	КОНЕЦ КАК НомерГТД,
	|	0 КАК КоличествоПоУмолчанию,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК Товары
	|
	|ГДЕ
	|	Товары.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка                                                                                КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка                                           КАК ВариантКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец                                  КАК НоменклатураНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика                            КАК ХарактеристикаНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура   КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК ОсновнаяКомплектующая,
	|	NULL КАК СтавкаНДС,
	|	NULL КАК НомерГТД,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоПоУмолчанию,
	|	0 КАК Количество
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Ссылка ИЗ РеализацияТоваровУслугТаблицаТоваров КАК Т) КАК Т
	|		ПО ИСТИНА
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В (ВЫБРАТЬ Т.ВариантКомплектацииНоменклатуры ИЗ РеализацияТоваровУслугТаблицаТоваров КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	МАКСИМУМ(Таблица.СтавкаНДС) КАК СтавкаНДС,
	|	МАКСИМУМ(Таблица.НомерГТД) КАК НомерГТД,
	|	МАКСИМУМ(Таблица.ОсновнаяКомплектующая) КАК ОсновнаяКомплектующая,
	|	СУММА(Таблица.КоличествоПоУмолчанию) КАК КоличествоПоУмолчанию,
	|	СУММА(Таблица.Количество) КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результат.Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора,
	|	Результат.ХарактеристикаНабора,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.СтавкаНДС
	|			ИНАЧЕ null
	|		КОНЕЦ) КАК СтавкаНДС,
	|	МАКСИМУМ(Результат.НомерГТД) КАК НомерГТД,
	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0 И Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ null
	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК Количество,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ null
	|		КОНЕЦ) КАК КоэффициентМаксимум,
	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ null
	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК КоэффициентМинимум
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
	|СГРУППИРОВАТЬ ПО
	|	Результат.Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора,
	|	Результат.ХарактеристикаНабора
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НоменклатураНабора,
	|	ХарактеристикаНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры,
	|
	|	ВЫБОР КОГДА Таблица.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|		ИНАЧЕ
	|			ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|	КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	|
	|	ВЫБОР КОГДА Таблица.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		ВЫБОР КОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|			ИНАЧЕ
	|				ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|			И ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора В (ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам),ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям)) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
	|		ИНАЧЕ
	|			ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	|
	|	Таблица.Ссылка                            КАК Ссылка,
	|	Таблица.НоменклатураНабора                КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора              КАК ХарактеристикаНабора,
	|	Таблица.НомерСтроки                       КАК НомерСтроки,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК Количество,
	|	ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.КоэффициентМинимум = ВременнаяТаблицаНаборыДополнительно.КоэффициентМаксимум ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПолныйНабор,
	|	Таблица.МассаБрутто                           КАК МассаБрутто,
	|	Таблица.МассаНетто                            КАК МассаНетто,
	|	Таблица.СуммаБезНДС                           КАК СуммаБезНДС,
	|	Таблица.СуммаНДС                              КАК СуммаНДС,
	|	ВременнаяТаблицаНаборыДополнительно.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборы
	|ИЗ
	|	ВременнаяТаблицаНаборыПодготовка КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
	|		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
	|		И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
	|		И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НоменклатураНабора,
	|	ХарактеристикаНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной КАК НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаТоваров.Номенклатура.Артикул КАК ТоварАртикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ КАК БазоваяЕдиницаНаименование,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки КАК МассаБрутто,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1 КАК МассаНетто,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ КАК КоличествоМест,
	|	ТаблицаТоваров.СуммаБезНДС КАК Сумма,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000 КАК КоэффициентПересчетаВТонны,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Весовой,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
	|				И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка)
	|	КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
	|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	|	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКомплектующие,
	|	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|		ВременнаяТаблицаНаборы.НомерСтроки
	|	ИНАЧЕ
	|		ТаблицаТоваров.НомерСтроки
	|	КОНЕЦ КАК НомерСтрокиНаборы,
	|	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|		ВременнаяТаблицаНаборы.ПолныйНабор
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|		ПО ВременнаяТаблицаНаборы.НоменклатураНабора = ТаблицаТоваров.НоменклатураНабора
	|			И ВременнаяТаблицаНаборы.ХарактеристикаНабора = ТаблицаТоваров.ХарактеристикаНабора
	|			И ВременнаяТаблицаНаборы.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|		И (ТаблицаТоваров.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИЛИ (ТаблицаТоваров.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			И ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие),
	|																				  ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))))
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной КАК НомерСтрокиВТранспортнойНакладной,
	|	ВременнаяТаблицаНаборы.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаНаборы.НоменклатураНабора КАК Номенклатура,
	|	ВременнаяТаблицаНаборы.НоменклатураНабора.Код КАК ТоварКод,
	|	ВременнаяТаблицаНаборы.НоменклатураНабора.Артикул КАК ТоварАртикул,
	|	ВременнаяТаблицаНаборы.НоменклатураНабора.НаименованиеПолное КАК ТоварНаименование,
	|	ВременнаяТаблицаНаборы.ХарактеристикаНабора.НаименованиеПолное КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	ВременнаяТаблицаНаборы.Количество,
	|	ВременнаяТаблицаНаборы.НоменклатураНабора.ЕдиницаИзмерения.Представление КАК ВидУпаковки,
	|	ВременнаяТаблицаНаборы.НоменклатураНабора.ЕдиницаИзмерения.Представление КАК БазоваяЕдиницаНаименование,
	|	0 КАК Цена,
	|	ВременнаяТаблицаНаборы.МассаБрутто,
	|	ВременнаяТаблицаНаборы.МассаНетто,
	|	ВременнаяТаблицаНаборы.КоличествоУпаковок КАК КоличествоМест,
	|	ВременнаяТаблицаНаборы.СуммаБезНДС КАК Сумма,
	|	ВременнаяТаблицаНаборы.СуммаНДС КАК СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры3 / 1000 КАК КоэффициентПересчетаВТонны,
	|	ВременнаяТаблицаНаборы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаНаборы.НоменклатураНабора.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Весовой,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах,
	|	ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	ВременнаяТаблицаНаборы.НомерСтроки КАК НомерСтрокиНаборы,
	|	ВременнаяТаблицаНаборы.ПолныйНабор КАК ПолныйНабор,
	|	ИСТИНА КАК ЭтоНабор
	|ИЗ
	|	ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|	ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ВременнаяТаблицаНаборы.Ссылка)
	|ГДЕ
	|	ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор),
	|                                                                        ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//++ НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	0,
	|	0,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ПередачаДавальцуТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной КАК НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаТоваров.Номенклатура.Артикул КАК ТоварАртикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ КАК БазоваяЕдиницаНаименование,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки КАК МассаБрутто,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1 КАК МассаНетто,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ КАК КоличествоМест,
	|	ТаблицаТоваров.СуммаБезНДС КАК Сумма,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000 КАК КоэффициентПересчетаВТонны,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Весовой,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
	|				И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ПередачаТоваровХранителюТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС / ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС,
	|	0,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ПередачаСырьяПереработчикуТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС / ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ОтгрузкаТоваровСХраненияТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	//++ НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС / ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВозвратПринятойМногооборотнойТары
	|				И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ВозвратСырьяДавальцуТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки2 ЕСТЬ NULL 
	|				И &ТекстЗапросаКоэффициентУпаковки2 <> 0
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки2
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1),
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ЕСТЬNULL(КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки, ТаблицаТоваров.КоличествоУпаковок)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки2 ЕСТЬ NULL 
	|				И &ТекстЗапросаКоэффициентУпаковки2 <> 0
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки2
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ТаблицаТоваров.КоличествоУпаковок,
	|	0,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ПеремещениеТоваровТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПериодовЦен КАК ТаблицаПериодовЦен
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ПО ТаблицаПериодовЦен.ВидЦены = ЦеныНоменклатуры.ВидЦены
	|				И ТаблицаПериодовЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|				И ТаблицаПериодовЦен.Характеристика = ЦеныНоменклатуры.Характеристика
	|				И ТаблицаПериодовЦен.Период = ЦеныНоменклатуры.Период
	|		ПО ТаблицаТоваров.Ссылка = ТаблицаПериодовЦен.Ссылка
	|			И ТаблицаТоваров.Номенклатура = ТаблицаПериодовЦен.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ТаблицаПериодовЦен.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ЕСТЬNULL(ТаблицаТоваров.Номенклатура.НаименованиеПолное, ТаблицаТоваров.Содержание),
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ТаблицаТоваровКорректировкаРеализации КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС / ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВозвратПринятойМногооборотнойТары
	|				И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ВозвратТоваровПоставщикуТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	// begin fix Suetin 24.09.2019 18:37:53
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной,
	|	ТаблицаТоваров.Распоряжение,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код,
	|	ТаблицаТоваров.Номенклатура.Артикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС / ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки,
	|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры1,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ,
	|	ТаблицаТоваров.СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС,
	|	&ТекстЗапросаВесНоменклатуры2 / 1000,
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					И ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО КАК ВариантПредставленияНабораВПечатныхФормах,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК ЭтоКомплектующие,
	|	0 КАК НомерСтрокиНаборы,
	|	ЛОЖЬ КАК ПолныйНабор,
	|	ЛОЖЬ КАК ЭтоНабор
	|ИЗ
	|	ЗаданиеНаПеревозкуТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ПО (ТаблицаТранспортныхНакладных.ДокументОснование = ТаблицаТоваров.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Распоряжение = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	// end fix Suetin 24.09.2019 18:37:57
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтрокиНаборы,
	|	ЭтоНабор УБЫВ,
	|	ПорядковыйНомер,
	|	ТранспортнаяНакладная,
	|	НомерСтрокиВТранспортнойНакладной,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ПорядковыйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ДокументОснование КАК Ссылка,
	|	ТаблицаТранспортныхНакладных.ДокументОснование.Номер КАК Номер,
	|	ТаблицаТранспортныхНакладных.ДокументОснование.Дата КАК Дата
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|ГДЕ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВыводДанныхОТоварномСоставе = ЗНАЧЕНИЕ(Перечисление.ВариантыВыводаДанныхОТоварномСоставе.НомераНакладных)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	ТранспортнаяНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КоличествоТоваров";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатуры.Упаковка",
	"ЦеныНоменклатуры.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесНоменклатуры1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесНоменклатуры2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения",
	"ТаблицаТоваров.Номенклатура", Ложь));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесНоменклатуры3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ВременнаяТаблицаНаборы.НоменклатураНабора.ЕдиницаИзмерения",
	"ВременнаяТаблицаНаборы.НоменклатураНабора"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст,
	"&ТекстЗапросаНаименованиеЕдиницыИзмерения1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Наименование",
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст,
	"&ТекстЗапросаНаименованиеЕдиницыИзмерения2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Наименование",
	"КоэффициентыУпаковок.ВидУпаковки",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.УстановитьПараметр("ЗаполненаЕдиницаИзмеренияВеса",   ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить()));
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());

	МассивРезультатов         	   = Запрос.ВыполнитьПакет();
	РезультатПоШапке          	   = МассивРезультатов[2];
	РезультатПоТабличнойЧасти	   = МассивРезультатов[8];
	РезультатПоНомерамНакладных    = МассивРезультатов[9];

	УстановитьПривилегированныйРежим(Ложь);

	СтруктураДанныхДляПечати = Новый Структура(
	"РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоНомерамНакладных",
	РезультатПоШапке,
	РезультатПоТабличнойЧасти,
	РезультатПоНомерамНакладных);

	Возврат СтруктураДанныхДляПечати;

КонецФункции
// begin fix Suetin 24.09.2019 12:16:44
Процедура ВИЛС_ПоместитьВременнуюТаблицуТоваровДляЗаказаПоставщику(МенеджерВременныхТаблиц)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная 				КАК ТранспортнаяНакладная,
	//|	ТаблицаТранспортныхНакладных.НомерСтрокиВТранспортнойНакладной 	КАК НомерСтрокиВТранспортнойНакладной,
	|	Распоряжения.Ссылка 											КАК Задание,
	|	Распоряжения.Распоряжение 										КАК Распоряжение,
	|	Маршрут.Адрес 													КАК АдресДоставки
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДО
	|		ПО (ТаблицаТранспортныхНакладных.ТранспортнаяНакладная = ТранспортнаяНакладнаяДО.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК Распоряжения
	|		ПО (ТранспортнаяНакладнаяДО.ДокументОснование = Распоряжения.Распоряжение)
	|			И (ТранспортнаяНакладнаяДО.Ссылка.ЗаданиеНаПеревозку = Распоряжения.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Маршрут КАК Маршрут
	|		ПО (Распоряжения.Ссылка = Маршрут.Ссылка)
	|			И (Распоряжения.КлючСвязи = Маршрут.КлючСвязи)
	|;
	|";
	Запрос.Выполнить();
	ЗаданиеНаПеревозкуЛокализация.ВИЛС_ПоместитьВременнуюТаблицуТоваровПродолжение(МенеджерВременныхТаблиц);
КонецПроцедуры

&Вместо("ПроверитьНаличиеТранспортныхНакладныхДляРаспоряженийИзЗаданийНаПеревозку")
Функция ВИЛС_ПроверитьНаличиеТранспортныхНакладныхДляРаспоряженийИзЗаданийНаПеревозку(МассивЗаданийНаПеревозку)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = Документы.ЗаданиеНаПеревозку.ТекстЗапросаПолученияСпискаНакладныхИзЗаданийНаПеревозку() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Накладная
	|ИЗ
	|	НакладныеПоЗаданиямНаПеревозку КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ПО Таблица.Накладная = ТранспортнаяНакладнаяДокументыОснования.ДокументОснование
	|			И Таблица.ЗаданиеНаПеревозку = ТранспортнаяНакладнаяДокументыОснования.Ссылка.ЗаданиеНаПеревозку
	|			И ТранспортнаяНакладнаяДокументыОснования.Ссылка.Проведен
	|ГДЕ
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка В (&ЗаданияНаПеревозку)
	|	И ЗаданиеНаПеревозку.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыДоставки.НаСклад)
	|	И ЛОЖЬ";    // fix Suetin 17.09.2019 16:34:33 добавил ЛОЖЬ
	
	Запрос.УстановитьПараметр("ЗаданияНаПеревозку",	       МассивЗаданийНаПеревозку);
	Запрос.УстановитьПараметр("НетВыделенныхСтрокАдресов", Истина);
	Запрос.УстановитьПараметр("ВыделенныеСтрокиАдресов",   Новый Массив);
	Запрос.УстановитьПараметр("ВсеРаспоряжения",           Истина);
	Запрос.УстановитьПараметр("Распоряжения",              Новый Массив);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаНакладныхБезТТН = РезультатЗапроса[2].Выгрузить();
	МассивНакладныхБезТТН = ТаблицаНакладныхБезТТН.ВыгрузитьКолонку("Накладная");
	
	МассивЗаданийБезТТН   = РезультатЗапроса[3].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ШаблонТекстаСообщения = НСтр("ru = 'Невозможно напечатать транспортную накладную для документа ""%Документ%"" с операцией ""%СпособДоставки%"".';
								|en = 'Cannot print the consignment note for the ""%Документ%"" document with the ""%СпособДоставки%"" operation.'");
	
	Для Каждого ЗаданиеНаПеревозку Из МассивЗаданийБезТТН Цикл
		ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%Документ%", ЗаданиеНаПеревозку);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СпособДоставки%", Перечисления.ВидыДоставки.НаСклад);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивЗаданийНаПеревозку, ЗаданиеНаПеревозку);
	КонецЦикла;
	
	Если МассивНакладныхБезТТН.Количество() > 0 Тогда
		МассивРаспоряженийСТоварами = ПолучитьТолькоДокументыОснованияСТоварами(МассивНакладныхБезТТН);	
		
		// Если остались накладные без ТТН и в них есть номенклатура типа "Товар", то нужно досоздать ТТН для них.
		Если МассивРаспоряженийСТоварами.Количество() > 0 Тогда
			Возврат 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&Вместо("СоздатьТранспортныеНакладные")
Функция ВИЛС_СоздатьТранспортныеНакладные(МассивОбъектов, ЭтоПечать)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутренныйЗапрос.Ссылка,
	|	ВнутренныйЗапрос.АдресДоставки,
	|	ВнутренныйЗапрос.Грузополучатель,
	|	ВнутренныйЗапрос.Организация,
	|	ВнутренныйЗапрос.Плательщик,
	|	ВнутренныйЗапрос.Перевозчик
	|ПОМЕСТИТЬ ПараметрыТТН
	|ИЗ
	|	(ВЫБРАТЬ
	|		Документ.Ссылка КАК Ссылка,
	|		Документ.АдресДоставки КАК АдресДоставки,
	|		ВЫБОР
	|			КОГДА Документ.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА Документ.Контрагент
	|			ИНАЧЕ Документ.Грузополучатель
	|		КОНЕЦ КАК Грузополучатель,
	|		Документ.Организация КАК Организация,
	|		Документ.Контрагент КАК Плательщик,
	|		ВЫБОР
	|			КОГДА Документ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА Документ.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК Перевозчик
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК Документ
	|	ГДЕ
	|		Документ.Ссылка В(&МассивОбъектов)
	|		И НЕ Документ.РеализацияПоЗаказам
	|		И НЕ Документ.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументТовары.Ссылка,
	|		ДокументТовары.ЗаказКлиента.АдресДоставки,
	|		ВЫБОР
	|			КОГДА ДокументТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ДокументТовары.Ссылка.Контрагент
	|			ИНАЧЕ ДокументТовары.Ссылка.Грузополучатель
	|		КОНЕЦ,
	|		ДокументТовары.Ссылка.Организация,
	|		ДокументТовары.Ссылка.Контрагент,
	|		ВЫБОР
	|			КОГДА ДокументТовары.ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА ДокументТовары.ЗаказКлиента.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|	ГДЕ
	|		ДокументТовары.Ссылка В(&МассивОбъектов)
	|		И ДокументТовары.Ссылка.РеализацияПоЗаказам
	|		И НЕ ДокументТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Документ.Ссылка,
	|		Документ.АдресДоставки,
	|		ВЫБОР
	|			КОГДА Документ.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА Документ.Организация
	|			ИНАЧЕ Документ.ОрганизацияПолучатель
	|		КОНЕЦ,
	|		Документ.Организация,
	|		ВЫБОР
	|			КОГДА Документ.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА Документ.Организация
	|			ИНАЧЕ Документ.ОрганизацияПолучатель
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Документ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА Документ.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПеремещениеТоваров КАК Документ
	|	ГДЕ
	|		Документ.Ссылка В(&МассивОбъектов)
	|		И НЕ Документ.ПеремещениеПоЗаказам
	|		И НЕ Документ.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументТовары.Ссылка,
	|		ДокументТовары.ЗаказНаПеремещение.АдресДоставки,
	|		ВЫБОР
	|			КОГДА ДокументТовары.Ссылка.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ДокументТовары.Ссылка.Организация
	|			ИНАЧЕ ДокументТовары.Ссылка.ОрганизацияПолучатель
	|		КОНЕЦ,
	|		ДокументТовары.Ссылка.Организация,
	|		ВЫБОР
	|			КОГДА ДокументТовары.Ссылка.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ДокументТовары.Ссылка.Организация
	|			ИНАЧЕ ДокументТовары.Ссылка.ОрганизацияПолучатель
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДокументТовары.ЗаказНаПеремещение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА ДокументТовары.ЗаказНаПеремещение.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|	ГДЕ
	|		ДокументТовары.Ссылка В(&МассивОбъектов)
	|		И ДокументТовары.Ссылка.ПеремещениеПоЗаказам
	|		И НЕ ДокументТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВозвратТоваровПоставщику.Ссылка,
	|		"""",
	|		ВЫБОР
	|			КОГДА ВозвратТоваровПоставщику.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ВозвратТоваровПоставщику.Контрагент
	|			ИНАЧЕ ВозвратТоваровПоставщику.Грузополучатель
	|		КОНЕЦ,
	|		ВозвратТоваровПоставщику.Организация,
	|		ВозвратТоваровПоставщику.Организация,
	|		ВЫБОР
	|			КОГДА ВозвратТоваровПоставщику.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА ВозвратТоваровПоставщику.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|	ГДЕ
	|		ВозвратТоваровПоставщику.Ссылка В(&МассивОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		ВозвратСырьяДавальцу.Ссылка,
	|		"""",
	|		ВозвратСырьяДавальцу.Контрагент,
	|		ВозвратСырьяДавальцу.Организация,
	|		ВозвратСырьяДавальцу.Контрагент,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.ВозвратСырьяДавальцу КАК ВозвратСырьяДавальцу
	|	ГДЕ
	|		ВозвратСырьяДавальцу.Ссылка В(&МассивОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументТовары.Ссылка,
	|		ДокументТовары.ЗаказДавальца.АдресДоставки,
	|		ВЫБОР
	|			КОГДА ДокументТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ДокументТовары.Ссылка.Контрагент
	|			ИНАЧЕ ДокументТовары.Ссылка.Грузополучатель
	|		КОНЕЦ,
	|		ДокументТовары.Ссылка.Организация,
	|		ДокументТовары.Ссылка.Контрагент,
	|		ВЫБОР
	|			КОГДА ДокументТовары.ЗаказДавальца.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА ДокументТовары.ЗаказДавальца.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПередачаДавальцу.Товары КАК ДокументТовары
	|	ГДЕ
	|		ДокументТовары.Ссылка В(&МассивОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТКА
//++ НЕ УТ
	|	
	|	ВЫБРАТЬ
	|		ОтгрузкаТоваровСХранения.Ссылка,
	|		"""",
	|		ВЫБОР
	|			КОГДА ОтгрузкаТоваровСХранения.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ОтгрузкаТоваровСХранения.Контрагент
	|			ИНАЧЕ ОтгрузкаТоваровСХранения.Грузополучатель
	|		КОНЕЦ,
	|		ОтгрузкаТоваровСХранения.Организация,
	|		ОтгрузкаТоваровСХранения.Организация,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.ОтгрузкаТоваровСХранения КАК ОтгрузкаТоваровСХранения
	|	ГДЕ
	|		ОтгрузкаТоваровСХранения.Ссылка В(&МассивОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Документ.Ссылка КАК Ссылка,
	|		Документ.АдресДоставки КАК АдресДоставки,
	|		ВЫБОР
	|			КОГДА Документ.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА Документ.Контрагент
	|			ИНАЧЕ Документ.Грузополучатель
	|		КОНЕЦ КАК Грузополучатель,
	|		Документ.Организация КАК Организация,
	|		Документ.Контрагент КАК Плательщик,
	|		ВЫБОР
	|			КОГДА Документ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА Документ.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК Перевозчик
	|	ИЗ
	|		Документ.ПередачаТоваровХранителю КАК Документ
	|	ГДЕ
	|		Документ.Ссылка В(&МассивОбъектов)
	|		И НЕ Документ.ПередачаПоЗаказам
	|		И НЕ Документ.СпособДоставки В(&СпособыДоставкиСНашимУчастием)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументТовары.Ссылка,
	|		ДокументТовары.ЗаказКлиента.АдресДоставки,
	|		ВЫБОР
	|			КОГДА ДокументТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ДокументТовары.Ссылка.Контрагент
	|			ИНАЧЕ ДокументТовары.Ссылка.Грузополучатель
	|		КОНЕЦ,
	|		ДокументТовары.Ссылка.Организация,
	|		ДокументТовары.Ссылка.Контрагент,
	|		ВЫБОР
	|			КОГДА ДокументТовары.ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА ДокументТовары.ЗаказКлиента.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПередачаТоваровХранителю.Товары КАК ДокументТовары
	|	ГДЕ
	|		ДокументТовары.Ссылка В(&МассивОбъектов)
	|		И ДокументТовары.Ссылка.ПередачаПоЗаказам
	|		И НЕ ДокументТовары.ЗаказКлиента.СпособДоставки В(&СпособыДоставкиСНашимУчастием)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументТовары.Ссылка,
	|		ДокументТовары.ЗаказПереработчику.АдресДоставки,
	|		ВЫБОР
	|			КОГДА ДокументТовары.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ДокументТовары.Ссылка.Контрагент
	|			ИНАЧЕ ДокументТовары.Ссылка.Грузополучатель
	|		КОНЕЦ,
	|		ДокументТовары.Ссылка.Организация,
	|		ДокументТовары.Ссылка.Контрагент,
	|		ВЫБОР
	|			КОГДА ДокументТовары.ЗаказПереработчику.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|				ТОГДА ДокументТовары.ЗаказПереработчику.ПеревозчикПартнер
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|	ГДЕ
	|		ДокументТовары.Ссылка В(&МассивОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Ссылка,
	|		"""",
	|		ВЫБОР
	|			КОГДА КорректировкаРеализации.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА КорректировкаРеализации.Контрагент
	|			ИНАЧЕ КорректировкаРеализации.Грузополучатель
	|		КОНЕЦ,
	|		КорректировкаРеализации.Организация,
	|		КорректировкаРеализации.Контрагент,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|	ГДЕ
	|		КорректировкаРеализации.Ссылка В(&МассивОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ   // begin fix Suetin 19.09.2019 11:24:37
	|	
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозкуМаршрут.Адрес КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Контрагент
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Организация КАК Организация,
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Контрагент КАК Плательщик,
	|	ЗаданиеНаПеревозкуРаспоряжения.Перевозчик КАК Перевозчик
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ПО (ЗаданиеНаПеревозкуРаспоряжения.Ссылка = ЗаданиеНаПеревозкуМаршрут.Ссылка
	|				И ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи = ЗаданиеНаПеревозкуМаршрут.КлючСвязи)
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка В (&МассивОбъектов)) КАК ВнутренныйЗапрос    // end fix Suetin 19.09.2019 11:24:42
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыТТН.АдресДоставки КАК АдресДоставки,
	|	ПараметрыТТН.Грузополучатель КАК Грузополучатель,
	|	ПараметрыТТН.Организация КАК Организация,
	|	ПараметрыТТН.Плательщик КАК Плательщик,
	|	ПараметрыТТН.Перевозчик КАК Перевозчик,
	|	ПараметрыТТН.Ссылка
	|ИЗ
	|	ПараметрыТТН КАК ПараметрыТТН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ПО ПараметрыТТН.Ссылка = ТранспортнаяНакладнаяДокументыОснования.ДокументОснование
	|ГДЕ
	|	(ТранспортнаяНакладнаяДокументыОснования.Ссылка ЕСТЬ NULL 
	|			ИЛИ НЕ &ЭтоПечать)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АдресДоставки,
	|	Организация,
	|	Грузополучатель,
	|	Перевозчик";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ЭтоПечать",      ЭтоПечать);
	Запрос.УстановитьПараметр("СпособыДоставкиСНашимУчастием", 
		ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками")));
	УстановитьПривилегированныйРежим(Истина);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивРаспоряжений				= Новый Массив;
	СозданныеТранспортныеНакладные 	= Новый Массив;
	
	ТекАдресДоставки	= Неопределено;
	ТекОрганизация 	 	= Неопределено;
	ТекПлательщик 	 	= Неопределено;
	ТекГрузополучатель 	= Неопределено;
	ТекПеревозчик    	= Неопределено;
	
	ПервоеРаспоряжение = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ПервоеРаспоряжение 
			И (ТекАдресДоставки     <> Выборка.АдресДоставки
			 ИЛИ ТекОрганизация     <> Выборка.Организация
			 ИЛИ ТекПлательщик     	<> Выборка.Плательщик
			 ИЛИ ТекГрузополучатель <> Выборка.Грузополучатель
			 ИЛИ ТекПеревозчик      <> Выборка.Перевозчик) Тогда
			
			Если ЗначениеЗаполнено(МассивРаспоряжений) Тогда
				МассивРаспоряженийСТоварами = ПолучитьТолькоДокументыОснованияСТоварами(МассивРаспоряжений);
				Если ЗначениеЗаполнено(МассивРаспоряженийСТоварами) Тогда 
					ЗначенияЗаполнения = Новый Структура;
					ЗначенияЗаполнения.Вставить("АдресДоставки",   ТекАдресДоставки);
					ЗначенияЗаполнения.Вставить("Организация",     ТекОрганизация);
					ЗначенияЗаполнения.Вставить("Плательщик", 	   ТекПлательщик);
					ЗначенияЗаполнения.Вставить("Грузополучатель", ТекГрузополучатель);
					ЗначенияЗаполнения.Вставить("Перевозчик",      ТекПеревозчик);
					ТранспортнаяНакладная = СоздатьИлиЗаполнитьТранспортнуюНакладную(МассивРаспоряженийСТоварами, ЗначенияЗаполнения);
					СозданныеТранспортныеНакладные.Добавить(ТранспортнаяНакладная);
				КонецЕсли;
				МассивРаспоряжений.Очистить();
			КонецЕсли;
						
		КонецЕсли;
		
		ТекАдресДоставки 	= Выборка.АдресДоставки;
		ТекОрганизация	 	= Выборка.Организация;
		ТекПлательщик	 	= Выборка.Плательщик;
		ТекГрузополучатель	= Выборка.Грузополучатель;
		ТекПеревозчик	    = Выборка.Перевозчик;
		
		МассивРаспоряжений.Добавить(Выборка.Ссылка);
		ПервоеРаспоряжение = Ложь;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивРаспоряжений) Тогда	
		МассивРаспоряженийСТоварами = ПолучитьТолькоДокументыОснованияСТоварами(МассивРаспоряжений);
		Если ЗначениеЗаполнено(МассивРаспоряженийСТоварами) Тогда
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("АдресДоставки",   ТекАдресДоставки);
			ЗначенияЗаполнения.Вставить("Организация",     ТекОрганизация);
			ЗначенияЗаполнения.Вставить("Плательщик",      ТекПлательщик);
			ЗначенияЗаполнения.Вставить("Грузополучатель", ТекГрузополучатель);
			ЗначенияЗаполнения.Вставить("Перевозчик",      ТекПеревозчик);
			ТранспортнаяНакладная = СоздатьИлиЗаполнитьТранспортнуюНакладную(МассивРаспоряженийСТоварами, ЗначенияЗаполнения, ?(МассивРаспоряженийСТоварами.Количество() и ТипЗнч(МассивРаспоряженийСТоварами[0].Ссылка) = Тип("ДокументСсылка.ЗаданиеНаПеревозку"), МассивРаспоряженийСТоварами[0].Ссылка, Неопределено));
			СозданныеТранспортныеНакладные.Добавить(ТранспортнаяНакладная);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь); 
	
	Возврат СозданныеТранспортныеНакладные;
		
КонецФункции

&Вместо("ПолучитьТолькоДокументыОснованияСТоварами")
Функция ВИЛС_ПолучитьТолькоДокументыОснованияСТоварами(МассивВсехРаспоряжений, Отказ, ТекущееЗаданиеНаПеревозку) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ВидКорректировки
	|
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	//++ НЕ УТ
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ОтгрузкаТоваровСХранения КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	//-- НЕ УТ
	//++ НЕ УТКА
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаДавальцу КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВозвратСырьяДавальцу КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	//|ОБЪЕДИНИТЬ ВСЕ  // begin fix Suetin 19.09.2019 12:50:30
	//|
	//|ВЫБРАТЬ
	//|	ДанныеДокументов.Ссылка КАК Ссылка,
	//|	ДанныеДокументов.Ссылка.ВИЛС_ДоговорПеревозчика.ВалютаВзаиморасчетов КАК Валюта,
	//|	ДанныеДокументов.Распоряжение.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	//|ИЗ
	//|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ДанныеДокументов
	//|ГДЕ
	//|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.Распоряжение КАК Ссылка,
	|	ДанныеДокументов.Распоряжение.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|	ДанныеДокументов.Распоряжение.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Распоряжение В(&МассивОбъектов)      
	|   И ДанныеДокументов.Ссылка = &ТекущееЗаданиеНаПеревозку
	// end fix Suetin 19.09.2019 12:50:36
	|

	//-- НЕ УТКА
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК ДокументОснование,
	|	ЛОЖЬ КАК Корректировочный
	|
	|ПОМЕСТИТЬ СчетаФактурыОснования
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ДанныеДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивВсехРаспоряжений);
	Запрос.УстановитьПараметр("ТекущееЗаданиеНаПеревозку", ТекущееЗаданиеНаПеревозку);       // fix Suetin 20.09.2019 15:56:45
	Запрос.Выполнить();
	
	РеализацияТоваровУслугЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ВозвратТоваровПоставщикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПеремещениеТоваровЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	КорректировкаРеализацииЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	
	//++ НЕ УТ
	ОтгрузкаТоваровСХраненияЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПередачаТоваровХранителюЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПередачаСырьяПереработчикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
	//-- НЕ УТ
	ЗаданиеНаПеревозкуЛокализация.ВИЛС_ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ТекущееЗаданиеНаПеревозку);        // fix Suetin 19.09.2019 15:47:00
	//++ НЕ УТКА
	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	ПараметрыЗаполнения.ПересчитыватьВВалютуРегл = Ложь;
	ПередачаДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
	ВозвратСырьяДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
	//-- НЕ УТКА
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ДокументТовары
	|		
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	ПередачаСырьяПереработчикуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	ПередачаТоваровХранителюТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка
	|ИЗ
	|	ОтгрузкаТоваровСХраненияТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
//-- НЕ УТ
//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	ПередачаДавальцуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка
	|ИЗ
	|	ВозвратСырьяДавальцуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	ПеремещениеТоваровТаблицаТоваров КАК ПеремещениеТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка
	|ИЗ
	|	ТаблицаТоваровКорректировкаРеализации КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка
	|ИЗ
	|	ВозвратТоваровПоставщикуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|   // begin fix Suetin 20.09.2019 10:56:13
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Распоряжение         // fix Suetin 20.09.2019 16:07:00   Ссылка -> Распоряжение
	|ИЗ
	|	ЗаданиеНаПеревозкуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|";   // end fix Suetin 20.09.2019 10:56:23
		
	СтрокиТоваров = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивРаспоряженийСТоварами = Новый Массив;
	
	Пока СтрокиТоваров.Следующий() Цикл
		Если МассивРаспоряженийСТоварами.Найти(СтрокиТоваров.Ссылка) = Неопределено Тогда
			МассивРаспоряженийСТоварами.Добавить(СтрокиТоваров.Ссылка);	
		КонецЕсли;			
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВсехРаспоряжений, Неопределено);
	
	МассивРаспоряженийБезТоваров = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивВсехРаспоряжений, МассивРаспоряженийСТоварами);
	              	
	Для Каждого РаспоряжениеБезТоваров Из МассивРаспоряженийБезТоваров Цикл
		ТекстСообщения = НСтр("ru = 'Документ ""%Документ%"" не может являться основанием для транспортной накладной, т.к. в нем отсутствует номенклатура типа ""%ТипТовар%"" или ""%ТипТара%"".';
								|en = 'The ""%Документ%"" document cannot be a basis for the consignment note as it does not contain products of the ""%ТипТовар%"" or ""%ТипТара%"" type.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", РаспоряжениеБезТоваров);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипТовар%", Перечисления.ТипыНоменклатуры.Товар);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипТара%", Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, РаспоряжениеБезТоваров,,,Отказ);
	КонецЦикла;
	
	Возврат МассивРаспоряженийСТоварами;
	
КонецФункции

&Вместо("СоздатьТранспортныеНакладныеДляЗаданийНаПеревозку")    //ИзменениеИКонтроль
Функция ВИЛС_СоздатьТранспортныеНакладныеДляЗаданийНаПеревозку(МассивОбъектов, ВыделенныеСтроки)

	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ЗаданиеНаПеревозку.ТекстЗапросаПолученияСпискаНакладныхИзЗаданийНаПеревозку() + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку КАК Ссылка,
	|	НакладныеПоЗаданиямНаПеревозку.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ТранспортнаяНакладная.Ссылка, ЗНАЧЕНИЕ(Документ.ТранспортнаяНакладная.ПустаяСсылка)) КАК ТранспортнаяНакладная,
	|	ЕСТЬNULL(ТранспортнаяНакладная.Организация, ЕСТЬNULL(НакладныеПоЗаданиямНаПеревозку.Накладная.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК Организация,
	|	ВЫБОР
	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ
	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель
	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ
	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент
	//++ НЕ УТКА
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПередачаДавальцу).Контрагент
	//-- НЕ УТКА
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).Организация
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику                          // begin fix Suetin 24.09.2019 13:23:12
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ЗаказПоставщику).Организация   // end fix Suetin 24.09.2019 13:23:16
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	//++ НЕ УТ
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	//-- НЕ УТ				
	//++ НЕ УТКА
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
	//-- НЕ УТКА
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент

	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.ОрганизацияПолучатель
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику     // fix Suetin 24.09.2019 13:19:34	
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Плательщик,
	|	ЕСТЬNULL(ТранспортнаяНакладная.АдресДоставки, НакладныеПоЗаданиямНаПеревозку.АдресДоставки) КАК АдресДоставки
	|ИЗ
	|	НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|		ПО НакладныеПоЗаданиямНаПеревозку.АдресДоставки = ТранспортнаяНакладная.АдресДоставки
	|			И НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку = ТранспортнаяНакладная.ЗаданиеНаПеревозку
	|			И НакладныеПоЗаданиямНаПеревозку.Накладная.Организация = ТранспортнаяНакладная.Организация
	|			И (ВЫБОР
	|				КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	//++ НЕ УТ
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ
	|						) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель
	|				КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	//++ НЕ УТ
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ
	|						) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент
	//++ НЕ УТКА
	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПередачаДавальцу).Контрагент
	//-- НЕ УТКА
	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).Организация
	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику                          // begin fix Suetin 24.09.2019 13:23:12
	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ЗаказПоставщику).Организация   // end fix Suetin 24.09.2019 13:23:16
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			КОНЕЦ = ТранспортнаяНакладная.Грузоотправитель)
	|			И ВЫБОР
	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	//++ НЕ УТ
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ				
	//++ НЕ УТКА
	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
	//-- НЕ УТКА
	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент

	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|					ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|					ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику     // fix Suetin 24.09.2019 13:19:34	
	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Организация
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			КОНЕЦ = ТранспортнаяНакладная.Плательщик
	|			И (ТранспортнаяНакладная.Проведен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	Организация,
	|	Грузополучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НакладныеПоЗаданиямНаПеревозку.Накладная,
	|	НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку КАК Ссылка,
	|	ЕСТЬNULL(НакладныеПоЗаданиямНаПеревозку.Накладная.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ВЫБОР
	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ
	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель
	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ
	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент
	//++ НЕ УТКА
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПередачаДавальцу).Контрагент
	//-- НЕ УТКА
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).Организация
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику                          // begin fix Suetin 24.09.2019 13:23:12
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ЗаказПоставщику).Организация   // end fix Suetin 24.09.2019 13:23:16
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
	//++ НЕ УТ
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
	//-- НЕ УТ				
	//++ НЕ УТКА
	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
	//-- НЕ УТКА
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент

	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
	//++ НЕ УТ
	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику     // fix Suetin 24.09.2019 13:19:34
	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Плательщик,
	|	НакладныеПоЗаданиямНаПеревозку.АдресДоставки КАК АдресДоставки,
	|	НакладныеПоЗаданиямНаПеревозку.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснованияОснования
	|		ПО НакладныеПоЗаданиямНаПеревозку.Накладная = ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.ЗаданиеНаПеревозку = НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.Проведен)
	|ГДЕ
	|	ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	Организация,
	|	Грузополучатель";

	Запрос.УстановитьПараметр("ЗаданияНаПеревозку",  	   МассивОбъектов);
	Запрос.УстановитьПараметр("ВыделенныеСтрокиАдресов",   ВыделенныеСтроки);
	Запрос.УстановитьПараметр("НетВыделенныхСтрокАдресов", НЕ ЗначениеЗаполнено(ВыделенныеСтроки));
	Запрос.УстановитьПараметр("ВсеРаспоряжения",           Истина);
	Запрос.УстановитьПараметр("Распоряжения",              Новый Массив);

	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	ТранспортныеНакладныеПоНомерамСтрок = МассивРезультатов[2].Выбрать();
	РаспоряженияБезТранспортныхНакладных = МассивРезультатов[3].Выбрать();

	СозданныеТранспортныеНакладные 	= Новый Массив;

	Пока ТранспортныеНакладныеПоНомерамСтрок.Следующий() Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Ссылка", 			ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
		СтруктураПоиска.Вставить("НомерСтроки", 	ТранспортныеНакладныеПоНомерамСтрок.НомерСтроки);
		СтруктураПоиска.Вставить("Организация", 	ТранспортныеНакладныеПоНомерамСтрок.Организация);
		СтруктураПоиска.Вставить("Плательщик", 		ТранспортныеНакладныеПоНомерамСтрок.Плательщик);
		СтруктураПоиска.Вставить("Грузополучатель", ТранспортныеНакладныеПоНомерамСтрок.Грузополучатель);

		МассивРаспоряженийБезТранспортныхНакладных = Новый Массив;

		Пока РаспоряженияБезТранспортныхНакладных.НайтиСледующий(СтруктураПоиска) Цикл
			МассивРаспоряженийБезТранспортныхНакладных.Добавить(РаспоряженияБезТранспортныхНакладных.Накладная);		
		КонецЦикла;
		//#Удаление
		//МассивРаспоряженийСТоварами = ПолучитьТолькоДокументыОснованияСТоварами(МассивРаспоряженийБезТранспортныхНакладных);
		//#КонецУдаления
		//#Вставка
		МассивРаспоряженийСТоварами = ВИЛС_ПолучитьТолькоДокументыОснованияСТоварами(МассивРаспоряженийБезТранспортныхНакладных, , ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
		//#КонецВставки
		Если НЕ ЗначениеЗаполнено(МассивРаспоряженийСТоварами) Тогда
			Продолжить;
		КонецЕсли;

		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("АдресДоставки", 	ТранспортныеНакладныеПоНомерамСтрок.АдресДоставки);
		ЗначенияЗаполнения.Вставить("Организация", 		ТранспортныеНакладныеПоНомерамСтрок.Организация);
		ЗначенияЗаполнения.Вставить("Плательщик", 		ТранспортныеНакладныеПоНомерамСтрок.Плательщик);
		ЗначенияЗаполнения.Вставить("Грузополучатель", 	ТранспортныеНакладныеПоНомерамСтрок.Грузополучатель);
		ЗначенияЗаполнения.Вставить("Перевозчик", 		Неопределено);

		Если ЗначениеЗаполнено(ТранспортныеНакладныеПоНомерамСтрок.ТранспортнаяНакладная) Тогда
			ТранспортнаяНакладная = ПерезаписатьТранспортнуюНакладную(
			ТранспортныеНакладныеПоНомерамСтрок.ТранспортнаяНакладная, 
			МассивРаспоряженийСТоварами,
			ЗначенияЗаполнения,
			ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
		Иначе
			ТранспортнаяНакладная = СоздатьИлиЗаполнитьТранспортнуюНакладную(
			МассивРаспоряженийСТоварами, 
			ЗначенияЗаполнения, 
			ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
		КонецЕсли;

		СозданныеТранспортныеНакладные.Добавить(ТранспортнаяНакладная);

	КонецЦикла;

	Возврат СозданныеТранспортныеНакладные;

КонецФункции

&Вместо("ЗаполнитьРеквизитыТранспортнойНакладной")
Процедура ВИЛС_ЗаполнитьРеквизитыТранспортнойНакладной(МассивРаспоряжений, РеквизитыТранспортнойНакладной, ЗначенияЗаполнения, ЗаданиеНаПеревозку)

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;             		// fix Suetin 23.09.2019 12:04:26
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Задание,        						// begin fix Suetin 20.09.2019 17:04:48
	|	ЗаданиеНаПеревозкуРаспоряжения.Вес КАК Вес,              
	|	ЗаданиеНаПеревозкуРаспоряжения.Объем КАК Объем,          						// end fix Suetin 20.09.2019 17:04:53
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.АвтомобильГосударственныйНомер КАК АвтомобильГосударственныйНомер,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.АвтомобильМарка КАК АвтомобильМарка,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.АвтомобильВместимостьВКубическихМетрах КАК АвтомобильВместимостьВКубическихМетрах,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.АвтомобильГрузоподъемностьВТоннах КАК АвтомобильГрузоподъемностьВТоннах,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.АвтомобильТип КАК АвтомобильТип,
	|	ЗаданиеНаПеревозкуМаршрут.Адрес КАК АдресДоставки,
	|	ЗаданиеНаПеревозкуМаршрут.АдресЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВидПеревозки КАК ВидПеревозки,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВИЛС_Водитель КАК Водитель,          			// begin fix Suetin 23.09.2019 14:25:14
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВИЛС_Руководитель КАК Руководитель,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВИЛС_ГлавныйБухгалтер КАК ГлавныйБухгалтер,          
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВИЛС_ДоверенностьНомер КАК ДоверенностьНомер, 
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВИЛС_Водитель 			КАК ДоверенностьЛицо, 
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ВИЛС_ДоверенностьДата 	КАК ДоверенностьДата, 	// end fix Suetin 23.09.2019 14:26:44
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ГосударственныйНомерПрицепа КАК ГосударственныйНомерПрицепа,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ЛицензионнаяКарточкаВид КАК ЛицензионнаяКарточкаВид,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ЛицензионнаяКарточкаНомер КАК ЛицензионнаяКарточкаНомер,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ЛицензионнаяКарточкаРегистрационныйНомер КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.ЛицензионнаяКарточкаСерия КАК ЛицензионнаяКарточкаСерия,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.Прицеп КАК Прицеп
	|ПОМЕСТИТЬ ДанныеЗаданияНаПеревозку
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ПО ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи = ЗаданиеНаПеревозкуМаршрут.КлючСвязи
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|;
	|ВЫБРАТЬ
	|	ДанныеЗаданияНаПеревозку.Распоряжение 	КАК Распоряжение,
	|	ДанныеЗаданияНаПеревозку.Задание		КАК Задание,
	|	ДанныеЗаданияНаПеревозку.АдресДоставки	КАК АдресДоставки
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозку	 
	|ГДЕ
	|	ДанныеЗаданияНаПеревозку.Распоряжение В(&МассивРаспоряжений)
	|		И (ДанныеЗаданияНаПеревозку.Задание = &ЗаданиеНаПеревозку
	|			ИЛИ &НетЗаданияНаПеревозку)
	|;";
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("МассивРаспоряжений", МассивРаспоряжений);
	Запрос.УстановитьПараметр("НетЗаданияНаПеревозку", НЕ ЗначениеЗаполнено(ЗаданиеНаПеревозку));
	Запрос.Выполнить();
	ЗаданиеНаПеревозкуЛокализация.ВИЛС_ПоместитьВременнуюТаблицуТоваровПродолжение(Запрос.МенеджерВременныхТаблиц);
	Запрос.Текст = "
	|ВЫБРАТЬ ИСТИНА КАК Поле1	// 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГосударственныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГосударственныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильГосударственныйНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильМарка, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильМарка, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильМарка,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильВместимостьВКубическихМетрах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильВместимостьВКубическихМетрах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильВместимостьВКубическихМетрах,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГрузоподъемностьВТоннах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГрузоподъемностьВТоннах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильГрузоподъемностьВТоннах,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильТип, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильТип, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильТип,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставки, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказКлиента.АдресДоставки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставки, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставки
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставкиЗначенияПолей, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказКлиента.АдресДоставкиЗначенияПолей
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставкиЗначенияПолей, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставкиЗначенияПолей
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставкиЗначенияПолей,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """") КАК АдресПогрузки,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """") КАК АдресПогрузкиЗначенияПолей,
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента КАК БанковскийСчетЗаказчикаПеревозки,
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента КАК БанковскийСчетПлательщика,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ВидПеревозки, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ВидПеревозки, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Водитель, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Водитель, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Водитель,
	|	ДокументРаспоряжение.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ГосударственныйНомерПрицепа, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ГосударственныйНомерПрицепа, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ГосударственныйНомерПрицепа,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДокументРаспоряжение.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	ДокументРаспоряжение.ДоверенностьДата КАК ДоверенностьДата,
	|	ДокументРаспоряжение.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	ДокументРаспоряжение.ДоверенностьНомер КАК ДоверенностьНомер,
	|	ДокументРаспоряжение.Контрагент КАК ЗаказчикПеревозки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаВид, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаВид, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаВид,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаСерия, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаСерия, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаСерия,
	|	ДокументРаспоряжение.Организация КАК Организация,
	|	ДокументРаспоряжение.Отпустил КАК Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность КАК ОтпустилДолжность,
	|	ДокументРаспоряжение.Контрагент КАК Плательщик,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Прицеп, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Прицеп, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Прицеп,
	|	ДокументРаспоряжение.Руководитель КАК Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК УдостоверениеНомер,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК УдостоверениеСерия
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДокументРаспоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументРаспоряжениеТовары
	|		ПО ДокументРаспоряжение.Ссылка = ДокументРаспоряжениеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуЗаказы
	|		ПО (ДокументРаспоряжение.РеализацияПоЗаказам)
	|			И (ДокументРаспоряжениеТовары.ЗаказКлиента = ДанныеЗаданияНаПеревозкуЗаказы.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуНакладные
	|		ПО (НЕ ДокументРаспоряжение.РеализацияПоЗаказам)
	|			И ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуНакладные.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ВЫБОР
	|				КОГДА ДокументРаспоряжение.РеализацияПоЗаказам
	|					ТОГДА ДанныеЗаданияНаПеревозкуЗаказы.Водитель = ДокументыФизическихЛиц.Физлицо
	|				ИНАЧЕ ДанныеЗаданияНаПеревозкуНакладные.Водитель = ДокументыФизическихЛиц.Физлицо
	|			КОНЕЦ)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГосударственныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГосударственныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильМарка, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильМарка, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильВместимостьВКубическихМетрах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильВместимостьВКубическихМетрах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГрузоподъемностьВТоннах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГрузоподъемностьВТоннах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильТип, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильТип, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставки, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказНаПеремещение.АдресДоставки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставки, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставки
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставкиЗначенияПолей, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказНаПеремещение.АдресДоставкиЗначенияПолей
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставкиЗначенияПолей, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставкиЗначенияПолей
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """"),
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """"),
	|	ДокументРаспоряжение.БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.БанковскийСчетОрганизации
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ВидПеревозки, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ВидПеревозки, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Водитель, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Водитель, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДокументРаспоряжение.ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ГосударственныйНомерПрицепа, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ГосударственныйНомерПрицепа, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Организация,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.ОрганизацияПолучатель
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.Организация,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаВид, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаВид, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаСерия, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаСерия, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Организация,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка),
	|	"""",
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.ОрганизацияПолучатель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Прицеп, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Прицеп, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """"),
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """")
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДокументРаспоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументРаспоряжениеТовары
	|		ПО ДокументРаспоряжение.Ссылка = ДокументРаспоряжениеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуЗаказы
	|		ПО (ДокументРаспоряжение.ПеремещениеПоЗаказам)
	|			И (ДокументРаспоряжениеТовары.ЗаказНаПеремещение = ДанныеЗаданияНаПеревозкуЗаказы.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуНакладные
	|		ПО (НЕ ДокументРаспоряжение.ПеремещениеПоЗаказам)
	|			И ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуНакладные.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ВЫБОР
	|				КОГДА ДокументРаспоряжение.ПеремещениеПоЗаказам
	|					ТОГДА ДанныеЗаданияНаПеревозкуЗаказы.Водитель = ДокументыФизическихЛиц.Физлицо
	|				ИНАЧЕ ДанныеЗаданияНаПеревозкуНакладные.Водитель = ДокументыФизическихЛиц.Физлицо
	|			КОНЕЦ)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.СкладОтправитель = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГосударственныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильМарка, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильВместимостьВКубическихМетрах, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГрузоподъемностьВТоннах, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильТип, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставки, """")
	|		ИНАЧЕ ДокументРаспоряжение.АдресДоставки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставкиЗначенияПолей, """")
	|		ИНАЧЕ ДокументРаспоряжение.АдресДоставкиЗначенияПолей
	|	КОНЕЦ,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """"),
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """"),
	|	ДокументРаспоряжение.БанковскийСчетОрганизации,
	|	ДокументРаспоряжение.БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ВидПеревозки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Водитель, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ГосударственныйНомерПрицепа, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ,
	|	ДокументРаспоряжение.ДоверенностьВыдана,
	|	ДокументРаспоряжение.ДоверенностьДата,
	|	ДокументРаспоряжение.ДоверенностьЛицо,
	|	ДокументРаспоряжение.ДоверенностьНомер,
	|	ДокументРаспоряжение.Организация,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаВид, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаСерия, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Организация,
	|	ДокументРаспоряжение.Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность,
	|	ДокументРаспоряжение.Организация,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Прицеп, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """"),
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """")
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДокументРаспоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуНакладные
	|		ПО ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуНакладные.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ДанныеЗаданияНаПеревозкуНакладные.Водитель = ДокументыФизическихЛиц.Физлицо)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//++ НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГосударственныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильМарка, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильВместимостьВКубическихМетрах, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГрузоподъемностьВТоннах, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильТип, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставки, """")
	|		ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказДавальца.АдресДоставки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставкиЗначенияПолей, """")
	|		ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказДавальца.АдресДоставкиЗначенияПолей
	|	КОНЕЦ,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """"),
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """"),
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента,
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ВидПеревозки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Водитель, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ГосударственныйНомерПрицепа, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.Контрагент,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаВид, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаСерия, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Организация,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка),
	|	"""",
	|	ДокументРаспоряжение.Контрагент,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжениеТовары.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Прицеп, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка),
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """"),
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """")
	|ИЗ
	|	Документ.ПередачаДавальцу КАК ДокументРаспоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДавальцу.Товары КАК ДокументРаспоряжениеТовары
	|		ПО ДокументРаспоряжение.Ссылка = ДокументРаспоряжениеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуЗаказы
	|		ПО (ДокументРаспоряжениеТовары.ЗаказДавальца = ДанныеЗаданияНаПеревозкуЗаказы.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ДанныеЗаданияНаПеревозкуЗаказы.Водитель = ДокументыФизическихЛиц.Физлицо)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГосударственныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильМарка, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильВместимостьВКубическихМетрах, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГрузоподъемностьВТоннах, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильТип, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставки, """")
	|		ИНАЧЕ ДокументРаспоряжение.АдресДоставки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставкиЗначенияПолей, """")
	|		ИНАЧЕ ДокументРаспоряжение.АдресДоставкиЗначенияПолей
	|	КОНЕЦ,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """"),
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """"),
	|	ДокументРаспоряжение.БанковскийСчетОрганизации,
	|	ДокументРаспоряжение.БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ВидПеревозки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Водитель, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ГосударственныйНомерПрицепа, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ,
	|	ДокументРаспоряжение.ДоверенностьВыдана,
	|	ДокументРаспоряжение.ДоверенностьДата,
	|	ДокументРаспоряжение.ДоверенностьЛицо,
	|	ДокументРаспоряжение.ДоверенностьНомер,
	|	ДокументРаспоряжение.Организация,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаВид, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаСерия, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Организация,
	|	ДокументРаспоряжение.Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность,
	|	ДокументРаспоряжение.Организация,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|			ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Прицеп, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ДокументРаспоряжение.Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """"),
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """")
	|ИЗ
	|	Документ.ОтгрузкаТоваровСХранения КАК ДокументРаспоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуНакладные
	|		ПО ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуНакладные.Распоряжение
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ДанныеЗаданияНаПеревозкуНакладные.Водитель = ДокументыФизическихЛиц.Физлицо)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГосударственныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГосударственныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильГосударственныйНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильМарка, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильМарка, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильМарка,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильВместимостьВКубическихМетрах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильВместимостьВКубическихМетрах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильВместимостьВКубическихМетрах,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГрузоподъемностьВТоннах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГрузоподъемностьВТоннах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильГрузоподъемностьВТоннах,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильТип, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильТип, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильТип,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставки, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказКлиента.АдресДоставки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставки, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставки
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставкиЗначенияПолей, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказКлиента.АдресДоставкиЗначенияПолей
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставкиЗначенияПолей, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставкиЗначенияПолей
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставкиЗначенияПолей,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """") КАК АдресПогрузки,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """") КАК АдресПогрузкиЗначенияПолей,
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента КАК БанковскийСчетЗаказчикаПеревозки,
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента КАК БанковскийСчетПлательщика,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ВидПеревозки, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ВидПеревозки, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Водитель, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Водитель, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Водитель,
	|	ДокументРаспоряжение.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ГосударственныйНомерПрицепа, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ГосударственныйНомерПрицепа, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ГосударственныйНомерПрицепа,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	"""" КАК ДоверенностьВыдана,
	|	"""" КАК ДоверенностьДата,
	|	"""" КАК ДоверенностьЛицо,
	|	"""" КАК ДоверенностьНомер,
	|	ДокументРаспоряжение.Контрагент КАК ЗаказчикПеревозки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаВид, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаВид, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаВид,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаСерия, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаСерия, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаСерия,
	|	ДокументРаспоряжение.Организация КАК Организация,
	|	ДокументРаспоряжение.Отпустил КАК Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность КАК ОтпустилДолжность,
	|	ДокументРаспоряжение.Контрагент КАК Плательщик,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Прицеп, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Прицеп, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Прицеп,
	|	ДокументРаспоряжение.Руководитель КАК Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК УдостоверениеНомер,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК УдостоверениеСерия
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК ДокументРаспоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ДокументРаспоряжениеТовары
	|		ПО ДокументРаспоряжение.Ссылка = ДокументРаспоряжениеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуЗаказы
	|		ПО (ДокументРаспоряжение.ПередачаПоЗаказам)
	|			И (ДокументРаспоряжениеТовары.ЗаказКлиента = ДанныеЗаданияНаПеревозкуЗаказы.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуНакладные
	|		ПО (НЕ ДокументРаспоряжение.ПередачаПоЗаказам)
	|			И ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуНакладные.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ВЫБОР
	|				КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|					ТОГДА ДанныеЗаданияНаПеревозкуЗаказы.Водитель = ДокументыФизическихЛиц.Физлицо
	|				ИНАЧЕ ДанныеЗаданияНаПеревозкуНакладные.Водитель = ДокументыФизическихЛиц.Физлицо
	|			КОНЕЦ)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГосударственныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГосударственныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильГосударственныйНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильМарка, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильМарка, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильМарка,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильВместимостьВКубическихМетрах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильВместимостьВКубическихМетрах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильВместимостьВКубическихМетрах,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГрузоподъемностьВТоннах, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильГрузоподъемностьВТоннах, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильГрузоподъемностьВТоннах,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильТип, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АвтомобильТип, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АвтомобильТип,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставки, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказПереработчику.АдресДоставки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставки, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставки
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставкиЗначенияПолей, """")
	|					ИНАЧЕ ДокументРаспоряжениеТовары.ЗаказПереработчику.АдресДоставкиЗначенияПолей
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.АдресДоставкиЗначенияПолей, """")
	|				ИНАЧЕ ДокументРаспоряжение.АдресДоставкиЗначенияПолей
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставкиЗначенияПолей,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """") КАК АдресПогрузки,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """") КАК АдресПогрузкиЗначенияПолей,
	|	ДокументРаспоряжение.БанковскийСчетОрганизации КАК БанковскийСчетЗаказчикаПеревозки,
	|	ДокументРаспоряжение.БанковскийСчетОрганизации КАК БанковскийСчетПлательщика,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ВидПеревозки, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ВидПеревозки, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Водитель, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Водитель, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Водитель,
	|	ДокументРаспоряжение.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ГосударственныйНомерПрицепа, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ГосударственныйНомерПрицепа, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ГосударственныйНомерПрицепа,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДокументРаспоряжение.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	ДокументРаспоряжение.ДоверенностьДата КАК ДоверенностьДата,
	|	ДокументРаспоряжение.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	ДокументРаспоряжение.ДоверенностьНомер КАК ДоверенностьНомер,
	|	ДокументРаспоряжение.Организация КАК ЗаказчикПеревозки,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаВид, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаВид, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаВид,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаРегистрационныйНомер, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаСерия, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.ЛицензионнаяКарточкаСерия, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЛицензионнаяКарточкаСерия,
	|	ДокументРаспоряжение.Организация,
	|	ДокументРаспоряжение.Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность,
	|	ДокументРаспоряжение.Контрагент,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументРаспоряжениеТовары.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Прицеп, """")
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументРаспоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|					ТОГДА ЕСТЬNULL(ДанныеЗаданияНаПеревозкуНакладные.Прицеп, """")
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Прицеп,
	|	ДокументРаспоряжение.Руководитель КАК Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК УдостоверениеНомер,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК УдостоверениеСерия
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК ДокументРаспоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументРаспоряжениеТовары
	|		ПО ДокументРаспоряжение.Ссылка = ДокументРаспоряжениеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуЗаказы
	|		ПО (ДокументРаспоряжение.ПередачаПоЗаказам)
	|			И (ДокументРаспоряжениеТовары.ЗаказПереработчику = ДанныеЗаданияНаПеревозкуЗаказы.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуНакладные
	|		ПО (НЕ ДокументРаспоряжение.ПередачаПоЗаказам)
	|			И ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуНакладные.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ВЫБОР
	|				КОГДА ДокументРаспоряжение.ПередачаПоЗаказам
	|					ТОГДА ДанныеЗаданияНаПеревозкуЗаказы.Водитель = ДокументыФизическихЛиц.Физлицо
	|				ИНАЧЕ ДанныеЗаданияНаПеревозкуНакладные.Водитель = ДокументыФизическихЛиц.Физлицо
	|			КОНЕЦ)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	//++ НЕ УТКА
	|
	|ВЫБРАТЬ
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """"),
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """"),
	|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.ГлавныйБухгалтер,
	|	"""",
	|	ДокументРаспоряжение.Организация,
	|	ДокументРаспоряжение.Контрагент,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.Организация,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.Организация,
	|	ДокументРаспоряжение.Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность,
	|	ДокументРаспоряжение.Контрагент,
	|	"""",
	|	ДокументРаспоряжение.Руководитель,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.ВозвратСырьяДавальцу КАК ДокументРаспоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	|
	|ВЫБРАТЬ
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.АдресДоставки,
	|	"""",
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """"),
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """"),
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента,
	|	ДокументРаспоряжение.БанковскийСчетКонтрагента,
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.ГлавныйБухгалтер,
	|	"""",
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Грузоотправитель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Контрагент
	|		ИНАЧЕ ДокументРаспоряжение.Грузополучатель
	|	КОНЕЦ,
	|	ДокументРаспоряжение.ДоверенностьВыдана,
	|	ДокументРаспоряжение.ДоверенностьДата,
	|	ДокументРаспоряжение.ДоверенностьЛицо,
	|	ДокументРаспоряжение.ДоверенностьНомер,
	|	ДокументРаспоряжение.Контрагент,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ДокументРаспоряжение.Организация,
	|	ДокументРаспоряжение.Отпустил,
	|	ДокументРаспоряжение.ОтпустилДолжность,
	|	ДокументРаспоряжение.Контрагент,
	|	"""",
	|	ДокументРаспоряжение.Руководитель,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДокументРаспоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	// begin fix Suetin 20.09.2019 16:51:21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГосударственныйНомер, """") КАК АвтомобильГосударственныйНомер,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильМарка, """") КАК АвтомобильМарка,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильВместимостьВКубическихМетрах, """") КАК АвтомобильВместимостьВКубическихМетрах,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильГрузоподъемностьВТоннах, """") КАК АвтомобильГрузоподъемностьВТоннах,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АвтомобильТип, """") КАК АвтомобильТип,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставки, """") КАК АдресДоставки,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.АдресДоставкиЗначенияПолей, """") КАК АдресДоставкиЗначенияПолей,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """") КАК АдресПогрузки,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.ЗначенияПолей, """") КАК АдресПогрузкиЗначенияПолей,
	|	ДокументРаспоряжение.БанковскийСчет КАК БанковскийСчетЗаказчикаПеревозки,
	|	ДокументРаспоряжение.БанковскийСчет КАК БанковскийСчетПлательщика,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ВидПеревозки, """") КАК ВидПеревозки,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Водитель, """") КАК Водитель,
	|	ДанныеЗаданияНаПеревозкуЗаказы.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ГосударственныйНомерПрицепа, """") КАК ГосударственныйНомерПрицепа,
	|	ВЫБОР
	|		КОГДА ДокументРаспоряжение.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Контрагент
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА НЕ ДокументРаспоряжение.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДокументРаспоряжение.Организация
	|		ИНАЧЕ ДокументРаспоряжение.Контрагент
	|	КОНЕЦ КАК Грузополучатель,
	|	ДокументРаспоряжение.Организация 					КАК ДоверенностьВыдана,
	|	ДанныеЗаданияНаПеревозкуЗаказы.ДоверенностьДата 	КАК ДоверенностьДата,
	|	ДанныеЗаданияНаПеревозкуЗаказы.ДоверенностьЛицо 	КАК ДоверенностьЛицо,
	|	ДанныеЗаданияНаПеревозкуЗаказы.ДоверенностьНомер 	КАК ДоверенностьНомер,
	|	ДокументРаспоряжение.Организация КАК ЗаказчикПеревозки,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаВид, """") КАК ЛицензионнаяКарточкаВид,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаНомер, """") КАК ЛицензионнаяКарточкаНомер,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаРегистрационныйНомер, """") КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.ЛицензионнаяКарточкаСерия, """") КАК ЛицензионнаяКарточкаСерия,
	|	ДокументРаспоряжение.Организация,
	|	"""" КАК Отпустил,
	|	"""" КАК ОтпустилДолжность,
	|	ДокументРаспоряжение.Контрагент,
	|	ЕСТЬNULL(ДанныеЗаданияНаПеревозкуЗаказы.Прицеп, """") КАК Прицеп,
	|	ДанныеЗаданияНаПеревозкуЗаказы.Руководитель КАК Руководитель,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК УдостоверениеНомер,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК УдостоверениеСерия
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДокументРаспоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ДокументРаспоряжениеТовары
	|		ПО ДокументРаспоряжение.Ссылка = ДокументРаспоряжениеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаданияНаПеревозку КАК ДанныеЗаданияНаПеревозкуЗаказы
	|		ПО ДокументРаспоряжение.Ссылка = ДанныеЗаданияНаПеревозкуЗаказы.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО (ДанныеЗаданияНаПеревозкуЗаказы.Водитель = ДокументыФизическихЛиц.Физлицо)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ДокументРаспоряжение.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|ГДЕ
	|	ДокументРаспоряжение.Ссылка В(&МассивРаспоряжений)
	|
	// end fix Suetin 20.09.2019 16:51:11
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТаблицаМассДата.МассаБрутто) КАК МассаБрутто,
	|	СУММА(ТаблицаМассДата.МассаНетто) КАК МассаНетто,
	|	МАКСИМУМ(ТаблицаМассДата.Дата) КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК МассаБрутто,
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры) КАК МассаНетто,
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата) КАК Дата
	|	ИЗ
	|		Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|						И ТаблицаТоваров.ЗаказДавальца.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказДавальца.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказДавальца.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.ЗаказДавальца.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказДавальца.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказДавальца.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказДавальца.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказДавальца.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваров.ЗаказДавальца.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказДавальца.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказДавальца.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.ЗаказДавальца.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказДавальца.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказДавальца.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказДавальца.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказДавальца.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказДавальца.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПередачаДавальцу.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|			ПО ТаблицаТоваров.ЗаказДавальца = ЗаданияНаПеревозкуРаспоряжения.Распоряжение
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|		И (ЗаданияНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|				ИЛИ &НетЗаданияНаПеревозку)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	//++ НЕ УТ
	|
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ОтгрузкаТоваровСХранения.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПередачаТоваровХранителю.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		НЕ ТаблицаТоваров.Ссылка.ПередачаПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|						И ТаблицаТоваров.ЗаказКлиента.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.ЗаказКлиента.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказКлиента.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказКлиента.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL
	|									И ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваров.ЗаказКлиента.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.ЗаказКлиента.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказКлиента.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказКлиента.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПередачаТоваровХранителю.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|			ПО ТаблицаТоваров.ЗаказКлиента = ЗаданияНаПеревозкуРаспоряжения.Распоряжение
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка.ПередачаПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|		И (ЗаданияНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|			ИЛИ &НетЗаданияНаПеревозку
	|			ИЛИ НЕ &ИспользоватьРасширенныеВозможностиЗаказаКлиента)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПередачаСырьяПереработчику.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		НЕ ТаблицаТоваров.Ссылка.ПередачаПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|						И ТаблицаТоваров.ЗаказПереработчику.АдресДоставки = &АдресДоставки
	|						И ТаблицаТоваров.ЗаказПереработчику.Контрагент = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказПереработчику.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказПереработчику.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказПереработчику.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказПереработчику.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваров.ЗаказПереработчику.АдресДоставки = &АдресДоставки
	|						И ТаблицаТоваров.ЗаказПереработчику.Контрагент = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказПереработчику.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказПереработчику.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказПереработчику.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказПереработчику.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказПереработчику.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПередачаСырьяПереработчику.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|			ПО ТаблицаТоваров.ЗаказПереработчику = ЗаданияНаПеревозкуРаспоряжения.Распоряжение
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|		И (ЗаданияНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|				ИЛИ &НетЗаданияНаПеревозку)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ВозвратСырьяДавальцу.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		НЕ ТаблицаТоваров.Ссылка.ПеремещениеПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|						И ТаблицаТоваров.ЗаказНаПеремещение.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказНаПеремещение.Организация
	|							ИНАЧЕ ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказНаПеремещение.Организация = &Организация
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказНаПеремещение.Организация
	|							ИНАЧЕ ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель
	|						КОНЕЦ = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказНаПеремещение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказНаПеремещение.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваров.ЗаказНаПеремещение.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказНаПеремещение.Организация
	|							ИНАЧЕ ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказНаПеремещение.Организация = &Организация
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказНаПеремещение.Организация
	|							ИНАЧЕ ТаблицаТоваров.ЗаказНаПеремещение.ОрганизацияПолучатель
	|						КОНЕЦ = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказНаПеремещение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказНаПеремещение.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|			ПО ТаблицаТоваров.ЗаказНаПеремещение = ЗаданияНаПеревозкуРаспоряжения.Распоряжение
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка.ПеремещениеПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|		И (ЗаданияНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|				ИЛИ &НетЗаданияНаПеревозку)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	|	ГДЕ
	|		НЕ ТаблицаТоваров.Ссылка.РеализацияПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|						И ТаблицаТоваров.ЗаказКлиента.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.ЗаказКлиента.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказКлиента.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказКлиента.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваров.ЗаказКлиента.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.ЗаказКлиента.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.ЗаказКлиента.Организация = &Организация
	|						И ТаблицаТоваров.ЗаказКлиента.Контрагент = &Плательщик
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.ЗаказКлиента.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|			ПО ТаблицаТоваров.ЗаказКлиента = ЗаданияНаПеревозкуРаспоряжения.Распоряжение
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка.РеализацияПоЗаказам
	|		И ТаблицаТоваров.Ссылка В(&МассивРаспоряжений)
	|		И (ЗаданияНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|			ИЛИ &НетЗаданияНаПеревозку
	|			ИЛИ НЕ &ИспользоватьРасширенныеВозможностиЗаказаКлиента)
	// begin fix Suetin 23.09.2019 12:33:04
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|						И ТаблицаТоваров.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|								ТОГДА ТаблицаТоваров.Распоряжение.Организация
	|							КОГДА ТаблицаТоваров.Распоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.Распоряжение.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.Распоряжение.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.Распоряжение.Организация = &Организация
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|								ТОГДА ТаблицаТоваров.Распоряжение.Организация = &Плательщик
	|							ИНАЧЕ ТаблицаТоваров.Распоряжение.Контрагент = &Плательщик
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.Распоряжение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.Распоряжение.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.Распоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ТаблицаТоваров.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.Распоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|								ТОГДА ТаблицаТоваров.Количество
	|							ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|						КОНЕЦ * &ТекстЗапросаВесУпаковки
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваров.АдресДоставки = &АдресДоставки
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|								ТОГДА ТаблицаТоваров.Распоряжение.Организация
	|							КОГДА ТаблицаТоваров.Распоряжение.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|								ТОГДА ТаблицаТоваров.Распоряжение.Контрагент
	|							ИНАЧЕ ТаблицаТоваров.Распоряжение.Грузополучатель
	|						КОНЕЦ = &Грузополучатель
	|						И ТаблицаТоваров.Распоряжение.Организация = &Организация
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|								ТОГДА ТаблицаТоваров.Распоряжение.Организация = &Плательщик
	|							ИНАЧЕ ТаблицаТоваров.Распоряжение.Контрагент = &Плательщик
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА ТаблицаТоваров.Распоряжение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|								ТОГДА ТаблицаТоваров.Распоряжение.ПеревозчикПартнер
	|							ИНАЧЕ НЕОПРЕДЕЛЕНО
	|						КОНЕЦ = &Перевозчик
	|						И ВЫБОР
	|							КОГДА &НетЗаданияНаПеревозку
	|								ТОГДА НЕ ТаблицаТоваров.Распоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|							ИНАЧЕ НЕ ТаблицаТоваров.Распоряжение ЕСТЬ NULL 
	|									И ТаблицаТоваров.Распоряжение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|						КОНЕЦ
	|					ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		МАКСИМУМ(ТаблицаТоваров.Ссылка.Дата)
	|	ИЗ
	|   	ЗаданиеНаПеревозкуТаблицаТоваров КАК ТаблицаТоваров
	 // end fix Suetin 23.09.2019 12:32:56
	|) КАК ТаблицаМассДата";

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесУпаковки", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("ТаблицаТоваров.Упаковка", "ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения", "ТаблицаТоваров.Номенклатура"));

	Запрос.УстановитьПараметр("МассивРаспоряжений", 		   МассивРаспоряжений);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", 		   ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("НетЗаданияНаПеревозку", 		   НЕ ЗначениеЗаполнено(ЗаданиеНаПеревозку));
	Запрос.УстановитьПараметр("ЗаполненаЕдиницаИзмеренияВеса", ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить()));
	Запрос.УстановитьПараметр("СпособыДоставкиСНашимУчастием", ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
	ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками")));
	Запрос.УстановитьПараметр("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
	ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"));

	АдресДоставки   = Неопределено;
	Грузополучатель = Неопределено;
	Организация     = Неопределено;
	Плательщик      = Неопределено;
	Перевозчик      = Неопределено;

	Если ЗначенияЗаполнения <> Неопределено Тогда
		ЗначенияЗаполнения.Свойство("АдресДоставки", 	АдресДоставки);
		ЗначенияЗаполнения.Свойство("Грузополучатель", 	Грузополучатель);
		ЗначенияЗаполнения.Свойство("Организация", 		Организация);
		ЗначенияЗаполнения.Свойство("Плательщик",     	Плательщик);
		ЗначенияЗаполнения.Свойство("Перевозчик", 		Перевозчик);		
	КонецЕсли;

	Запрос.УстановитьПараметр("АдресДоставки", 		АдресДоставки);
	Запрос.УстановитьПараметр("Грузополучатель", 	Грузополучатель);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Плательщик", 		Плательщик);
	Запрос.УстановитьПараметр("Перевозчик", 		Перевозчик); 

	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаРезультат = МассивРезультатов[1].Выгрузить();
	ВыборкаМассДата = МассивРезультатов[2].Выбрать();	
	РеквизитыТранспортнойНакладной.ВыводДанныхОТоварномСоставе = Перечисления.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав;
	Для Каждого ТекущаяСтрокаТаблицы Из ТаблицаРезультат Цикл

		СравнитьДанныеДляТранспортнойНакладной(РеквизитыТранспортнойНакладной, ТекущаяСтрокаТаблицы);		

	КонецЦикла;

	Пока ВыборкаМассДата.Следующий() Цикл

		ЗаполнитьЗначенияСвойств(РеквизитыТранспортнойНакладной, ВыборкаМассДата);

	КонецЦикла;

КонецПроцедуры

&Вместо("ПоместитьВременнуюТаблицуТоваров")
Процедура ВИЛС_ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументТовары.Ссылка КАК Ссылка,
	|	ДокументТовары.НомерСтроки КАК НомерСтроки,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.Характеристика КАК Характеристика,
	|	ДокументТовары.Количество КАК Количество,
	|	ДокументТовары.Количество КАК КоличествоУпаковок,
	|	ДокументТовары.СуммаБезНДС КАК СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС КАК СтавкаНДС,
	|	ДокументТовары.СуммаНДС КАК СуммаНДС,
	|	ДокументТовары.ЭтоТовар КАК ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара КАК ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ЛОЖЬ,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ВозвратТоваровПоставщикуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ТаблицаТоваровКорректировкаРеализации КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//++ НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ПередачаДавальцуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ЛОЖЬ,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ОтгрузкаТоваровСХраненияТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка КАК Ссылка,
	|	ДокументТовары.НомерСтроки КАК НомерСтроки,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.Характеристика КАК Характеристика,
	|	ДокументТовары.Количество КАК Количество,
	|	ДокументТовары.Количество КАК КоличествоУпаковок,
	|	ДокументТовары.СуммаБезНДС КАК СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС КАК СтавкаНДС,
	|	ДокументТовары.СуммаНДС КАК СуммаНДС,
	|	ДокументТовары.ЭтоТовар КАК ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара КАК ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка КАК Упаковка
	|ИЗ
	|	ПередачаТоваровХранителюТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ПередачаСырьяПереработчикуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	//++ НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	НЕ ДокументТовары.ЭтоВозвратнаяТара,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ВозвратСырьяДавальцуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.Количество,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ПеремещениеТоваровТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	// begin fix Suetin 24.09.2019 12:33:47
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Распоряжение,
	|	ДокументТовары.НомерСтроки,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Количество,
	|	ДокументТовары.КоличествоУпаковок,
	|	ДокументТовары.СуммаБезНДС,
	|	ДокументТовары.СтавкаНДС,
	|	ДокументТовары.СуммаНДС,
	|	ДокументТовары.ЭтоТовар,
	|	ДокументТовары.ЭтоНеВозвратнаяТара,
	|	ДокументТовары.Упаковка
	|ИЗ
	|	ЗаданиеНаПеревозкуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар";
	// end fix Suetin 24.09.2019 12:36:10
	Запрос.Выполнить();	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли