
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ОбработкаЗаполнения")
Процедура ВИЛС_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);		
		Если ДанныеЗаполнения.Свойство("ДокументыОснования") Тогда
			Для Каждого ДокументОснование Из ДанныеЗаполнения.ДокументыОснования Цикл
				НоваяСтрока = ДокументыОснования.Добавить();
				НоваяСтрока.ДокументОснование = ДокументОснование;
				НоваяСтрока.ВИЛС_ДокументОснование = ДокументОснование;            // fix Suetin 26.09.2019 16:46:25
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ТранспортнаяНакладнаяЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&Вместо("ДокументыОснованияИмеютНоменклатуруТипаТовар")
Процедура ВИЛС_ДокументыОснованияИмеютНоменклатуруТипаТовар(Отказ)
	
	МассивВсехРаспоряжений = ДокументыОснования.ВыгрузитьКолонку("ВИЛС_ДокументОснование");      // fix Suetin 26.09.2019 15:44:08    ДокументОснование
	МассивРаспоряженийСТоварами = Документы.ТранспортнаяНакладная.ВИЛС_ПолучитьТолькоДокументыОснованияСТоварами(МассивВсехРаспоряжений, Отказ, ЗаданиеНаПеревозку);  // fix Suetin 23.09.2019 18:07:12    ПолучитьТолькоДокументыОснованияСТоварами
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
