
Процедура ОчиститьКолонтитул(Колонтитул)
	Колонтитул.ТекстСлева = "";
	Колонтитул.ТекстВЦентре = "";
	Колонтитул.ТекстСправа = "";
КонецПроцедуры

//&После("УстановитьКолонтитулы")
//Процедура ВИЛС_УстановитьКолонтитулы(ТабличныйДокумент, НазваниеОтчета, Пользователь, НастройкиКолонтитулов)
//	// begin fix Suetin 18.09.2020 3:18:26 Очистим колонтитулы
//	Если НазваниеОтчета = "Список граждан для сверки с военкоматом" 
//		или НазваниеОтчета = "Извещение о приеме или увольнении" 
//		или НазваниеОтчета = "Расчетный листок" Тогда
//		ОчиститьКолонтитул(ТабличныйДокумент.ВерхнийКолонтитул);
//		ОчиститьКолонтитул(ТабличныйДокумент.НижнийКолонтитул);
//	КонецЕсли;
//	// end fix Suetin 18.09.2020 3:23:56
//КонецПроцедуры

&ИзменениеИКонтроль("УстановитьКолонтитулы")
Процедура ВИЛС_УстановитьКолонтитулы(ТабличныйДокумент, НазваниеОтчета = "", Пользователь = Неопределено, НастройкиКолонтитулов = Неопределено) Экспорт
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если НастройкиКолонтитулов = Неопределено Тогда 
		НастройкиКолонтитулов = НастройкиКолонтитулов();
	КонецЕсли;
#Удаление	
	Если Не КолонтитулУстановлен(ТабличныйДокумент.ВерхнийКолонтитул) Тогда 
		СвойстваКолонтитула = СвойстваКолонтитула(НастройкиКолонтитулов.ВерхнийКолонтитул, НазваниеОтчета, Пользователь);
		ЗаполнитьЗначенияСвойств(ТабличныйДокумент.ВерхнийКолонтитул, СвойстваКолонтитула);
	КонецЕсли;
	
	Если Не КолонтитулУстановлен(ТабличныйДокумент.НижнийКолонтитул) Тогда 
		СвойстваКолонтитула = СвойстваКолонтитула(НастройкиКолонтитулов.НижнийКолонтитул, НазваниеОтчета, Пользователь);
		ЗаполнитьЗначенияСвойств(ТабличныйДокумент.НижнийКолонтитул, СвойстваКолонтитула);
	КонецЕсли;
#КонецУдаления
#Вставка
	// begin fix Suetin 17.11.2020 12:51:23
	Если НастройкиКолонтитулов.ВерхнийКолонтитул.Свойство("ВыводитьКолонтитул")
		и НастройкиКолонтитулов.ВерхнийКолонтитул.ВыводитьКолонтитул Тогда
		Если Не КолонтитулУстановлен(ТабличныйДокумент.ВерхнийКолонтитул) Тогда 
			СвойстваКолонтитула = СвойстваКолонтитула(НастройкиКолонтитулов.ВерхнийКолонтитул, НазваниеОтчета, Пользователь);
			ЗаполнитьЗначенияСвойств(ТабличныйДокумент.ВерхнийКолонтитул, СвойстваКолонтитула);
		КонецЕсли;
	Иначе
		ОчиститьКолонтитул(ТабличныйДокумент.ВерхнийКолонтитул);
	КонецЕсли; 
	Если НастройкиКолонтитулов.НижнийКолонтитул.Свойство("ВыводитьКолонтитул")
		и НастройкиКолонтитулов.НижнийКолонтитул.ВыводитьКолонтитул Тогда
		Если Не КолонтитулУстановлен(ТабличныйДокумент.НижнийКолонтитул) Тогда 
			СвойстваКолонтитула = СвойстваКолонтитула(НастройкиКолонтитулов.НижнийКолонтитул, НазваниеОтчета, Пользователь);
			ЗаполнитьЗначенияСвойств(ТабличныйДокумент.НижнийКолонтитул, СвойстваКолонтитула);
		КонецЕсли;
	Иначе
		ОчиститьКолонтитул(ТабличныйДокумент.НижнийКолонтитул);
	КонецЕсли; 
	// begin fix Suetin 18.09.2020 3:18:26 Очистим колонтитулы
	Если НазваниеОтчета = "Список граждан для сверки с военкоматом" 
		или НазваниеОтчета = "Извещение о приеме или увольнении" 
		или НазваниеОтчета = "Расчетный листок" Тогда
		ОчиститьКолонтитул(ТабличныйДокумент.ВерхнийКолонтитул);
		ОчиститьКолонтитул(ТабличныйДокумент.НижнийКолонтитул);
	КонецЕсли;
	// end fix Suetin 18.09.2020 3:23:56
	// end fix Suetin 17.11.2020 12:51:31
#КонецВставки
КонецПроцедуры


