&Вместо("УстановитьКолонтитулы")
// Устанавливает колонтитулы в табличном документе.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - документ, в котором надо установить колонтитулы.
//  НазваниеОтчета - Строка - значение параметра, которое будет подставлено в шаблон.
//  Пользователь - СправочникСсылка.Пользователи - значение параметра, которое будет подставлено в шаблон.
//  НастройкиКолонтитулов - Структура - индивидуальные настройки колонтитулов.
//
Процедура ВИЛС_УстановитьКолонтитулы(ТабличныйДокумент, НазваниеОтчета = "", Пользователь = Неопределено, НастройкиКолонтитулов = Неопределено) Экспорт
	//begin fix Клещ А.Н. 18.09.2019  
	ОчиститьКолонтитул(ТабличныйДокумент.ВерхнийКолонтитул);
	ОчиститьКолонтитул(ТабличныйДокумент.НижнийКолонтитул);
	//end fix Клещ А.Н. 18.09.2019
	
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если НастройкиКолонтитулов = Неопределено Тогда 
		НастройкиКолонтитулов = НастройкиКолонтитулов();
	КонецЕсли;
	
	Если Не КолонтитулУстановлен(ТабличныйДокумент.ВерхнийКолонтитул) Тогда 
		СвойстваКолонтитула = СвойстваКолонтитула(НастройкиКолонтитулов.ВерхнийКолонтитул, НазваниеОтчета, Пользователь);
		ЗаполнитьЗначенияСвойств(ТабличныйДокумент.ВерхнийКолонтитул, СвойстваКолонтитула);
	КонецЕсли;
	
	Если Не КолонтитулУстановлен(ТабличныйДокумент.НижнийКолонтитул) Тогда 
		СвойстваКолонтитула = СвойстваКолонтитула(НастройкиКолонтитулов.НижнийКолонтитул, НазваниеОтчета, Пользователь);
		ЗаполнитьЗначенияСвойств(ТабличныйДокумент.НижнийКолонтитул, СвойстваКолонтитула);
	КонецЕсли;
КонецПроцедуры


Процедура ОчиститьКолонтитул(Колонтитул)
	
	Колонтитул.ТекстСлева = "";
	Колонтитул.ТекстВЦентре = "";
	Колонтитул.ТекстСправа = "";
	
КонецПроцедуры

