&Вместо("ШагиЗаполненияБезУчетаОстатковТоваров")
Функция ВИЛС_ШагиЗаполненияБезУчетаОстатковТоваров(Товары, ДопустимыеВарианты)

	ВариантОтгрузить            = Перечисления.ВариантыОбеспечения.Отгрузить;
	ВариантРезервировать        = Перечисления.ВариантыОбеспечения.СоСклада;
	ВариантРезервироватьКСроку  = Перечисления.ВариантыОбеспечения.ИзЗаказов;
	ВариантОбеспечить           = Перечисления.ВариантыОбеспечения.Требуется;
	ВариантНеОбеспечивать       = Перечисления.ВариантыОбеспечения.НеТребуется;
	ВариантОбособленно          = Перечисления.ВариантыОбеспечения.Обособленно;
	ВариантОтгрузитьОбособленно = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;

	ОтгрузитьДоступен            = ДопустимыеВарианты.Найти(ВариантОтгрузить)            <> Неопределено;
	РезервироватьДоступен        = ДопустимыеВарианты.Найти(ВариантРезервировать)        <> Неопределено;
	РезервироватьКСрокуДоступен  = ДопустимыеВарианты.Найти(ВариантРезервироватьКСроку)  <> Неопределено;
	ОбеспечитьДоступен           = ДопустимыеВарианты.Найти(ВариантОбеспечить)           <> Неопределено;
	НеОбеспечиватьДоступен       = ДопустимыеВарианты.Найти(ВариантНеОбеспечивать)       <> Неопределено;
	ОбособленноДоступен          = ДопустимыеВарианты.Найти(ВариантОбособленно)          <> Неопределено;
	ОтгрузитьОбособленноДоступен = ДопустимыеВарианты.Найти(ВариантОтгрузитьОбособленно) <> Неопределено;

	ВариантОбеспечения = ?(НеОбеспечиватьДоступен,       ВариантНеОбеспечивать,
	                     ?(РезервироватьКСрокуДоступен,  ВариантРезервироватьКСроку,
	                     ?(РезервироватьДоступен,        ВариантРезервировать,
	                     ?(ОтгрузитьДоступен,            ВариантОтгрузить,
	                     ?(ОтгрузитьОбособленноДоступен, ВариантОтгрузитьОбособленно, Неопределено)))));

	Результат = ТаблицаПотребностейБезАналитики();
	Результат.Колонки.Добавить("ПриоритетТипаОбеспечения");
	Результат.Колонки.Добавить("СкладНаименование");
	Для Каждого Шаг Из Товары Цикл

		Если ВариантОбеспечения <> Неопределено Тогда
			//begin fix Клещ А.Н. 11.10.2019  
			Если ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить и ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Добавление изменение складских актов")  Тогда
				Отбор = новый Структура("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.СоСклада);
				НайденныеСтроки = Шаг.Значение.НайтиСтроки(Отбор);
				ТемпТЗ =  Шаг.Значение.Скопировать(НайденныеСтроки);
				Товары.Вставить(Шаг.Ключ,ТемпТЗ);//Значение.Загрузить(ТемпТЗ);
				ТемпСтруктура = Новый Структура("Значение",ТемпТЗ);
				Шаг = ТемпСтруктура;
			КонецЕсли;
			//end fix Клещ А.Н. 11.10.2019
			Шаг.Значение.ЗаполнитьЗначения(ВариантОбеспечения, "ВариантОбеспечения");
			Шаг.Значение.ЗаполнитьЗначения('00010101', "ДатаОтгрузки");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Шаг.Значение, Результат);
		Шаг.Значение.Очистить();

	КонецЦикла;

	Возврат Результат;

КонецФункции

&Вместо("ШагиСписанияОстатковТоваров")
Функция ВИЛС_ШагиСписанияОстатковТоваров(Товары, ВариантыОбеспечения, ДопустимыеВарианты, ИзменятьОбособление = Истина)

	ВариантОтгрузить           = Перечисления.ВариантыОбеспечения.Отгрузить;
	ВариантРезервировать       = Перечисления.ВариантыОбеспечения.СоСклада;
	ВариантРезервироватьКСроку = Перечисления.ВариантыОбеспечения.ИзЗаказов;

	ВариантОбеспечить           = Перечисления.ВариантыОбеспечения.Требуется;
	ВариантНеОбеспечивать       = Перечисления.ВариантыОбеспечения.НеТребуется;
	ВариантОбособленно           = Перечисления.ВариантыОбеспечения.Обособленно;

	ОтгрузитьДоступен           = ДопустимыеВарианты.Найти(ВариантОтгрузить)           <> Неопределено;
	РезервироватьДоступен       = ДопустимыеВарианты.Найти(ВариантРезервировать)       <> Неопределено;
	РезервироватьКСрокуДоступен = ДопустимыеВарианты.Найти(ВариантРезервироватьКСроку) <> Неопределено;

	ОбособленноДоступен          = ДопустимыеВарианты.Найти(ВариантОбособленно)          <> Неопределено;
	ОбеспечитьДоступен           = ДопустимыеВарианты.Найти(ВариантОбеспечить)           <> Неопределено;
	НеОбеспечиватьДоступен       = ДопустимыеВарианты.Найти(ВариантНеОбеспечивать)       <> Неопределено;

	ПоляСоединения     = "Номенклатура, Характеристика, Склад";

	Результат = ТаблицаПотребностейБезАналитики();
	Результат.Колонки.Добавить("ПриоритетТипаОбеспечения");
	Результат.Колонки.Добавить("СкладНаименование");
	Если ОтгрузитьДоступен Или РезервироватьДоступен Тогда

		ВариантОбеспечения = ?(ОтгрузитьДоступен, ВариантОтгрузить, ВариантРезервировать);
		ТаблицаОстатков    = ВариантыОбеспечения.ВНаличии;

		ШагиСписания = Новый Массив();
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Отгрузить,            ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Резервировать,        ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.РезервироватьКСроку,  ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Обеспечить,           ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.НеОбеспечивать,       ТаблицаОстатков, ПоляСоединения));

		Если ИзменятьОбособление Тогда
			ШагиСписания.Добавить(ВыполнитьСписание(Товары.ОтгрузитьОбособленно, ТаблицаОстатков, ПоляСоединения));
			ШагиСписания.Добавить(ВыполнитьСписание(Товары.Обособленно,          ТаблицаОстатков, ПоляСоединения));
		КонецЕсли;

		Для Каждого Шаг Из ШагиСписания Цикл
			//begin fix Клещ А.Н. 11.10.2019  
			Если ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить и ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Добавление изменение складских актов")  Тогда
				Отбор = новый Структура("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.СоСклада);
				НайденныеСтроки = Шаг.НайтиСтроки(Отбор);
				ТемпТЗ =  Шаг.Скопировать(НайденныеСтроки);
				Шаг = ТемпТЗ;
			КонецЕсли;
			//end fix Клещ А.Н. 11.10.2019
			Шаг.ЗаполнитьЗначения(ВариантОбеспечения, "ВариантОбеспечения");
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Шаг, Результат);

		КонецЦикла;

	КонецЕсли;

	Если РезервироватьКСрокуДоступен Тогда

		ВариантОбеспечения = ВариантРезервироватьКСроку;
		ТаблицаОстатков    = ВариантыОбеспечения.ВНаличии;

		ШагиСписания = Новый Массив();
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Отгрузить,            ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Резервировать,        ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.РезервироватьКСроку,  ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Обеспечить,           ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.НеОбеспечивать,       ТаблицаОстатков, ПоляСоединения));

		Если ИзменятьОбособление Тогда
			ШагиСписания.Добавить(ВыполнитьСписание(Товары.ОтгрузитьОбособленно, ТаблицаОстатков, ПоляСоединения));
			ШагиСписания.Добавить(ВыполнитьСписание(Товары.Обособленно,          ТаблицаОстатков, ПоляСоединения));
		КонецЕсли;

		Для Каждого Шаг Из ШагиСписания Цикл

			Шаг.ЗаполнитьЗначения(ВариантОбеспечения, "ВариантОбеспечения");
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Шаг, Результат);

		КонецЦикла;

		ТаблицаОстатков    = ВариантыОбеспечения.Ожидается;

		ШагиСписания = Новый Массив();
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Отгрузить,            ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Резервировать,        ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.РезервироватьКСроку,  ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.Обеспечить,           ТаблицаОстатков, ПоляСоединения));
		ШагиСписания.Добавить(ВыполнитьСписание(Товары.НеОбеспечивать,       ТаблицаОстатков, ПоляСоединения));

		Если ИзменятьОбособление Тогда
			ШагиСписания.Добавить(ВыполнитьСписание(Товары.ОтгрузитьОбособленно, ТаблицаОстатков, ПоляСоединения));
			ШагиСписания.Добавить(ВыполнитьСписание(Товары.Обособленно,          ТаблицаОстатков, ПоляСоединения));
		КонецЕсли;

		Для Каждого Шаг Из ШагиСписания Цикл

			Шаг.ЗаполнитьЗначения(ВариантОбеспечения, "ВариантОбеспечения");
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Шаг, Результат);

		КонецЦикла;

	КонецЕсли;

	Возврат Результат;

КонецФункции
