
&НаКлиенте
Процедура ВИЛС_ГрузополучательПриИзмененииПосле(Элемент)
	ВИЛС_ГрузополучательПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ГрузоотправительПриИзмененииПосле(Элемент)
	ВИЛС_ГрузоотправительПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВИЛС_ГрузополучательПриИзмененииПослеНаСервере()
	СтруктураАдреса = ВИЛС_ГрузоотправительГрузополучательПриИзмененииНаСервере(Объект.Грузополучатель);
	Объект.АдресДоставки              = СтруктураАдреса.Представление;
	Объект.АдресДоставкиЗначенияПолей = СтруктураАдреса.ЗначенияПолей;
КонецПроцедуры

&НаСервере
Процедура ВИЛС_ГрузоотправительПриИзмененииПослеНаСервере()
	СтруктураАдреса = ВИЛС_ГрузоотправительГрузополучательПриИзмененииНаСервере(Объект.Грузоотправитель);
	Объект.АдресПогрузки              = СтруктураАдреса.Представление;
	Объект.АдресПогрузкиЗначенияПолей = СтруктураАдреса.ЗначенияПолей;
КонецПроцедуры

&НаСервереБезКонтекста
//&После("ГрузоотправительПриИзмененииНаСервере")
Функция ВИЛС_ГрузоотправительГрузополучательПриИзмененииНаСервере(ОбъектКонтактнойИнформации)
	СтруктураАдреса = Новый Структура("Представление, ЗначенияПолей", "", "");
	Если ТипЗнч(ОбъектКонтактнойИнформации) = Тип("СправочникСсылка.Контрагенты") Тогда
		КонтрагентаОрганизации 	= "Контрагента";	
		СправочникКО 			= "Контрагенты";
	Иначе
		КонтрагентаОрганизации 	= "Организации";	
		СправочникКО 			= "Организации";
	КонецЕсли;	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КОКонтактнаяИнформация.Представление КАК Представление,
	|	КОКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	Справочник." + СправочникКО + ".КонтактнаяИнформация КАК КОКонтактнаяИнформация
	|ГДЕ
	|	КОКонтактнаяИнформация.Ссылка = &Ссылка
	|	И КОКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдрес" + КонтрагентаОрганизации + ")");
	Запрос.УстановитьПараметр("Ссылка", ОбъектКонтактнойИнформации);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураАдреса, Выборка);
		КонецЕсли;	
	КонецЕсли;	
	Возврат(СтруктураАдреса);
КонецФункции

