
&Перед("ПроверитьЗаполнениеОбъекта")
Процедура ВИЛС_ПроверитьЗаполнениеОбъекта(Объект, МенеджерВременныхТаблиц, Отказ, ПроверяемыеРеквизиты)
	Инд = ПроверяемыеРеквизиты.Найти("ВыходныеИзделия.Назначение");
	Если Не Инд = Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Инд);
		
	
	КонецЕсли; 
КонецПроцедуры
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//&Вместо("ТекстЗапросаВтВидыЗапасов")
//Функция ВИЛС_ТекстЗапросаВтВидыЗапасов(Запрос, ТекстыЗапроса, ИмяРегистра)
//	
//	ИмяТаблицы = "ВтВидыЗапасов";
//	
//	ИнициализироватьКлючиАналитикиНоменклатуры(Запрос);
//	
//	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаАналитикУчетаПартий", ТекстыЗапроса) Тогда
//		ТекстЗапросаВтТаблицаАналитикУчетаПартий(Запрос, ТекстыЗапроса);
//	КонецЕсли;
//	
//	ТекстЗапроса = "
//	// ВидыЗапасовОбеспечение (товары)
//	|ВЫБРАТЬ
//	|	ВидыЗапасов.НомерСтроки                     КАК НомерСтроки,
//	|	ЛОЖЬ                                        КАК ДополнениеДляДавальца,
//	|	СпрВидыЗапасов.ВидЗапасовВладельца          КАК ВидЗапасовВладельца,
//	|	СпрВидыЗапасов.РеализацияЗапасовДругойОрганизации КАК РеализацияЗапасовДругойОрганизации,
//	|	ВидыЗапасов.ВидЗапасов                      КАК ВидЗапасов,
//	|	ВидыЗапасов.НомерГТД                        КАК НомерГТД,
//	|	ВидыЗапасов.АналитикаУчетаНоменклатуры      КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики        КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	Аналитика.Номенклатура                      КАК Номенклатура,
//	|	Аналитика.Характеристика                    КАК Характеристика,
//	|	Аналитика.МестоХранения						КАК Склад,
//	|	Аналитика.Назначение                        КАК Назначение,
//	|	ВидыЗапасов.Количество                      КАК Количество,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство) КАК ХозяйственнаяОперация,
//	|	ЛОЖЬ                                        КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                      КАК НалогообложениеНДС,
//	|	КлючиПроизводства.КлючАналитики             КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	КлючиПроизводстваБезНазначения.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	ВидыЗапасов.ДатаОтгрузки                    КАК ДатаОтгрузки,
//	|	ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПоступления,
//	|	НЕОПРЕДЕЛЕНО                                КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                КАК СтатьяКалькуляции,
//	|	НЕОПРЕДЕЛЕНО                                КАК Подразделение,
//	|	НЕОПРЕДЕЛЕНО                                КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО                                КАК АналитикаРасходов,
//	|	НЕОПРЕДЕЛЕНО                                КАК АналитикаАктивовПассивов,
//	|	НЕОПРЕДЕЛЕНО                                КАК АналитикаУчетаПартий,
//	|	ВЫБОР
//	// давальческие материалы и полуфабрикаты всегда на отдельном разделе учета
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	// комиссионные товары всегда на отдельном разделе учета
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
//	// принятые на хранении с правом продажи на отдельном разделе учета
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
//	// для собственных раздел учетом учета являются производственные затраты
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|	КОНЕЦ                                         КАК РазделУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорРазделУчета,
//	|	0                                             КАК Сумма,
//	|	0                                             КАК СуммаЗабалансовая,
//	|	""""                                          КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА НЕ &ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА &ГруппаПродукции
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорАналитикаФинансовогоУчета
//	|ПОМЕСТИТЬ ВтВидыЗапасов
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ВидыЗапасовОбеспечение КАК ВидыЗапасов
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Справочник.ВидыЗапасов КАК СпрВидыЗапасов
//	|	ПО
//	|		ВидыЗапасов.ВидЗапасов = СпрВидыЗапасов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
//	|	ПО
//	|		ВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаБезНазначения.Назначение
//	|		И Аналитика.Серия = АналитикаБезНазначения.Серия
//	|		И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаБезНазначения.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиПроизводства
//	|	ПО
//	|		Аналитика.Номенклатура = КлючиПроизводства.Номенклатура
//	|		И Аналитика.Характеристика = КлючиПроизводства.Характеристика
//	|		И &Назначение = КлючиПроизводства.Назначение
//	|		И ВидыЗапасов.Серия = КлючиПроизводства.Серия
//	|		И &Подразделение = КлючиПроизводства.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = КлючиПроизводства.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиПроизводстваБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = КлючиПроизводстваБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = КлючиПроизводстваБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = КлючиПроизводстваБезНазначения.Назначение
//	|		И ВидыЗапасов.Серия = КлючиПроизводстваБезНазначения.Серия
//	|		И &Подразделение = КлючиПроизводстваБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = КлючиПроизводстваБезНазначения.СтатьяКалькуляции
//	|
//	|ГДЕ
//	|	ВидыЗапасов.Ссылка = &Ссылка
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// ВидыЗапасовОбеспечение (работы, строится по ТЧ ОбеспечениеМатериаламиИРаботами)
//	|ВЫБРАТЬ
//	|	ВидыЗапасов.НомерСтроки                       КАК НомерСтроки,
//	|	ЛОЖЬ                                          КАК ДополнениеДляДавальца,
//	|	НЕОПРЕДЕЛЕНО                                  КАК ВидЗапасовВладельца,
//	|	ЛОЖЬ                                          КАК РеализацияЗапасовДругойОрганизации,
//	|	НЕОПРЕДЕЛЕНО                                  КАК ВидЗапасов,
//	|	НЕОПРЕДЕЛЕНО                                  КАК НомерГТД,
//	|	ВидыЗапасов.АналитикаУчетаНоменклатуры        КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики          КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	Аналитика.Номенклатура                        КАК Номенклатура,
//	|	Аналитика.Характеристика                      КАК Характеристика,
//	|	Аналитика.МестоХранения						  КАК Склад,
//	|	Аналитика.Назначение                          КАК Назначение,
//	|	ВидыЗапасов.Количество                        КАК Количество,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство) КАК ХозяйственнаяОперация,
//	|	ЛОЖЬ                                          КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                        КАК НалогообложениеНДС,
//	|	КлючиПроизводства.КлючАналитики               КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	КлючиПроизводстваБезНазначения.КлючАналитики  КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	ВидыЗапасов.ДатаОтгрузки                      КАК ДатаОтгрузки,
//	|	ДАТАВРЕМЯ(1,1,1)                              КАК ДатаПоступления,
//	|	НЕОПРЕДЕЛЕНО                                  КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                  КАК СтатьяКалькуляции,
//	|	НЕОПРЕДЕЛЕНО                                  КАК Подразделение,
//	|	НЕОПРЕДЕЛЕНО                                  КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО                                  КАК АналитикаРасходов,
//	|	НЕОПРЕДЕЛЕНО                                  КАК АналитикаАктивовПассивов,
//	|	НЕОПРЕДЕЛЕНО                                  КАК АналитикаУчетаПартий,
//	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорРазделУчета,
//	|	0                                             КАК Сумма,
//	|	0                                             КАК СуммаЗабалансовая,
//	|	""""                                          КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА НЕ &ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА &ГруппаПродукции
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ВидыЗапасов
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
//	|	ПО
//	|		ВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаБезНазначения.Назначение
//	|		И Аналитика.Серия = АналитикаБезНазначения.Серия
//	|		И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаБезНазначения.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиПроизводства
//	|	ПО
//	|		Аналитика.Номенклатура = КлючиПроизводства.Номенклатура
//	|		И Аналитика.Характеристика = КлючиПроизводства.Характеристика
//	|		И &Назначение = КлючиПроизводства.Назначение
//	|		И Аналитика.Серия = КлючиПроизводства.Серия
//	|		И &Подразделение = КлючиПроизводства.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = КлючиПроизводства.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиПроизводстваБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = КлючиПроизводстваБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = КлючиПроизводстваБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = КлючиПроизводстваБезНазначения.Назначение
//	|		И Аналитика.Серия = КлючиПроизводстваБезНазначения.Серия
//	|		И &Подразделение = КлючиПроизводстваБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = КлючиПроизводстваБезНазначения.СтатьяКалькуляции
//	|
//	|ГДЕ
//	|	ВидыЗапасов.Ссылка = &Ссылка
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|	И ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
//	|	И ВидыЗапасов.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить),
//	|										ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// ВидыЗапасовЭкономия
//	|ВЫБРАТЬ
//	|	ВидыЗапасов.НомерСтроки                       КАК НомерСтроки,
//	|	ЛОЖЬ                                          КАК ДополнениеДляДавальца,
//	|	СпрВидыЗапасов.ВидЗапасовВладельца            КАК ВидЗапасовВладельца,
//	|	СпрВидыЗапасов.РеализацияЗапасовДругойОрганизации КАК РеализацияЗапасовДругойОрганизации,
//	|	ВидыЗапасов.ВидЗапасов                        КАК ВидЗапасов,
//	|	ВидыЗапасов.НомерГТД                          КАК НомерГТД,
//	|	ВидыЗапасов.АналитикаУчетаНоменклатуры        КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики          КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	Аналитика.Номенклатура                        КАК Номенклатура,
//	|	Аналитика.Характеристика                      КАК Характеристика,
//	|	Аналитика.МестоХранения						  КАК Склад,
//	|	Аналитика.Назначение                          КАК Назначение,
//	|	ВидыЗапасов.Количество                        КАК Количество,
//	|	ВЫБОР
//	|		КОГДА ВидыЗапасов.СписатьНаРасходы
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства)
//	|	КОНЕЦ                                         КАК ХозяйственнаяОперация,
//	|	ВидыЗапасов.СписатьНаРасходы                  КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                        КАК НалогообложениеНДС,
//	|	КлючиНаСкладе.КлючАналитики                   КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	КлючиНаСкладеБезНазначения.КлючАналитики      КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	НЕОПРЕДЕЛЕНО                                  КАК ДатаОтгрузки,
//	|	ВидыЗапасов.ДатаОперации                      КАК ДатаПоступления,
//	|	НЕОПРЕДЕЛЕНО                                  КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                  КАК СтатьяКалькуляции,
//	|	ВЫБОР
//	|		КОГДА ВидыЗапасов.СписатьНаРасходы
//	|			И ВидыЗапасов.Получатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
//	|			ТОГДА &Подразделение
//	|		КОГДА ВидыЗапасов.СписатьНаРасходы
//	|			И НЕ ВидыЗапасов.Получатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
//	|			ТОГДА ВидыЗапасов.Получатель
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК Подразделение,
//	|	ВидыЗапасов.СтатьяРасходов                    КАК СтатьяРасходов,
//	|	ВидыЗапасов.АналитикаРасходов                 КАК АналитикаРасходов,
//	|	ВидыЗапасов.АналитикаАктивовПассивов          КАК АналитикаАктивовПассивов,
//	|	НЕОПРЕДЕЛЕНО                                  КАК АналитикаУчетаПартий,
//	// давальческие материалы и полуфабрикаты всегда на отдельном разделе учета
//	|	ВЫБОР
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	// комиссионные товары всегда на отдельном разделе учета
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
//	// принятые на хранении с правом продажи на отдельном разделе учета
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
//	// для собственных раздел учетом учета являются производственные затраты
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|	КОНЕЦ                                         КАК РазделУчета,
//	|	ВЫБОР
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	|		КОГДА ВидыЗапасов.СписатьНаРасходы ТОГДА
//	|			НЕОПРЕДЕЛЕНО
//	// принятые на хранении с правом продажи на отдельном разделе учета
//	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|	КОНЕЦ                                         КАК КорРазделУчета,
//	|	0                                             КАК Сумма,
//	|	0                                             КАК СуммаЗабалансовая,
//	|	ВидыЗапасов.ИдентификаторСтроки               КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА НЕ &ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА &ГруппаПродукции
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ВидыЗапасовЭкономия КАК ВидыЗапасов
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Справочник.ВидыЗапасов КАК СпрВидыЗапасов
//	|	ПО
//	|		ВидыЗапасов.ВидЗапасов = СпрВидыЗапасов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
//	|	ПО
//	|		ВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаБезНазначения.Назначение
//	|		И Аналитика.Серия = АналитикаБезНазначения.Серия
//	|		И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаБезНазначения.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиНаСкладе
//	|	ПО
//	|		Аналитика.Номенклатура = КлючиНаСкладе.Номенклатура
//	|		И Аналитика.Характеристика = КлючиНаСкладе.Характеристика
//	|		И ВидыЗапасов.НазначениеПолучателя = КлючиНаСкладе.Назначение
//	|		И ВидыЗапасов.Серия = КлючиНаСкладе.Серия
//	|		И ВидыЗапасов.Получатель = КлючиНаСкладе.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = КлючиНаСкладе.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиНаСкладеБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = КлючиНаСкладеБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = КлючиНаСкладеБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = КлючиНаСкладеБезНазначения.Назначение
//	|		И ВидыЗапасов.Серия = КлючиНаСкладеБезНазначения.Серия
//	|		И ВидыЗапасов.Получатель = КлючиНаСкладеБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = КлючиНаСкладеБезНазначения.СтатьяКалькуляции
//	|	
//	|ГДЕ
//	|	ВидыЗапасов.Ссылка = &Ссылка
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// ВыходныеИзделия
//	// выпуск продукции на получателя.
//	|ВЫБРАТЬ
//	|	ТабличнаяЧасть.НомерСтроки                     КАК НомерСтроки,
//	|	ЛОЖЬ                                           КАК ДополнениеДляДавальца,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ВидЗапасовВладельца,
//	|	ЛОЖЬ                                           КАК РеализацияЗапасовДругойОрганизации,
//	|	ТабличнаяЧасть.ВидЗапасов                      КАК ВидЗапасов,
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)    КАК НомерГТД,
//	|	ТабличнаяЧасть.АналитикаУчетаНоменклатуры      КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики           КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	ТабличнаяЧасть.Номенклатура                    КАК Номенклатура,
//	|	ТабличнаяЧасть.Характеристика                  КАК Характеристика,
//	|	ТабличнаяЧасть.Получатель                      КАК Склад,
//	|	ТабличнаяЧасть.Назначение                      КАК Назначение,
//	|	ТабличнаяЧасть.Количество                      КАК Количество,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
//	|	ТабличнаяЧасть.СписатьНаРасходы                КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                         КАК НалогообложениеНДС,
//	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ДатаОтгрузки,
//	|	ТабличнаяЧасть.ДатаПроизводства                КАК ДатаПоступления,
//	|	ТабличнаяЧасть.Получатель                      КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяКалькуляции,
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы
//	|			И ТабличнаяЧасть.Получатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
//	|			ТОГДА &Подразделение
//	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы
//	|			И НЕ ТабличнаяЧасть.Получатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
//	|			ТОГДА ТабличнаяЧасть.Получатель
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                          КАК Подразделение,
//	|	ТабличнаяЧасть.СтатьяРасходов                  КАК СтатьяРасходов,
//	|	ТабличнаяЧасть.АналитикаРасходов               КАК АналитикаРасходов,
//	|	ТабличнаяЧасть.АналитикаАктивовПассивов        КАК АналитикаАктивовПассивов,
//	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	// Давальческие материалы и полуфабрикаты всегда на отдельном разделе учета
//	// передаем из цеха.
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|	КОНЕЦ                                         КАК РазделУчета,
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы ТОГДА
//	|			НЕОПРЕДЕЛЕНО
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	|		КОГДА ТабличнаяЧасть.Получатель ССЫЛКА Справочник.СтруктураПредприятия ИЛИ ТабличнаяЧасть.Получатель.ЦеховаяКладовая ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
//	|	КОНЕЦ                                         КАК КорРазделУчета,
//	|	0                                             КАК Сумма,
//	|	0                                             КАК СуммаЗабалансовая,
//	|	ТабличнаяЧасть.ИдентификаторСтроки            КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА &АналитическийУчетПоГруппамПродукции
//	|			И НЕ ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ТабличнаяЧасть
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
//	|	ПО ТабличнаяЧасть.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО
//	|		Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаБезНазначения.Назначение
//	|		И Аналитика.Серия = АналитикаБезНазначения.Серия
//	|		И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И Аналитика.СтатьяКалькуляции = АналитикаБезНазначения.СтатьяКалькуляции
//	|	
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
//	|	ПО
//	|		ТаблицаАналитикУчетаПартий.НомерСтроки 		= ТабличнаяЧасть.НомерСтроки
//	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""ВыходныеИзделия""
//	|
//	|ГДЕ
//	|	ТабличнаяЧасть.Ссылка = &Ссылка
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|	И ТабличнаяЧасть.Произведено
//	|	И НЕ ТабличнаяЧасть.Отменено
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// ВыходныеИзделия
//	// выпуск работ по продукции давальца.
//	|ВЫБРАТЬ
//	|	ТабличнаяЧасть.НомерСтроки                     КАК НомерСтроки,
//	|	ИСТИНА                                         КАК ДополнениеДляДавальца,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ВидЗапасовВладельца,
//	|	ЛОЖЬ                                           КАК РеализацияЗапасовДругойОрганизации,
//	|	ТабличнаяЧасть.ВидЗапасов                      КАК ВидЗапасов,
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)    КАК НомерГТД,
//	|	Аналитика.КлючАналитики                        КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики           КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	ТабличнаяЧасть.Номенклатура                    КАК Номенклатура,
//	|	ТабличнаяЧасть.Характеристика                  КАК Характеристика,
//	|	ТабличнаяЧасть.Получатель                      КАК Склад,
//	|	ТабличнаяЧасть.Назначение                      КАК Назначение,
//	|	ТабличнаяЧасть.Количество                      КАК Количество,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
//	|	ТабличнаяЧасть.СписатьНаРасходы                КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                         КАК НалогообложениеНДС,
//	|	ТабличнаяЧасть.АналитикаУчетаНоменклатуры      КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	АналитикаПоПолучателюБезНазначения.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ДатаОтгрузки,
//	|	ТабличнаяЧасть.ДатаПроизводства                КАК ДатаПоступления,
//	|	ТабличнаяЧасть.Получатель                      КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяКалькуляции,
//	|	НЕОПРЕДЕЛЕНО                                   КАК Подразделение,
//	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаРасходов,
//	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаАктивовПассивов,
//	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	// Давальческие материалы и полуфабрикаты всегда на отдельном разделе учета
//	// передаем из цеха.
//	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорРазделУчета,
//	|	0                                             КАК Сумма,
//	|	0                                             КАК СуммаЗабалансовая,
//	|	ТабличнаяЧасть.ИдентификаторСтроки            КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА &АналитическийУчетПоГруппамПродукции
//	|			И НЕ ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО                                  КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ТабличнаяЧасть
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПоПолучателю
//	|	ПО ТабличнаяЧасть.АналитикаУчетаНоменклатуры = АналитикаПоПолучателю.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПолучателюБезНазначения
//	|	ПО
//	|		АналитикаПоПолучателю.Номенклатура = АналитикаПоПолучателюБезНазначения.Номенклатура
//	|		И АналитикаПоПолучателю.Характеристика = АналитикаПоПолучателюБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаПоПолучателюБезНазначения.Назначение
//	|		И АналитикаПоПолучателю.Серия = АналитикаПоПолучателюБезНазначения.Серия
//	|		И АналитикаПоПолучателю.МестоХранения = АналитикаПоПолучателюБезНазначения.МестоХранения
//	|		И АналитикаПоПолучателю.СтатьяКалькуляции = АналитикаПоПолучателюБезНазначения.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
//	|	ПО
//	|		ТабличнаяЧасть.Номенклатура = Аналитика.Номенклатура
//	|		И ТабличнаяЧасть.Характеристика = Аналитика.Характеристика
//	|		И ТабличнаяЧасть.Назначение = Аналитика.Назначение
//	|		И &ПустаяСсылкаСерия = Аналитика.Серия
//	|		И ТабличнаяЧасть.Назначение.Заказ.Подразделение = Аналитика.МестоХранения
//	|		И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО
//	|		ТабличнаяЧасть.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И ТабличнаяЧасть.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И АналитикаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//	|		И &ПустаяСсылкаСерия = АналитикаБезНазначения.Серия
//	|		И ТабличнаяЧасть.Назначение.Заказ.Подразделение = АналитикаБезНазначения.МестоХранения
//	|		И АналитикаБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
//	|	
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
//	|	ПО
//	|		ТаблицаАналитикУчетаПартий.НомерСтроки 		= ТабличнаяЧасть.НомерСтроки
//	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""ВыходныеИзделия""
//	|	
//	|ГДЕ
//	|	ТабличнаяЧасть.Ссылка = &Ссылка
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|	И ТабличнаяЧасть.Произведено
//	|	И ТабличнаяЧасть.ПередатьДавальцу
//	|	И НЕ ТабличнаяЧасть.Отменено
//	//begin fix Клещ А.Н. 11.06.2019  
//	|   	И ТабличнаяЧасть.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Работа)
//	//end fix Клещ А.Н. 11.06.2019
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// ПобочныеИзделия
//	// выпуск продукции на получателя.
//	|ВЫБРАТЬ
//	|	ТабличнаяЧасть.НомерСтроки                     КАК НомерСтроки,
//	|	ЛОЖЬ                                           КАК ДополнениеДляДавальца,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ВидЗапасовВладельца,
//	|	ЛОЖЬ                                           КАК РеализацияЗапасовДругойОрганизации,
//	|	ТабличнаяЧасть.ВидЗапасов                      КАК ВидЗапасов,
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)    КАК НомерГТД,
//	|	ТабличнаяЧасть.АналитикаУчетаНоменклатуры      КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики           КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	ТабличнаяЧасть.Номенклатура                    КАК Номенклатура,
//	|	ТабличнаяЧасть.Характеристика                  КАК Характеристика,
//	|	ТабличнаяЧасть.Получатель                      КАК Склад,
//	|	ТабличнаяЧасть.Назначение                      КАК Назначение,
//	|	ТабличнаяЧасть.Количество                      КАК Количество,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость) КАК ХозяйственнаяОперация,
//	|	ТабличнаяЧасть.СписатьНаРасходы                КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                         КАК НалогообложениеНДС,
//	// Аналитика получателя соответствует аналитике поступления в котел, со статьей калькуляции.
//	|	АналитикаПолучателя.КлючАналитики              КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	АналитикаПолучателяБезНазначения.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ДатаОтгрузки,
//	|	ТабличнаяЧасть.ДатаПроизводства                КАК ДатаПоступления,
//	|	ТабличнаяЧасть.Получатель                      КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяКалькуляции,
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы
//	|			И ТабличнаяЧасть.Получатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
//	|			ТОГДА &Подразделение
//	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы
//	|			И НЕ ТабличнаяЧасть.Получатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
//	|			ТОГДА ТабличнаяЧасть.Получатель
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                          КАК Подразделение,
//	|	ТабличнаяЧасть.СтатьяРасходов                  КАК СтатьяРасходов,
//	|	ТабличнаяЧасть.АналитикаРасходов               КАК АналитикаРасходов,
//	|	ТабличнаяЧасть.АналитикаАктивовПассивов        КАК АналитикаАктивовПассивов,
//	|	ВЫБОР
//	|		КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
//	|			ТОГДА &АналитикаУчетаПартийТоваров
//	|		ИНАЧЕ &АналитикаУчетаПартийРабот
//	|	КОНЕЦ                                          КАК АналитикаУчетаПартий,
//	// Давальческие материалы и полуфабрикаты всегда на отдельном разделе учета
//	// передаем из цеха.
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|	КОНЕЦ                                          КАК РазделУчета,
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы ТОГДА
//	|			НЕОПРЕДЕЛЕНО
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца) ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
//	|		КОГДА ТабличнаяЧасть.Получатель ССЫЛКА Справочник.СтруктураПредприятия ИЛИ ТабличнаяЧасть.Получатель.ЦеховаяКладовая ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
//	|	КОНЕЦ                                         КАК КорРазделУчета,
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|		0
//	|	ИНАЧЕ
//	|		ТабличнаяЧасть.Сумма
//	|	КОНЕЦ                                          КАК Сумма,
//	|	ВЫБОР
//	|		КОГДА ТабличнаяЧасть.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца) ТОГДА
//	|		ТабличнаяЧасть.Сумма
//	|	ИНАЧЕ
//	|		0
//	|	КОНЕЦ                                          КАК СуммаЗабалансовая,
//	|	ТабличнаяЧасть.ИдентификаторСтроки             КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА &АналитическийУчетПоГруппамПродукции
//	|			И НЕ ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                          КАК АналитикаФинансовогоУчета,
//	|	ВЫБОР
//	|		КОГДА НЕ &ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА &ГруппаПродукции
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                         КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК ТабличнаяЧасть
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|	ПО СпрНоменклатура.Ссылка = ТабличнаяЧасть.Номенклатура
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
//	|	ПО ТабличнаяЧасть.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаБезНазначения.Назначение
//	|		И Аналитика.Серия = АналитикаБезНазначения.Серия
//	|		И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И Аналитика.СтатьяКалькуляции = АналитикаБезНазначения.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателя
//	|	ПО ТабличнаяЧасть.Номенклатура = АналитикаПолучателя.Номенклатура
//	|		И ТабличнаяЧасть.Характеристика = АналитикаПолучателя.Характеристика
//	|		И &Назначение = АналитикаПолучателя.Назначение
//	|		И ВЫБОР КОГДА ТабличнаяЧасть.СтатусУказанияСерийОтправитель = 14 ТОГДА ТабличнаяЧасть.Серия ИНАЧЕ &ПустаяСсылкаСерия КОНЕЦ = АналитикаПолучателя.Серия
//	|		И &Подразделение = АналитикаПолучателя.МестоХранения
//	|		И ТабличнаяЧасть.СтатьяКалькуляции = АналитикаПолучателя.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателяБезНазначения
//	|	ПО ТабличнаяЧасть.Номенклатура = АналитикаПолучателяБезНазначения.Номенклатура
//	|		И ТабличнаяЧасть.Характеристика = АналитикаПолучателяБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаПолучателяБезНазначения.Назначение
//	|		И ВЫБОР КОГДА ТабличнаяЧасть.СтатусУказанияСерийОтправитель = 14 ТОГДА ТабличнаяЧасть.Серия ИНАЧЕ &ПустаяСсылкаСерия КОНЕЦ = АналитикаПолучателяБезНазначения.Серия
//	|		И &Подразделение = АналитикаПолучателяБезНазначения.МестоХранения
//	|		И ТабличнаяЧасть.СтатьяКалькуляции = АналитикаПолучателяБезНазначения.СтатьяКалькуляции
//	|	
//	|ГДЕ
//	|	ТабличнаяЧасть.Ссылка = &Ссылка
//	|	И ТабличнаяЧасть.Произведено
//	|	И НЕ ТабличнаяЧасть.Отменено
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// ПобочныеИзделия
//	// выпуск работ по продукции давальца.
//	|ВЫБРАТЬ
//	|	ТабличнаяЧасть.НомерСтроки                     КАК НомерСтроки,
//	|	ИСТИНА                                         КАК ДополнениеДляДавальца,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ВидЗапасовВладельца,
//	|	ЛОЖЬ                                           КАК РеализацияЗапасовДругойОрганизации,
//	|	ТабличнаяЧасть.ВидЗапасов                      КАК ВидЗапасов,
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)    КАК НомерГТД,
//	|	Аналитика.КлючАналитики                        КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики           КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	ТабличнаяЧасть.Номенклатура                    КАК Номенклатура,
//	|	ТабличнаяЧасть.Характеристика                  КАК Характеристика,
//	|	ТабличнаяЧасть.Получатель                      КАК Склад,
//	|	ТабличнаяЧасть.Назначение                      КАК Назначение,
//	|	ТабличнаяЧасть.Количество                      КАК Количество,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость) КАК ХозяйственнаяОперация,
//	|	ТабличнаяЧасть.СписатьНаРасходы                КАК СписатьНаРасходы,
//	|	&ВыпускПодДеятельность                         КАК НалогообложениеНДС,
//	// Аналитика получателя соответствует аналитике поступления в котел, со статьей калькуляции.
//	|	ТабличнаяЧасть.АналитикаУчетаНоменклатуры      КАК АналитикаУчетаНоменклатурыПолучателя,
//	|	АналитикаПоПолучателюБезНазначения.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучателяБезНазначения,
//	|	НЕОПРЕДЕЛЕНО                                   КАК ДатаОтгрузки,
//	|	ТабличнаяЧасть.ДатаПроизводства                КАК ДатаПоступления,
//	|	ТабличнаяЧасть.Получатель                      КАК Получатель,
//	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяКалькуляции,
//	|	НЕОПРЕДЕЛЕНО                                   КАК Подразделение,
//	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаРасходов,
//	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаАктивовПассивов,
//	|	ВЫБОР
//	|		КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
//	|			ТОГДА &АналитикаУчетаПартийТоваров
//	|		ИНАЧЕ &АналитикаУчетаПартийРабот
//	|	КОНЕЦ                                          КАК АналитикаУчетаПартий,
//	// Давальческие материалы и полуфабрикаты всегда на отдельном разделе учета
//	// передаем из цеха.
//	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
//	|	НЕОПРЕДЕЛЕНО                                   КАК КорРазделУчета,
//	|	0                                              КАК Сумма,
//	|	0                                              КАК СуммаЗабалансовая,
//	|	ТабличнаяЧасть.ИдентификаторСтроки             КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА &АналитическийУчетПоГруппамПродукции
//	|			И НЕ ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ТабличнаяЧасть.Номенклатура.ГруппаАналитическогоУчета
//	|		ИНАЧЕ
//	|			НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ                                          КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО                                   КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК ТабличнаяЧасть
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|	ПО СпрНоменклатура.Ссылка = ТабличнаяЧасть.Номенклатура
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПоПолучателю
//	|	ПО ТабличнаяЧасть.АналитикаУчетаНоменклатуры = АналитикаПоПолучателю.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПолучателюБезНазначения
//	|	ПО
//	|		АналитикаПоПолучателю.Номенклатура = АналитикаПоПолучателюБезНазначения.Номенклатура
//	|		И АналитикаПоПолучателю.Характеристика = АналитикаПоПолучателюБезНазначения.Характеристика
//	|		И &ПустаяСсылкаНазначение = АналитикаПоПолучателюБезНазначения.Назначение
//	|		И АналитикаПоПолучателю.Серия = АналитикаПоПолучателюБезНазначения.Серия
//	|		И АналитикаПоПолучателю.МестоХранения = АналитикаПоПолучателюБезНазначения.МестоХранения
//	|		И АналитикаПоПолучателю.СтатьяКалькуляции = АналитикаПоПолучателюБезНазначения.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
//	|	ПО
//	|		ТабличнаяЧасть.Номенклатура = Аналитика.Номенклатура
//	|		И ТабличнаяЧасть.Характеристика = Аналитика.Характеристика
//	|		И ТабличнаяЧасть.Назначение = Аналитика.Назначение
//	|		И &ПустаяСсылкаСерия = Аналитика.Серия
//	|		И ТабличнаяЧасть.Назначение.Заказ.Подразделение = Аналитика.МестоХранения
//	|		И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО
//	|		ТабличнаяЧасть.Номенклатура = АналитикаБезНазначения.Номенклатура
//	|		И ТабличнаяЧасть.Характеристика = АналитикаБезНазначения.Характеристика
//	|		И АналитикаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//	|		И &ПустаяСсылкаСерия = АналитикаБезНазначения.Серия
//	|		И ТабличнаяЧасть.Назначение.Заказ.Подразделение = АналитикаБезНазначения.МестоХранения
//	|		И АналитикаБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
//	|	
//	|ГДЕ
//	|	ТабличнаяЧасть.Ссылка = &Ссылка
//	|	И ТабличнаяЧасть.Произведено
//	|	И ТабличнаяЧасть.ПередатьДавальцу
//	|	И НЕ ТабличнаяЧасть.Отменено
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	//begin fix Клещ А.Н. 11.06.2019  
//	|   	И ТабличнаяЧасть.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Работа)
//	//end fix Клещ А.Н. 11.06.2019
//	|";
//	
//	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы);
//	
//	Возврат ТекстЗапроса;
//	
//КонецФункции
//	
//#КонецЕсли
