
&Вместо("ОбработкаУдаленияПроведения")
Процедура ВИЛС_ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//СформироватьСписокРегистровДляКонтроля();
	//
	//ПараметрыЗаполнения = ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов();
	//ПараметрыЗаполнения.ПериодЗаполнения = ДополнительныеСвойства.ПериодФормированияРезервовПоТоварамОрганизаций;
	//ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.ОтменаПроведения, ПараметрыЗаполнения);
	//
	//ЭтапПроизводства2_2Локализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);
	//// Временно не проверять
	//// ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	//
	//ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	//
	//ОбновитьСвязанныеДанные(Отказ, Истина);
	//
	//РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	//
	//Если ЗначениеЗаполнено(ДополнительныеСвойства.ПериодЗаполненияВидовЗапасовИСебестоимости) И Не Отказ Тогда
	//	ЗатратыСервер.ДобавитьВОчередьРасходТоваровОрганизацийНаПроизводство(
	//		Организация,
	//		Подразделение,
	//		Ссылка,
	//		ДополнительныеСвойства.ПериодЗаполненияВидовЗапасовИСебестоимости);
	//КонецЕсли;
	//
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПараметрыЗаполнения = ПараметрыЗаполненияВидовЗапасов("Проведение");
	
	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.ОтменаПроведения, ПараметрыЗаполнения);
	
	ЭтапПроизводства2_2Локализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);
	// Временно не проверять                                                           // begin fix Suetin 10.02.2020 10:25:37
	//ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);    // end fix Suetin 10.02.2020 10:25:42
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ОбновитьСвязанныеДанные(Отказ, Истина);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ВИЛС_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("РеквизитыШапки") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.РеквизитыШапки);
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("СпособЗаполнения")
			И ДанныеЗаполнения.СпособЗаполнения = "ЗаполнитьПоСпецификации" Тогда

			ЗаполнитьПоСпецификации(ДанныеЗаполнения);

		ИначеЕсли ДанныеЗаполнения.Свойство("СпособЗаполнения")
			И ДанныеЗаполнения.СпособЗаполнения = "РедактированиеЭтаповПроизводства" Тогда

			ЗаполнитьПоДаннымОбработкиРедактирования(ДанныеЗаполнения);

		КонецЕсли;

	КонецЕсли;

	ЗаполнитьНомерПоРаспоряжению();

#Удаление
	Дата           = ТекущаяДатаСеанса();
#КонецУдаления
#Вставка
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата= ТекущаяДатаСеанса();
	КонецЕсли;
#КонецВставки
	Ответственный  = Пользователи.ТекущийПользователь();
	
	ВидЦены = Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ(ВидЦены);
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВариантПриемкиТоваров) Тогда
		ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров();
	КонецЕсли;
	Если Не ВыполняетсяПакетноеФормирование() Тогда

		Документы.ЭтапПроизводства2_2.ПроверитьЗаполнитьНазначения(ЭтотОбъект);

		ПараметрыЗаполнения = Документы.ЭтапПроизводства2_2.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
		УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ВыпускПодДеятельность, ПараметрыЗаполнения);

	КонецЕсли;

	ЭтапПроизводства2_2Локализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);

КонецПроцедуры
