
&Вместо("ОбработкаУдаленияПроведения")
Процедура ВИЛС_ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//СформироватьСписокРегистровДляКонтроля();
	//
	//ПараметрыЗаполнения = ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов();
	//ПараметрыЗаполнения.ПериодЗаполнения = ДополнительныеСвойства.ПериодФормированияРезервовПоТоварамОрганизаций;
	//ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.ОтменаПроведения, ПараметрыЗаполнения);
	//
	//ЭтапПроизводства2_2Локализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);
	//// Временно не проверять
	//// ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	//
	//ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	//
	//ОбновитьСвязанныеДанные(Отказ, Истина);
	//
	//РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	//
	//Если ЗначениеЗаполнено(ДополнительныеСвойства.ПериодЗаполненияВидовЗапасовИСебестоимости) И Не Отказ Тогда
	//	ЗатратыСервер.ДобавитьВОчередьРасходТоваровОрганизацийНаПроизводство(
	//		Организация,
	//		Подразделение,
	//		Ссылка,
	//		ДополнительныеСвойства.ПериодЗаполненияВидовЗапасовИСебестоимости);
	//КонецЕсли;
	//
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПараметрыЗаполнения = ПараметрыЗаполненияВидовЗапасов("Проведение");
	
	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.ОтменаПроведения, ПараметрыЗаполнения);
	
	ЭтапПроизводства2_2Локализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);
	// Временно не проверять                                                           // begin fix Suetin 10.02.2020 10:25:37
	//ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);    // end fix Suetin 10.02.2020 10:25:42
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ОбновитьСвязанныеДанные(Отказ, Истина);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры
