#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВИЛС_ИзменитьЗаписиПоРегистратору(Документ)Экспорт
	Сотрудники = СотрудникиДокумента(Документ);	
	 
	Для Каждого СтрокаСотрудников ИЗ Сотрудники Цикл
		Набор = РегистрыСведений.БухучетЗарплатыСотрудников.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(СтрокаСотрудников.ДатаСобытия);
		Набор.Отбор.Сотрудник.Установить(СтрокаСотрудников.Сотрудник);
		//Набор.Отбор.ДокументОснование.Установить(СтрокаСотрудников.Регистратор);
		Набор.Прочитать();
		Если Не Набор.Количество() Тогда
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Период = СтрокаСотрудников.ДатаСобытия;
			НоваяЗапись.Сотрудник = СтрокаСотрудников.Сотрудник;
			НоваяЗапись.СпособОтраженияЗарплатыВБухучете = СтрокаСотрудников.СпособОтраженияЗарплатыВБухучете;
			//НоваяЗапись.ДокументОснование = Документ;
			Набор.Записать();
		ИначеЕсли Не Набор[0].СпособОтраженияЗарплатыВБухучете = СтрокаСотрудников.СпособОтраженияЗарплатыВБухучете Тогда
			Набор[0].СпособОтраженияЗарплатыВБухучете = СтрокаСотрудников.СпособОтраженияЗарплатыВБухучете;	
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

Функция СотрудникиДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботу.ДатаПриема КАК ДатаСобытия,
	|	ПриемНаРаботу.Ссылка КАК Регистратор,
	|	ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ПО ПриемНаРаботу.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
	|ГДЕ
	|	ПриемНаРаботу.Ссылка = &Ссылка
	|	И НЕ ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботуСпискомСотрудники.Сотрудник,
	|	ПриемНаРаботуСпискомСотрудники.ДатаПриема,
	|	ПриемНаРаботуСпискомСотрудники.Ссылка,
	|	ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете
	|ИЗ
	|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ПО ПриемНаРаботуСпискомСотрудники.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
	|ГДЕ
	|	ПриемНаРаботуСпискомСотрудники.Ссылка = &Ссылка
	|	И НЕ ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровыйПеревод.Сотрудник,
	|	КадровыйПеревод.ДатаНачала,
	|	КадровыйПеревод.Ссылка,
	|	ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете
	|ИЗ
	|	Документ.КадровыйПеревод КАК КадровыйПеревод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ПО КадровыйПеревод.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
	|ГДЕ
	|	КадровыйПеревод.Ссылка = &Ссылка
	|	И НЕ ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровыйПереводСпискомСотрудники.Сотрудник,
	|	КадровыйПереводСпискомСотрудники.ДатаНачала,
	|	КадровыйПереводСпискомСотрудники.Ссылка,
	|	ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете
	|ИЗ
	|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыйПереводСпискомСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ПО КадровыйПереводСпискомСотрудники.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
	|ГДЕ
	|	КадровыйПереводСпискомСотрудники.Ссылка = &Ссылка
	|	И НЕ ШтатноеРасписание.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|";
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Увольнение.Сотрудник,
	//|	Увольнение.ДатаУвольнения,
	//|	Увольнение.Ссылка,
	//|	Увольнение.СпособОтраженияЗарплатыВБухучете
	//|ИЗ
	//|	Документ.Увольнение КАК Увольнение
	//|ГДЕ
	//|	Увольнение.Ссылка = &Ссылка
	//|	И НЕ Увольнение.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УвольнениеСпискомСотрудники.Сотрудник,
	//|	УвольнениеСпискомСотрудники.ДатаУвольнения,
	//|	УвольнениеСпискомСотрудники.Ссылка,
	//|	УвольнениеСпискомСотрудники.СпособОтраженияЗарплатыВБухучете
	//|ИЗ
	//|	Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
	//|ГДЕ
	//|	УвольнениеСпискомСотрудники.Ссылка = &Ссылка
	//|	И НЕ УвольнениеСпискомСотрудники.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НачальнаяШтатнаяРасстановка.Сотрудник,
	//|	КОНЕЦПЕРИОДА(НачальнаяШтатнаяРасстановка.Ссылка.Месяц,МЕСЯЦ),
	//|	НачальнаяШтатнаяРасстановка.Ссылка,
	//|	НачальнаяШтатнаяРасстановка.СпособОтраженияЗарплатыВБухучете
	//|ИЗ
	//|	Документ.НачальнаяШтатнаяРасстановка.Сотрудники КАК НачальнаяШтатнаяРасстановка
	//|ГДЕ
	//|	НачальнаяШтатнаяРасстановка.Ссылка = &Ссылка
	//|	И НЕ НачальнаяШтатнаяРасстановка.СпособОтраженияЗарплатыВБухучете = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	//|";
	Запрос.УстановитьПараметр("Ссылка",Документ);
	Возврат(Запрос.Выполнить().Выгрузить());
	
КонецФункции

#КонецЕсли