// Вывод на печать приказа о приеме (Т-1)
&Вместо("ВывестиНаПечатьТ1")
Процедура ВИЛС_ВывестиНаПечатьТ1(ДокументРезультат, ДанныеСсылок, МакетПечатнойФормы, ИдентификаторыМакета = Неопределено, ОбъектыПечати = Неопределено) Экспорт
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_ПриказОПриеме";
	
	СотрудникиПериоды = Новый ТаблицаЗначений;
	СотрудникиПериоды.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	СотрудникиПериоды.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Для Каждого ДанныеНаПечать Из ДанныеСсылок Цикл
		
		Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл
			
			НоваяСтрока = СотрудникиПериоды.Добавить();
			НоваяСтрока.Период = ДанныеДетальныхЗаписей.РаботаДатаПриема;
			НоваяСтрока.Сотрудник = ДанныеДетальныхЗаписей.РаботаСотрудник;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СотрудникиПериоды", СотрудникиПериоды);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиПериоды.Период КАК Период,
		|	СотрудникиПериоды.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	&СотрудникиПериоды КАК СотрудникиПериоды";
	
	Запрос.Выполнить();
	
	НачисленияСотрудников = ТаблицаНачисленийСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
	
	Для Каждого ДанныеНаПечать Из ДанныеСсылок Цикл
		
		Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПерваяСтрокаПечатнойФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл
			
			ДанныеНачислений = Новый Структура("РаботаСведенияОбОплатеТрудаНадбавкаНаПечать");
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Период", ДанныеДетальныхЗаписей.РаботаДатаПриема);
			СтруктураПоиска.Вставить("Сотрудник", ДанныеДетальныхЗаписей.РаботаСотрудник);
			
			СтрокиНачисленийСотрудника = НачисленияСотрудников.НайтиСтроки(СтруктураПоиска);
			Если СтрокиНачисленийСотрудника.Количество() > 0 Тогда
				
				Если Не ЗначениеЗаполнено(ДанныеДетальныхЗаписей.РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать) Тогда
					
					ДанныеНачислений.Вставить("РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать",
						ЗарплатаКадрыОтчеты.ТарифнаяСтавкаНаПечать(СтрокиНачисленийСотрудника[0].ТарифнаяСтавка));
					
				КонецЕсли;
				
				ДанныеНачислений.РаботаСведенияОбОплатеТрудаНадбавкаНаПечать = СтрокиНачисленийСотрудника[0].Надбавка;
				
			КонецЕсли;
			
			ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(ИдентификаторыМакета, ДанныеДетальныхЗаписей);
			//>>fix Клещ А.Н. добавляем свои поля и прописываем эти поля в макете в режиме 1С:Предприятия
			ДанныеНачислений.РаботаСведенияОбОплатеТрудаНадбавкаНаПечать = ?(СокрЛП(ДанныеНачислений.РаботаСведенияОбОплатеТрудаНадбавкаНаПечать) = "% надб.","",ДанныеНачислений.РаботаСведенияОбОплатеТрудаНадбавкаНаПечать);
			ДанныеПользовательскихПолей.Вставить("РаботаДниИспытательногоСрокаПрописью",СтрЗаменить(НРег(ЧислоПрописью(ДанныеДетальныхЗаписей.РаботаДлительностьИспытательногоСрока))," 00",""));
			Если ТипЗнч(ДанныеДетальныхЗаписей.СсылкаНаОбъект) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
				ВыплачиваемПропорционально = ?(ДанныеДетальныхЗаписей.СсылкаНаОбъект.КоличествоСтавок = 1,"","выплачиваемые пропорционально отработанному времени.");
			Иначе
				ВыплачиваемПропорционально = "";
			КонецЕсли;
			ДанныеПользовательскихПолей.Вставить("РаботаДополнениеКВидуОплаты",ВыплачиваемПропорционально);
			//<<fix Клещ А.Н.
			ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
				ДокументРезультат, МакетПечатнойФормы, "Шапка,Работник,Подвал",
				ДанныеНаПечать,
				ДанныеДетальныхЗаписей,
				ДанныеПользовательскихПолей,
				ДанныеНачислений);
			
		КонецЦикла;
		
		Если ОбъектыПечати <> Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаПечатнойФормы, ОбъектыПечати, ДанныеНаПечать.СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
