
&После("ОбработкаПроведения")
Процедура ВИЛС_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ВИЛС_Служебный.ИспользуютсяОсобыеУсловияТруда(Организация) Тогда
		РегистрыСведений.ВИЛС_ДанныеУсловийТрудаПоСотрудникам.ИзменитьЗаписиПоРегистратору(ЭтотОбъект.Ссылка,Истина);
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура ВИЛС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ВИЛС_Служебный.ИспользуютсяОсобыеУсловияТруда(Организация) Тогда
		РегистрыСведений.ВИЛС_ДанныеУсловийТрудаПоСотрудникам.ИзменитьЗаписиПоРегистратору(ЭтотОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры
