
&ИзменениеИКонтроль("СформироватьВТНачисленияСДаннымиУчета")
Процедура ВИЛС_СформироватьВТНачисленияСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИсключаемыйРегистратор)

	УчетСтраховыхВзносовБазовый.СформироватьВТНачисленияСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ПолучитьФункциональнуюОпцию("ИспользоватьОсобыеУсловияТруда", Новый Структура("Организация",Организация)));

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Начало", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Окончание", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	Запрос.УстановитьПараметр("КонецМесяца", УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(ПериодРегистрации));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизическоеЛицо,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ОблагаетсяВзносамиВПФР,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СУММА(СведенияОДоходах.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТДоходыЗаПериод
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтраховыеВзносыСведенияОДоходахОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|		СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода КАК ВидДохода,
	|		СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|		СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|		СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
	|		СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда КАК КлассУсловийТруда,
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	|		&КлассУсловийТруда КАК КлассУсловийТруда,
#КонецВставки
	|		СтраховыеВзносыСведенияОДоходахОбороты.СуммаОборот КАК Результат
	|	ИЗ
	|		РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Обороты(
	|				&Начало,
	|				&Окончание,
	|				,
	|				ГоловнаяОрганизация = &ГоловнаяОрганизация
	|					И Организация = &Организация
	|					И ФизическоеЛицо В
	|						(ВЫБРАТЬ
	|							Доходы.ФизическоеЛицо
	|						ИЗ
	|							ВТСДаннымиУчета КАК Доходы)) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо,
	|		СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
	|		СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	|		&КлассУсловий1Труда,
#КонецВставки
	|		-СтраховыеВзносыСведенияОДоходах.Сумма
	|	ИЗ
	|		РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СтраховыеВзносыСведенияОДоходах
	|	ГДЕ
	|		СтраховыеВзносыСведенияОДоходах.Регистратор = &ИсключаемыйРегистратор
	|		И СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					Доходы.ФизическоеЛицо
	|				ИЗ
	|					ВТСДаннымиУчета КАК Доходы)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеУчета.ФизическоеЛицо,
	|		ДанныеУчета.ВидДохода,
	|		ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|		ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|		ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|		ДанныеУчета.КлассУсловийТруда,
	|		ДанныеУчета.Сумма
	|	ИЗ
	|		ВТНачисленияСДаннымиУчета КАК ДанныеУчета) КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизическоеЛицо,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|
	|ИМЕЮЩИЕ
	|	СУММА(СведенияОДоходах.Результат) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизическоеЛицо,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ОблагаетсяВзносамиВПФР,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда
	|ПОМЕСТИТЬ ВТПоложительныеДоходыПоРегистратору
	|ИЗ
	|	ВТНачисленияСДаннымиУчета КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизическоеЛицо,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|
	|ИМЕЮЩИЕ
	|	СУММА(СведенияОДоходах.Сумма) >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоходыЗаПериод.ФизическоеЛицо
	|ИЗ
	|	ВТДоходыЗаПериод КАК ДоходыЗаПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоложительныеДоходыПоРегистратору КАК ПоложительныеДоходы
	|		ПО ДоходыЗаПериод.ФизическоеЛицо = ПоложительныеДоходы.ФизическоеЛицо
	|			И ДоходыЗаПериод.ОблагаетсяВзносамиВПФР = ПоложительныеДоходы.ОблагаетсяВзносамиВПФР
	|			И ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам = ПоложительныеДоходы.ОблагаетсяВзносамиНаДоплатуЛетчикам
	|			И ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуШахтерам = ПоложительныеДоходы.ОблагаетсяВзносамиНаДоплатуШахтерам
	|			И ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ПоложительныеДоходы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|			И ДоходыЗаПериод.КлассУсловийТруда = ПоложительныеДоходы.КлассУсловийТруда
	|ГДЕ
	|	ДоходыЗаПериод.Результат < 0
	|	И ПоложительныеДоходы.ФизическоеЛицо ЕСТЬ NULL ";
#Вставка
	Запрос.Текст = ?(ПериодРегистрации <Дата('20250101'),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)"),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда"));
	Запрос.Текст = ?(ПериодРегистрации <Дата('20250101'),СтрЗаменить(Запрос.Текст,"&КлассУсловий1Труда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)"),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда"));
#КонецВставки

	Если Не Запрос.Выполнить().Пустой() Тогда

		ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, "ВТНачисленияСДаннымиУчета");

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблица.Сотрудник,
		|	ВременнаяТаблица.Начисление,
		|	ВременнаяТаблица.ПодразделениеОрганизации КАК Подразделение,
		|	ВременнаяТаблица.ДатаНачала,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблица.Сторно
		|				И ДоходыЗаПериод.Результат >= 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВременнаяТаблица.Сторно
		|	КОНЕЦ КАК Сторно,
		|	ВременнаяТаблица.СторнируемыйДокумент,
		|	ДанныеУчета.ВидДохода,
		|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДанныеУчета.ЯвляетсяДоходомФармацевта,
		|	ДанныеУчета.ЛьготныйТерриториальныйТариф,
		|	ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДанныеУчета.КлассУсловийТруда,
		|	ВЫРАЗИТЬ(СУММА(ВременнаяТаблица.СуммаДохода * ЕСТЬNULL(ДанныеУчета.КоэффициентУчетаСтроки, 1)) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.ВидДохода.ОблагаетсяВзносамиЧастично
		|			ТОГДА ВЫРАЗИТЬ(СУММА(ВременнаяТаблица.СуммаВычетаВзносы * ЕСТЬNULL(ДанныеУчета.КоэффициентУчетаСтроки, 1)) КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Скидка,
		|	ДанныеУчета.ФизическоеЛицо
		|ИЗ
		|	ВТНачисления КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСДаннымиУчета КАК ДанныеУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗаПериод КАК ДоходыЗаПериод
		|			ПО ДанныеУчета.ФизическоеЛицо = ДоходыЗаПериод.ФизическоеЛицо
		|				И ДанныеУчета.ВидДохода.ВходитВБазуПФР = ДоходыЗаПериод.ОблагаетсяВзносамиВПФР
		|				И ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|				И ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуШахтерам
		|				И ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|				И ДанныеУчета.КлассУсловийТруда = ДоходыЗаПериод.КлассУсловийТруда
		|		ПО ВременнаяТаблица.Сотрудник = ДанныеУчета.Сотрудник
		|			И ВременнаяТаблица.Начисление = ДанныеУчета.Начисление
		|			И ВременнаяТаблица.ПодразделениеОрганизации = ДанныеУчета.Подразделение
		|			И ВременнаяТаблица.ДатаНачала = ДанныеУчета.ДатаНачала
		|			И ВременнаяТаблица.УсловияТруда = ДанныеУчета.УсловияТруда
		|ГДЕ
		|	(ВременнаяТаблица.СуммаДохода <> 0
		|			ИЛИ ВременнаяТаблица.СуммаВычетаВзносы <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.Сотрудник,
		|	ВременнаяТаблица.Начисление,
		|	ВременнаяТаблица.ПодразделениеОрганизации,
		|	ВременнаяТаблица.ДатаНачала,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблица.Сторно
		|				И ДоходыЗаПериод.Результат >= 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВременнаяТаблица.Сторно
		|	КОНЕЦ,
		|	ВременнаяТаблица.СторнируемыйДокумент,
		|	ДанныеУчета.ВидДохода,
		|	ДанныеУчета.ВидДохода.ОблагаетсяВзносамиЧастично,
		|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДанныеУчета.ЯвляетсяДоходомФармацевта,
		|	ДанныеУчета.ЛьготныйТерриториальныйТариф,
		|	ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДанныеУчета.КлассУсловийТруда,
		|	ДанныеУчета.ФизическоеЛицо";

		ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
		ВременнаяТаблица.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
		НомерСтроки = 1;
		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
			СтрокаТЗ.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоходыЗаПериод.ФизическоеЛицо,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиВПФР,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДоходыЗаПериод.КлассУсловийТруда
		|ИЗ
		|	ВТДоходыЗаПериод КАК ДоходыЗаПериод
		|ГДЕ
		|	ДоходыЗаПериод.Результат >= 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоложительныеДоходы.ФизическоеЛицо,
		|	ПоложительныеДоходы.ОблагаетсяВзносамиВПФР,
		|	ПоложительныеДоходы.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ПоложительныеДоходы.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ПоложительныеДоходы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ПоложительныеДоходы.КлассУсловийТруда
		|ИЗ
		|	ВТПоложительныеДоходыПоРегистратору КАК ПоложительныеДоходы";
		ДоходыЗаПериод = Запрос.Выполнить().Выгрузить(); 

		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Начисления", ВременнаяТаблица); ВременнаяТаблица = Неопределено;
		Запрос.УстановитьПараметр("ДоходыЗаПериод", ДоходыЗаПериод); ДоходыЗаПериод = Неопределено;

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.НомерСтроки,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.Подразделение,
		|	Начисления.ДатаНачала,
		|	Начисления.Сторно,
		|	Начисления.СторнируемыйДокумент,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.Сумма,
		|	Начисления.Скидка,
		|	Начисления.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТНачисленияДокумента
		|ИЗ
		|	&Начисления КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыЗаПериод.ФизическоеЛицо,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиВПФР,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДоходыЗаПериод.КлассУсловийТруда
		|ПОМЕСТИТЬ ВТДоходыЗаПериод
		|ИЗ
		|	&ДоходыЗаПериод КАК ДоходыЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияДокумента.НомерСтроки,
		|	НачисленияДокумента.Сотрудник,
		|	НачисленияДокумента.Начисление,
		|	НачисленияДокумента.ДатаНачала,
		|	НачисленияДокумента.СторнируемыйДокумент
		|ПОМЕСТИТЬ ВТСторноНачисленияДокумента
		|ИЗ
		|	ВТНачисленияДокумента КАК НачисленияДокумента
		|ГДЕ
		|	НачисленияДокумента.Сторно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияДокумента.НомерСтроки
		|ПОМЕСТИТЬ ВТПарныеСтроки
		|ИЗ
		|	ВТНачисленияДокумента КАК НачисленияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСторноНачисленияДокумента КАК СторноНачисленияДокумента
		|		ПО НачисленияДокумента.Сотрудник = СторноНачисленияДокумента.Сотрудник
		|			И НачисленияДокумента.Начисление = СторноНачисленияДокумента.Начисление
		|			И НачисленияДокумента.ДатаНачала = СторноНачисленияДокумента.ДатаНачала
		|ГДЕ
		|	НЕ НачисленияДокумента.Сторно
		|	И СторноНачисленияДокумента.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СторноНачисленияДокумента.НомерСтроки
		|ИЗ
		|	ВТНачисленияДокумента КАК НачисленияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСторноНачисленияДокумента КАК СторноНачисленияДокумента
		|		ПО НачисленияДокумента.Сотрудник = СторноНачисленияДокумента.Сотрудник
		|			И НачисленияДокумента.Начисление = СторноНачисленияДокумента.Начисление
		|			И НачисленияДокумента.ДатаНачала = СторноНачисленияДокумента.ДатаНачала
		|ГДЕ
		|	НЕ НачисленияДокумента.Сторно
		|	И СторноНачисленияДокумента.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачисленияДокумента.НомерСтроки
		|ИЗ
		|	ВТНачисленияДокумента КАК НачисленияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДоходовПоСтраховымВзносам КАК ВидыДоходовПоСтраховымВзносам
		|		ПО НачисленияДокумента.ВидДохода = ВидыДоходовПоСтраховымВзносам.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗаПериод КАК ДоходыЗаПериод
		|		ПО НачисленияДокумента.ФизическоеЛицо = ДоходыЗаПериод.ФизическоеЛицо
		|			И (ВидыДоходовПоСтраховымВзносам.ВходитВБазуПФР = ДоходыЗаПериод.ОблагаетсяВзносамиВПФР)
		|			И НачисленияДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			И НачисленияДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			И НачисленияДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И НачисленияДокумента.КлассУсловийТруда = ДоходыЗаПериод.КлассУсловийТруда
		|ГДЕ
		|	ДоходыЗаПериод.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияДокумента.НомерСтроки
		|ПОМЕСТИТЬ ВТСтрокиДокументаСПарнымиНачислениями
		|ИЗ
		|	ВТПарныеСтроки КАК НачисленияДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СторноНачисленияДокумента.НомерСтроки
		|ИЗ
		|	ВТСторноНачисленияДокумента КАК СторноНачисленияДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НачисленияДокумента.ДатаНачала КАК ДатаНачала,
		|			НачисленияДокумента.Сотрудник КАК Сотрудник
		|		ИЗ
		|			ВТНачисленияДокумента КАК НачисленияДокумента
		|		ГДЕ
		|			НЕ НачисленияДокумента.Сторно
		|			И НЕ НачисленияДокумента.НомерСтроки В
		|						(ВЫБРАТЬ
		|							ПарныеСтроки.НомерСтроки
		|						ИЗ
		|							ВТПарныеСтроки КАК ПарныеСтроки)) КАК НачисленияДокумента
		|		ПО СторноНачисленияДокумента.Сотрудник = НачисленияДокумента.Сотрудник
		|			И СторноНачисленияДокумента.ДатаНачала = НачисленияДокумента.ДатаНачала
		|ГДЕ
		|	НачисленияДокумента.Сотрудник ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(Начисления.НомерСтроки) КАК НомерСтроки,
		|	Начисления.Начисление,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	НАЧАЛОПЕРИОДА(Начисления.ДатаНачала, МЕСЯЦ) КАК ДатаНачала,
		|	СУММА(Начисления.Сумма) КАК Сумма,
		|	СУММА(Начисления.Скидка) КАК Скидка,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.Сторно
		|ПОМЕСТИТЬ ВТСтрокиДоходов
		|ИЗ
		|	ВТНачисленияДокумента КАК Начисления
		|ГДЕ
		|	Начисления.НомерСтроки В
		|			(ВЫБРАТЬ
		|				СтрокиДокументаСПарнымиНачислениями.НомерСтроки
		|			ИЗ
		|				ВТСтрокиДокументаСПарнымиНачислениями КАК СтрокиДокументаСПарнымиНачислениями)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Начисление,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	Начисления.ФизическоеЛицо,
		|	Начисления.Сторно,
		|	НАЧАЛОПЕРИОДА(Начисления.ДатаНачала, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(Начисления.НомерСтроки) КАК НомерСтроки,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	НАЧАЛОПЕРИОДА(Начисления.ДатаНачала, МЕСЯЦ) КАК ДатаНачала,
		|	СУММА(Начисления.Сумма) КАК Сумма,
		|	СУММА(Начисления.Скидка) КАК Скидка,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.Сторно
		|ПОМЕСТИТЬ ВТСтрокиДоходовПоВидамДохода
		|ИЗ
		|	ВТНачисленияДокумента КАК Начисления
		|ГДЕ
		|	НЕ Начисления.НомерСтроки В
		|				(ВЫБРАТЬ
		|					СтрокиДокументаСПарнымиНачислениями.НомерСтроки
		|				ИЗ
		|					ВТСтрокиДокументаСПарнымиНачислениями КАК СтрокиДокументаСПарнымиНачислениями)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	Начисления.ФизическоеЛицо,
		|	Начисления.Сторно,
		|	НАЧАЛОПЕРИОДА(Начисления.ДатаНачала, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.НомерСтроки,
		|	ДанныеДокумента.ФизическоеЛицо,
		|	СтрокиДокументаПоНомерСтроки.Сотрудник,
		|	СтрокиДокументаПоНомерСтроки.Подразделение,
		|	ДанныеДокумента.Начисление,
		|	СтрокиДокументаПоНомерСтроки.ДатаНачала,
		|	ДанныеДокумента.ВидДохода,
		|	ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДанныеДокумента.КлассУсловийТруда,
		|	ДанныеДокумента.ЯвляетсяДоходомФармацевта,
		|	ДанныеДокумента.ЛьготныйТерриториальныйТариф,
		|	ДанныеДокумента.Сторно,
		|	&КонецМесяца КАК ДатаПолученияДохода,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Сторно
		|				И ЕСТЬNULL(СтрокиДокументаПоПериодуДействия.НомерСтроки, 0) <> ДанныеДокумента.НомерСтроки
		|			ТОГДА 0
		|		КОГДА СторноЗаписиДокумента.Сумма ЕСТЬ NULL 
		|			ТОГДА ДанныеДокумента.Сумма
		|		КОГДА НЕ ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма > 0
		|			ТОГДА ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма
		|		КОГДА ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма < 0
		|			ТОГДА ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Сторно
		|				И ЕСТЬNULL(СтрокиДокументаПоПериодуДействия.НомерСтроки, 0) <> ДанныеДокумента.НомерСтроки
		|			ТОГДА 0
		|		КОГДА СторноЗаписиДокумента.Сумма ЕСТЬ NULL 
		|			ТОГДА ДанныеДокумента.Скидка
		|		КОГДА НЕ ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма > 0
		|			ТОГДА ДанныеДокумента.Скидка + СторноЗаписиДокумента.Скидка
		|		КОГДА ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма < 0
		|			ТОГДА ДанныеДокумента.Скидка + СторноЗаписиДокумента.Скидка
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Скидка,
		|	СтрокиДокументаПоПериодуДействия.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВТНачисленияСоСторноЗаписями
		|ИЗ
		|	ВТСтрокиДоходов КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК СтрокиДокументаПоПериодуДействия
		|		ПО (ДанныеДокумента.ДатаНачала = НАЧАЛОПЕРИОДА(СтрокиДокументаПоПериодуДействия.ДатаНачала, МЕСЯЦ))
		|			И ДанныеДокумента.Начисление = СтрокиДокументаПоПериодуДействия.Начисление
		|			И ДанныеДокумента.ФизическоеЛицо = СтрокиДокументаПоПериодуДействия.ФизическоеЛицо
		|			И ДанныеДокумента.ВидДохода = СтрокиДокументаПоПериодуДействия.ВидДохода
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			И ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И ДанныеДокумента.КлассУсловийТруда = СтрокиДокументаПоПериодуДействия.КлассУсловийТруда
		|			И ДанныеДокумента.ЯвляетсяДоходомФармацевта = СтрокиДокументаПоПериодуДействия.ЯвляетсяДоходомФармацевта
		|			И ДанныеДокумента.ЛьготныйТерриториальныйТариф = СтрокиДокументаПоПериодуДействия.ЛьготныйТерриториальныйТариф
		|			И ДанныеДокумента.Сторно = СтрокиДокументаПоПериодуДействия.Сторно
		|			И (ДанныеДокумента.Сторно)
		|			И (СтрокиДокументаПоПериодуДействия.НомерСтроки В
		|				(ВЫБРАТЬ
		|					СтрокиДокументаСПарнымиНачислениями.НомерСтроки
		|				ИЗ
		|					ВТСтрокиДокументаСПарнымиНачислениями КАК СтрокиДокументаСПарнымиНачислениями))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК СтрокиДокументаПоНомерСтроки
		|		ПО ДанныеДокумента.НомерСтроки = СтрокиДокументаПоНомерСтроки.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиДоходов КАК СторноЗаписиДокумента
		|		ПО ДанныеДокумента.Начисление = СторноЗаписиДокумента.Начисление
		|			И ДанныеДокумента.ФизическоеЛицо = СторноЗаписиДокумента.ФизическоеЛицо
		|			И ДанныеДокумента.ДатаНачала = СторноЗаписиДокумента.ДатаНачала
		|			И ДанныеДокумента.ВидДохода = СторноЗаписиДокумента.ВидДохода
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам = СторноЗаписиДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам = СторноЗаписиДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			И ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СторноЗаписиДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И ДанныеДокумента.КлассУсловийТруда = СторноЗаписиДокумента.КлассУсловийТруда
		|			И ДанныеДокумента.ЯвляетсяДоходомФармацевта = СторноЗаписиДокумента.ЯвляетсяДоходомФармацевта
		|			И ДанныеДокумента.ЛьготныйТерриториальныйТариф = СторноЗаписиДокумента.ЛьготныйТерриториальныйТариф
		|			И (НЕ ДанныеДокумента.Сторно
		|					И СторноЗаписиДокумента.Сторно
		|				ИЛИ ДанныеДокумента.Сторно
		|					И НЕ СторноЗаписиДокумента.Сторно)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.НомерСтроки,
		|	ДанныеДокумента.ФизическоеЛицо,
		|	СтрокиДокументаПоНомерСтроки.Сотрудник,
		|	СтрокиДокументаПоНомерСтроки.Подразделение,
		|	СтрокиДокументаПоНомерСтроки.Начисление,
		|	СтрокиДокументаПоНомерСтроки.ДатаНачала,
		|	ДанныеДокумента.ВидДохода,
		|	ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДанныеДокумента.КлассУсловийТруда,
		|	ДанныеДокумента.ЯвляетсяДоходомФармацевта,
		|	ДанныеДокумента.ЛьготныйТерриториальныйТариф,
		|	ДанныеДокумента.Сторно,
		|	&КонецМесяца,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Сторно
		|				И ЕСТЬNULL(СтрокиДокументаПоПериодуДействия.НомерСтроки, 0) <> ДанныеДокумента.НомерСтроки
		|			ТОГДА 0
		|		КОГДА СторноЗаписиДокумента.Сумма ЕСТЬ NULL 
		|			ТОГДА ДанныеДокумента.Сумма
		|		КОГДА НЕ ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма > 0
		|			ТОГДА ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма
		|		КОГДА ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма < 0
		|			ТОГДА ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Сторно
		|				И ЕСТЬNULL(СтрокиДокументаПоПериодуДействия.НомерСтроки, 0) <> ДанныеДокумента.НомерСтроки
		|			ТОГДА 0
		|		КОГДА СторноЗаписиДокумента.Сумма ЕСТЬ NULL 
		|			ТОГДА ДанныеДокумента.Скидка
		|		КОГДА НЕ ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма > 0
		|			ТОГДА ДанныеДокумента.Скидка + СторноЗаписиДокумента.Скидка
		|		КОГДА ДанныеДокумента.Сторно
		|				И ДанныеДокумента.Сумма + СторноЗаписиДокумента.Сумма < 0
		|			ТОГДА ДанныеДокумента.Скидка + СторноЗаписиДокумента.Скидка
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	СтрокиДокументаПоПериодуДействия.СторнируемыйДокумент
		|ИЗ
		|	ВТСтрокиДоходовПоВидамДохода КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК СтрокиДокументаПоПериодуДействия
		|		ПО (ДанныеДокумента.ДатаНачала = НАЧАЛОПЕРИОДА(СтрокиДокументаПоПериодуДействия.ДатаНачала, МЕСЯЦ))
		|			И ДанныеДокумента.ФизическоеЛицо = СтрокиДокументаПоПериодуДействия.ФизическоеЛицо
		|			И ДанныеДокумента.ВидДохода = СтрокиДокументаПоПериодуДействия.ВидДохода
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			И ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И ДанныеДокумента.КлассУсловийТруда = СтрокиДокументаПоПериодуДействия.КлассУсловийТруда
		|			И ДанныеДокумента.ЯвляетсяДоходомФармацевта = СтрокиДокументаПоПериодуДействия.ЯвляетсяДоходомФармацевта
		|			И ДанныеДокумента.ЛьготныйТерриториальныйТариф = СтрокиДокументаПоПериодуДействия.ЛьготныйТерриториальныйТариф
		|			И ДанныеДокумента.Сторно = СтрокиДокументаПоПериодуДействия.Сторно
		|			И (ДанныеДокумента.Сторно)
		|			И (НЕ СтрокиДокументаПоПериодуДействия.НомерСтроки В
		|					(ВЫБРАТЬ
		|						СтрокиДокументаСПарнымиНачислениями.НомерСтроки
		|					ИЗ
		|						ВТСтрокиДокументаСПарнымиНачислениями КАК СтрокиДокументаСПарнымиНачислениями))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияДокумента КАК СтрокиДокументаПоНомерСтроки
		|		ПО ДанныеДокумента.НомерСтроки = СтрокиДокументаПоНомерСтроки.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиДоходовПоВидамДохода КАК СторноЗаписиДокумента
		|		ПО ДанныеДокумента.ФизическоеЛицо = СторноЗаписиДокумента.ФизическоеЛицо
		|			И ДанныеДокумента.ДатаНачала = СторноЗаписиДокумента.ДатаНачала
		|			И ДанныеДокумента.ВидДохода = СторноЗаписиДокумента.ВидДохода
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам = СторноЗаписиДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам = СторноЗаписиДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			И ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СторноЗаписиДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И ДанныеДокумента.КлассУсловийТруда = СторноЗаписиДокумента.КлассУсловийТруда
		|			И ДанныеДокумента.ЯвляетсяДоходомФармацевта = СторноЗаписиДокумента.ЯвляетсяДоходомФармацевта
		|			И ДанныеДокумента.ЛьготныйТерриториальныйТариф = СторноЗаписиДокумента.ЛьготныйТерриториальныйТариф
		|			И (НЕ ДанныеДокумента.Сторно
		|					И СторноЗаписиДокумента.Сторно
		|				ИЛИ ДанныеДокумента.Сторно
		|					И НЕ СторноЗаписиДокумента.Сторно)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияСоСторноЗаписями.НомерСтроки,
		|	НачисленияСоСторноЗаписями.СторнируемыйДокумент
		|ИЗ
		|	ВТНачисленияСоСторноЗаписями КАК НачисленияСоСторноЗаписями
		|ГДЕ
		|	НачисленияСоСторноЗаписями.Сторно";

		ТаблицаСторнируемыхДокументов = Запрос.Выполнить().Выгрузить();
		ТаблицаПромежуточныхИсправлений = ТаблицаСторнируемыхДокументов.СкопироватьКолонки("СторнируемыйДокумент");
		ТаблицаПромежуточныхИсправлений.Колонки.Добавить("ПромежуточноеИсправление", ТаблицаСторнируемыхДокументов.Колонки.СторнируемыйДокумент.ТипЗначения);
		УточнитьСторнируемыеДокументы(ТаблицаСторнируемыхДокументов, ТаблицаПромежуточныхИсправлений);
		Запрос.УстановитьПараметр("ТаблицаСторнируемыхДокументов", ТаблицаСторнируемыхДокументов);
		Запрос.УстановитьПараметр("ТаблицаПромежуточныхИсправлений", ТаблицаПромежуточныхИсправлений);

		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаСторнируемыхДокументов.НомерСтроки КАК НомерСтроки,
		|	ТаблицаСторнируемыхДокументов.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВТТаблицаСторнируемыхДокументов
		|ИЗ
		|	&ТаблицаСторнируемыхДокументов КАК ТаблицаСторнируемыхДокументов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаПромежуточныхИсправлений.ПромежуточноеИсправление КАК ПромежуточноеИсправление,
		|	ТаблицаПромежуточныхИсправлений.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВТТаблицаПромежуточныхИсправлений
		|ИЗ
		|	&ТаблицаПромежуточныхИсправлений КАК ТаблицаПромежуточныхИсправлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	СведенияОДоходах.Сумма КАК Сумма,
		|	СведенияОДоходах.Скидка КАК Скидка,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.ВидДохода КАК ВидДохода,
		|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
		|	СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
		|	&КлассУсловийТруда КАК КлассУсловийТруда,
#КонецВставки
		|	СведенияОДоходах.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
		|		ИНАЧЕ СведенияОДоходах.ЛьготныйТерриториальныйТариф
		|	КОНЕЦ КАК ЛьготныйТерриториальныйТариф,
		|	СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТСведенияРегистраБезУточнений
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			СторноЗаписи.СторнируемыйДокумент КАК Документ
		|		ИЗ
		|			ВТТаблицаСторнируемыхДокументов КАК СторноЗаписи) КАК СторнируемыеДокументы
		|		ПО СведенияОДоходах.Регистратор = СторнируемыеДокументы.Документ
		|ГДЕ
		|	СведенияОДоходах.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				Начисления.ФизическоеЛицо
		|			ИЗ
		|				ВТНачисленияСоСторноЗаписями КАК Начисления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияРегистраБезУточнений.Регистратор КАК Регистратор,
		|	СведенияРегистраБезУточнений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияРегистраБезУточнений.ВидДохода КАК ВидДохода,
		|	СведенияРегистраБезУточнений.Начисление КАК Начисление,
		|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СведенияРегистраБезУточнений.КлассУсловийТруда КАК КлассУсловийТруда,
		|	СведенияРегистраБезУточнений.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
		|	СведенияРегистраБезУточнений.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
		|	МИНИМУМ(СведенияРегистраБезУточнений.ДатаПолученияДохода) КАК ДатаПолученияДохода,
		|	МИНИМУМ(СведенияРегистраБезУточнений.Период) КАК Период
		|ПОМЕСТИТЬ ВТСторнируемыеСтрокиДоходов
		|ИЗ
		|	ВТСведенияРегистраБезУточнений КАК СведенияРегистраБезУточнений
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияРегистраБезУточнений.Регистратор,
		|	СведенияРегистраБезУточнений.ФизическоеЛицо,
		|	СведенияРегистраБезУточнений.ВидДохода,
		|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СведенияРегистраБезУточнений.КлассУсловийТруда,
		|	СведенияРегистраБезУточнений.ЯвляетсяДоходомФармацевта,
		|	СведенияРегистраБезУточнений.ЛьготныйТерриториальныйТариф,
		|	СведенияРегистраБезУточнений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыСУточнением.Период КАК Период,
		|	ДоходыСУточнением.Регистратор КАК Регистратор,
		|	СУММА(ДоходыСУточнением.Сумма) КАК Сумма,
		|	СУММА(ДоходыСУточнением.Скидка) КАК Скидка,
		|	ДоходыСУточнением.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыСУточнением.ВидДохода КАК ВидДохода,
		|	ДоходыСУточнением.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДоходыСУточнением.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДоходыСУточнением.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДоходыСУточнением.КлассУсловийТруда КАК КлассУсловийТруда,
		|	ДоходыСУточнением.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
		|	ДоходыСУточнением.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
		|	ДоходыСУточнением.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	ДоходыСУточнением.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТСведенияРегистра
		|ИЗ
		|	(ВЫБРАТЬ
		|		СведенияОДоходах.Период КАК Период,
		|		СведенияОДоходах.Регистратор КАК Регистратор,
		|		СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СведенияОДоходах.ВидДохода КАК ВидДохода,
		|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|		СведенияОДоходах.Начисление КАК Начисление,
		|		СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|		СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|		СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
		|		СведенияОДоходах.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
		|		СведенияОДоходах.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
		|		СведенияОДоходах.Сумма КАК Сумма,
		|		СведенияОДоходах.Скидка КАК Скидка
		|	ИЗ
		|		ВТСведенияРегистраБезУточнений КАК СведенияОДоходах
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.Период,
		|		СтрокиДоходов.Регистратор,
		|		СтрокиДоходов.ФизическоеЛицо,
		|		СтрокиДоходов.ВидДохода,
		|		СведенияОДоходах.ДатаПолученияДохода,
		|		СтрокиДоходов.Начисление,
		|		СтрокиДоходов.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|		СтрокиДоходов.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|		СтрокиДоходов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СтрокиДоходов.КлассУсловийТруда,
		|		СтрокиДоходов.ЯвляетсяДоходомФармацевта,
		|		СтрокиДоходов.ЛьготныйТерриториальныйТариф,
		|		СведенияОДоходах.Сумма,
		|		СведенияОДоходах.Скидка
		|	ИЗ
		|		ВТСторнируемыеСтрокиДоходов КАК СтрокиДоходов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаПромежуточныхИсправлений КАК ТаблицаПромежуточныхИсправлений
		|			ПО СтрокиДоходов.Регистратор = ТаблицаПромежуточныхИсправлений.СторнируемыйДокумент
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходах
		|			ПО (ТаблицаПромежуточныхИсправлений.ПромежуточноеИсправление = СведенияОДоходах.Регистратор)
		|				И СтрокиДоходов.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
		|				И СтрокиДоходов.ВидДохода = СведенияОДоходах.ВидДохода
		|				И (СтрокиДоходов.Начисление = СведенияОДоходах.Начисление
		|					ИЛИ СведенияОДоходах.Начисление В (ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ПособиеПриРожденииРебенка), ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности), ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ПустаяСсылка)))
		|	ГДЕ
		|		СведенияОДоходах.ФизическоеЛицо ЕСТЬ НЕ NULL ) КАК ДоходыСУточнением
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоходыСУточнением.Период,
		|	ДоходыСУточнением.Регистратор,
		|	ДоходыСУточнением.ФизическоеЛицо,
		|	ДоходыСУточнением.ВидДохода,
		|	ДоходыСУточнением.ДатаПолученияДохода,
		|	ДоходыСУточнением.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДоходыСУточнением.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДоходыСУточнением.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДоходыСУточнением.КлассУсловийТруда,
		|	ДоходыСУточнением.ЯвляетсяДоходомФармацевта,
		|	ДоходыСУточнением.ЛьготныйТерриториальныйТариф,
		|	ДоходыСУточнением.Начисление
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДоходыСУточнением.Сумма) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
		|	ДанныеДокумента.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеДокумента.Сотрудник КАК Сотрудник,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ДанныеДокумента.Начисление КАК Начисление,
		|	ДанныеДокумента.ДатаНачала КАК ДатаНачала,
		|	ЕСТЬNULL(СведенияОДоходах.ВидДохода, ДанныеДокумента.ВидДохода) КАК ВидДохода,
		|	ДанныеДокумента.Сумма КАК Сумма,
		|	ДанныеДокумента.Скидка КАК Скидка,
		|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам) КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам) КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией, ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ЕСТЬNULL(СведенияОДоходах.КлассУсловийТруда, ДанныеДокумента.КлассУсловийТруда) КАК КлассУсловийТруда,
		|	ЕСТЬNULL(СведенияОДоходах.ЯвляетсяДоходомФармацевта, ДанныеДокумента.ЯвляетсяДоходомФармацевта) КАК ЯвляетсяДоходомФармацевта,
		|	ЕСТЬNULL(СведенияОДоходах.ЛьготныйТерриториальныйТариф, ДанныеДокумента.ЛьготныйТерриториальныйТариф) КАК ЛьготныйТерриториальныйТариф,
		|	ЕСТЬNULL(СведенияОДоходах.ДатаПолученияДохода, ДанныеДокумента.ДатаПолученияДохода) КАК ДатаПолученияДохода,
		|	ВЫБОР
		|		КОГДА СведенияОДоходах.Регистратор ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьСторнируемыеДанныеУчета,
		|	ЕСТЬNULL(СведенияОДоходах.Сумма, 0) КАК СуммаВУчете,
		|	ЕСТЬNULL(СведенияОДоходах.Скидка, 0) КАК СкидкаВУчете
		|ПОМЕСТИТЬ ВТНачисленияСоСведениямиРегистра
		|ИЗ
		|	ВТНачисленияСоСторноЗаписями КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаСторнируемыхДокументов КАК ТаблицаСторнируемыхДокументов
		|		ПО ДанныеДокумента.НомерСтроки = ТаблицаСторнируемыхДокументов.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияРегистра КАК СведенияОДоходах
		|		ПО (ТаблицаСторнируемыхДокументов.СторнируемыйДокумент = СведенияОДоходах.Регистратор)
		|			И ДанныеДокумента.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА СведенияОДоходах.Начисление.КодДоходаСтраховыеВзносы ЕСТЬ NULL
		|					ТОГДА ДанныеДокумента.ВидДохода = СведенияОДоходах.ВидДохода
		|				ИНАЧЕ ДанныеДокумента.Начисление = СведенияОДоходах.Начисление
		|			КОНЕЦ)
		|ГДЕ
		|	(ДанныеДокумента.Сумма <> 0
		|			ИЛИ ДанныеДокумента.Скидка <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияСоСведениямиРегистра.НомерСтроки КАК НомерСтроки,
		|	-НачисленияСоСведениямиРегистра.Сумма КАК СуммаСторнирования,
		|	СУММА(НачисленияСоСведениямиРегистра.СуммаВУчете) КАК СуммаВУчете
		|ПОМЕСТИТЬ ВТНекомпенсированныеСторноНачисления
		|ИЗ
		|	ВТНачисленияСоСведениямиРегистра КАК НачисленияСоСведениямиРегистра
		|ГДЕ
		|	НачисленияСоСведениямиРегистра.ЕстьСторнируемыеДанныеУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияСоСведениямиРегистра.НомерСтроки,
		|	-НачисленияСоСведениямиРегистра.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияСоСведениямиРегистра.НомерСтроки КАК НомерСтроки,
		|	НачисленияСоСведениямиРегистра.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияСоСведениямиРегистра.Сотрудник КАК Сотрудник,
		|	НачисленияСоСведениямиРегистра.Подразделение КАК Подразделение,
		|	НачисленияСоСведениямиРегистра.Начисление КАК Начисление,
		|	НачисленияСоСведениямиРегистра.ДатаНачала КАК ДатаНачала,
		|	НачисленияСоСведениямиРегистра.ВидДохода КАК ВидДохода,
		|	НачисленияСоСведениямиРегистра.Сумма КАК Сумма,
		|	НачисленияСоСведениямиРегистра.Скидка КАК Скидка,
		|	НачисленияСоСведениямиРегистра.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	НачисленияСоСведениямиРегистра.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	НачисленияСоСведениямиРегистра.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	НачисленияСоСведениямиРегистра.КлассУсловийТруда КАК КлассУсловийТруда,
		|	НачисленияСоСведениямиРегистра.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
		|	НачисленияСоСведениямиРегистра.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
		|	НачисленияСоСведениямиРегистра.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	НачисленияСоСведениямиРегистра.ЕстьСторнируемыеДанныеУчета КАК ЕстьСторнируемыеДанныеУчета,
		|	НачисленияСоСведениямиРегистра.СуммаВУчете КАК СуммаВУчете,
		|	НачисленияСоСведениямиРегистра.СкидкаВУчете КАК СкидкаВУчете
		|ИЗ
		|	ВТНачисленияСоСведениямиРегистра КАК НачисленияСоСведениямиРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНекомпенсированныеСторноНачисления КАК СторноНачисления
		|		ПО НачисленияСоСведениямиРегистра.НомерСтроки = СторноНачисления.НомерСтроки
		|ГДЕ
		|	(НЕ НачисленияСоСведениямиРегистра.ЕстьСторнируемыеДанныеУчета
		|			ИЛИ ЕСТЬNULL(СторноНачисления.СуммаСторнирования, 0) <= ЕСТЬNULL(СторноНачисления.СуммаВУчете, 0))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачисленияСоСведениямиРегистра.НомерСтроки,
		|	НачисленияСоСведениямиРегистра.ДатаПолученияДохода УБЫВ";
#Вставка
	Запрос.Текст = ?(ПериодРегистрации <Дата('20250101'),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)"),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","СведенияОДоходах.КлассУсловийТруда"));
#КонецВставки

		ВременнаяТаблица = РегистрыНакопления.СведенияОДоходахСтраховыеВзносы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		ВременнаяТаблица.Колонки.Удалить("Начисление");
		ВременнаяТаблица.Колонки.Добавить("Начисление", Новый ОписаниеТипов(Метаданные.РегистрыНакопления.СведенияОДоходахСтраховыеВзносы.Реквизиты.Начисление.Тип, "СправочникСсылка.ВидыДоходовПоСтраховымВзносам"),);

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			Если Выборка.ЕстьСторнируемыеДанныеУчета Тогда

				СторноВсего = -Выборка.Сумма;
				СторноСкидки = -Выборка.Скидка;

				Пока Выборка.Следующий() Цикл

					Сумма = -Мин(СторноВсего, Выборка.СуммаВУчете);
					СторноВсего = СторноВсего + Сумма;
					Если СторноСкидки = 0 Тогда
						Скидка = 0
					Иначе
						Скидка = -Мин(СторноСкидки, Выборка.СкидкаВУчете);
						СторноСкидки = СторноСкидки + Скидка;
					КонецЕсли;

					Движение = ВременнаяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(Движение,Выборка);

					// ресурсы 
					Движение.Сумма = Сумма;
					Движение.Скидка	= Скидка;

					Если СторноВсего = 0 Тогда
						Прервать;
					КонецЕсли;

				КонецЦикла;

			Иначе

				ЗаполнитьЗначенияСвойств(ВременнаяТаблица.Добавить(), Выборка); // Период, ФизическоеЛицо, ВидДохода, Сумма, Начисление

			КонецЕсли;
		КонецЦикла;

		// Теперь поищем отменяемые начисления по периоду действия.
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СторноНачисления.НомерСтроки
		|ПОМЕСТИТЬ ВТСтрокиСторноПериода
		|ИЗ
		|	ВТНекомпенсированныеСторноНачисления КАК СторноНачисления
		|ГДЕ
		|	СторноНачисления.СуммаСторнирования > СторноНачисления.СуммаВУчете";
		Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда 

			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
			|	ДанныеДокумента.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеДокумента.Сотрудник КАК Сотрудник,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеДокумента.Начисление КАК Начисление,
			|	ДанныеДокумента.ДатаНачала КАК ДатаНачала,
			|	ЕСТЬNULL(СведенияОДоходах.ВидДохода, ДанныеДокумента.ВидДохода) КАК ВидДохода,
			|	ДанныеДокумента.Сумма КАК Сумма,
			|	ДанныеДокумента.Скидка КАК Скидка,
			|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам) КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
			|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам) КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
			|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией, ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
			|	ЕСТЬNULL(СведенияОДоходах.КлассУсловийТруда, ДанныеДокумента.КлассУсловийТруда) КАК КлассУсловийТруда,
			|	ЕСТЬNULL(СведенияОДоходах.ЯвляетсяДоходомФармацевта, ДанныеДокумента.ЯвляетсяДоходомФармацевта) КАК ЯвляетсяДоходомФармацевта,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
			|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
			|			ИНАЧЕ СведенияОДоходах.ЛьготныйТерриториальныйТариф
			|		КОНЕЦ, ДанныеДокумента.ЛьготныйТерриториальныйТариф) КАК ЛьготныйТерриториальныйТариф,
			|	ЕСТЬNULL(СведенияОДоходах.ДатаПолученияДохода, ДанныеДокумента.ДатаПолученияДохода) КАК ДатаПолученияДохода,
			|	СУММА(ЕСТЬNULL(СведенияОДоходах.Сумма, 0)) КАК СуммаВУчете,
			|	СУММА(ЕСТЬNULL(СведенияОДоходах.Скидка, 0)) КАК СкидкаВУчете
			|ИЗ
			|	ВТНачисленияСоСторноЗаписями КАК ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиСторноПериода КАК ТаблицаСторнируемыхСтрок
			|		ПО ДанныеДокумента.НомерСтроки = ТаблицаСторнируемыхСтрок.НомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходах
			|		ПО ДанныеДокумента.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
			|			И ДанныеДокумента.Начисление = СведенияОДоходах.Начисление
			|			И (СведенияОДоходах.Регистратор <> &ИсключаемыйРегистратор)
			|			И (СведенияОДоходах.Организация = &Организация)
			|			И (НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаНачала, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаНачала, МЕСЯЦ))
			|ГДЕ
			|	ТаблицаСторнируемыхСтрок.НомерСтроки ЕСТЬ НЕ NULL 
			|	И (ДанныеДокумента.Сумма <> 0
			|			ИЛИ ДанныеДокумента.Скидка <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеДокумента.НомерСтроки,
			|	ДанныеДокумента.ФизическоеЛицо,
			|	ДанныеДокумента.Сотрудник,
			|	ДанныеДокумента.Подразделение,
			|	ДанныеДокумента.Начисление,
			|	ДанныеДокумента.ДатаНачала,
			|	ДанныеДокумента.Сумма,
			|	ДанныеДокумента.Скидка,
			|	ЕСТЬNULL(СведенияОДоходах.ВидДохода, ДанныеДокумента.ВидДохода),
			|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуЛетчикам),
			|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуШахтерам),
			|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией, ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией),
			|	ЕСТЬNULL(СведенияОДоходах.КлассУсловийТруда, ДанныеДокумента.КлассУсловийТруда),
			|	ЕСТЬNULL(СведенияОДоходах.ЯвляетсяДоходомФармацевта, ДанныеДокумента.ЯвляетсяДоходомФармацевта),
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
			|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
			|			ИНАЧЕ СведенияОДоходах.ЛьготныйТерриториальныйТариф
			|		КОНЕЦ, ДанныеДокумента.ЛьготныйТерриториальныйТариф),
			|	ЕСТЬNULL(СведенияОДоходах.ДатаПолученияДохода, ДанныеДокумента.ДатаПолученияДохода)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки,
			|	ДатаПолученияДохода УБЫВ";

			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
				СторноВсего = -Выборка.Сумма;
				СторноСкидки = -Выборка.Скидка;
				Пока Выборка.Следующий() Цикл

					Сумма = -Мин(СторноВсего, Выборка.СуммаВУчете);
					СторноВсего = СторноВсего + Сумма;
					Если СторноСкидки = 0 Тогда
						Скидка = 0
					Иначе
						Скидка = -Мин(СторноСкидки, Выборка.СкидкаВУчете);
						СторноСкидки = СторноСкидки + Скидка;
					КонецЕсли;

					Движение = ВременнаяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(Движение,Выборка);

					// ресурсы 
					Движение.Сумма = Сумма;
					Движение.Скидка	= Скидка;

					Если СторноВсего = 0 Тогда
						Прервать;
					КонецЕсли;

				КонецЦикла;
			КонецЦикла;

		КонецЕсли;

		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Начисления", ВременнаяТаблица); ВременнаяТаблица = Неопределено;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.ДатаПолученияДохода,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.Подразделение,
		|	Начисления.ДатаНачала,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.Сумма,
		|	Начисления.Скидка,
		|	Начисления.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТВременнаяТаблица
		|ИЗ
		|	&Начисления КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ДатаПолученияДохода,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.Подразделение,
		|	Начисления.ДатаНачала,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.Сумма,
		|	Начисления.Скидка,
		|	Начисления.ФизическоеЛицо,
		|	ИСТИНА КАК РаспределятьЕНВД,
		|	НЕОПРЕДЕЛЕНО КАК ОблагаетсяЕНВД
		|ПОМЕСТИТЬ ВТНачисленияСДаннымиУчета
		|ИЗ
		|	ВТВременнаяТаблица КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВременнаяТаблица";
		Запрос.Выполнить();

	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоходыЗаПериод.ФизическоеЛицо
	|ИЗ
	|	ВТДоходыЗаПериод КАК ДоходыЗаПериод
	|ГДЕ
	|	ДоходыЗаПериод.Результат >= 0";

	Если Не Запрос.Выполнить().Пустой() Тогда // Попробуем скомпенсировать уже имеющиеся сторно-записи прошлых периодов.

		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СтраховыеВзносыСведенияОДоходах.ВидДохода КАК ВидДохода,
		|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
		|	ВЫБОР
		|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
		|		ИНАЧЕ СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф
		|	КОНЕЦ КАК ЛьготныйТерриториальныйТариф,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
		|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
		|	&КлассУсловийТруда КАК КлассУсловийТруда,
#КонецВставки
		|	СУММА(СтраховыеВзносыСведенияОДоходах.Сумма) КАК Сумма,
		|	СУММА(СтраховыеВзносыСведенияОДоходах.Скидка) КАК Скидка,
		|	СтраховыеВзносыСведенияОДоходах.Начисление КАК Начисление,
		|	СтраховыеВзносыСведенияОДоходах.Сотрудник КАК Сотрудник,
		|	СтраховыеВзносыСведенияОДоходах.Подразделение КАК Подразделение,
		|	СтраховыеВзносыСведенияОДоходах.ДатаНачала КАК ДатаНачала,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД
		|ПОМЕСТИТЬ ВТЗаписиЗаПрошлыйПериод
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СтраховыеВзносыСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗаПериод КАК ДоходыЗаПериод
		|		ПО СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо = ДоходыЗаПериод.ФизическоеЛицо
		|			И СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР = ДоходыЗаПериод.ОблагаетсяВзносамиВПФР
		|			И СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам
		|			И СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуШахтерам
		|			И СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
#Удаление
		|			И СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда = ДоходыЗаПериод.КлассУсловийТруда
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
		|			И &КлассУсловийТруда = ДоходыЗаПериод.КлассУсловийТруда
#КонецВставки
		|ГДЕ
		|	СтраховыеВзносыСведенияОДоходах.Регистратор <> &ИсключаемыйРегистратор
		|	И СтраховыеВзносыСведенияОДоходах.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И СтраховыеВзносыСведенияОДоходах.Организация = &Организация
		|	И ДоходыЗаПериод.Результат >= 0
		|	И НЕ СтраховыеВзносыСведенияОДоходах.ПоАктуПроверки
		|	И СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < &Начало
		|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &Начало И &Окончание
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраховыеВзносыСведенияОДоходах.ФизическоеЛицо,
		|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
		|	ВЫБОР
		|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
		|		ИНАЧЕ СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф
		|	КОНЕЦ,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
		|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
		|	&КлассУсловийТруда,
#КонецВставки
		|	СтраховыеВзносыСведенияОДоходах.Начисление,
		|	СтраховыеВзносыСведенияОДоходах.Сотрудник,
		|	СтраховыеВзносыСведенияОДоходах.Подразделение,
		|	СтраховыеВзносыСведенияОДоходах.ДатаНачала,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
		|
		|ИМЕЮЩИЕ
		|	СУММА(СтраховыеВзносыСведенияОДоходах.Сумма) < 0";
#Вставка
		Запрос.Текст = ?(ПериодРегистрации <Дата('20250101'),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)"),СтрЗаменить(Запрос.Текст,"&КлассУсловийТруда","СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда"));
#КонецВставки

		Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда // Компенсировать нечего, сторно-записей ранее не было.
			ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, "ВТЗаписиЗаПрошлыйПериод")
		Иначе 	
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаписиЗаПрошлыйПериод.ФизическоеЛицо,
			|	ЗаписиЗаПрошлыйПериод.ВидДохода,
			|	ЗаписиЗаПрошлыйПериод.ДатаПолученияДохода,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиНаДоплатуШахтерам,
			|	ЗаписиЗаПрошлыйПериод.ЯвляетсяДоходомФармацевта,
			|	ЗаписиЗаПрошлыйПериод.ЛьготныйТерриториальныйТариф,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
			|	ЗаписиЗаПрошлыйПериод.КлассУсловийТруда,
			|	-ЗаписиЗаПрошлыйПериод.Сумма КАК Сумма,
			|	-ЗаписиЗаПрошлыйПериод.Скидка КАК Скидка,
			|	ЗаписиЗаПрошлыйПериод.Начисление,
			|	ЗаписиЗаПрошлыйПериод.Сотрудник,
			|	ЗаписиЗаПрошлыйПериод.Подразделение,
			|	ЗаписиЗаПрошлыйПериод.ДатаНачала,
			|	ЛОЖЬ КАК РаспределятьЕНВД,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяЕНВД
			|ПОМЕСТИТЬ ВТВременная
			|ИЗ
			|	ВТЗаписиЗаПрошлыйПериод КАК ЗаписиЗаПрошлыйПериод
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаписиЗаПрошлыйПериод.ФизическоеЛицо,
			|	ЗаписиЗаПрошлыйПериод.ВидДохода,
			|	&КонецМесяца,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиНаДоплатуЛетчикам,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиНаДоплатуШахтерам,
			|	ЗаписиЗаПрошлыйПериод.ЯвляетсяДоходомФармацевта,
			|	ЗаписиЗаПрошлыйПериод.ЛьготныйТерриториальныйТариф,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
			|	ЗаписиЗаПрошлыйПериод.КлассУсловийТруда,
			|	ЗаписиЗаПрошлыйПериод.Сумма,
			|	ЗаписиЗаПрошлыйПериод.Скидка,
			|	ЗаписиЗаПрошлыйПериод.Начисление,
			|	ЗаписиЗаПрошлыйПериод.Сотрудник,
			|	ЗаписиЗаПрошлыйПериод.Подразделение,
			|	ЗаписиЗаПрошлыйПериод.ДатаНачала,
			|	ЛОЖЬ,
			|	ЗаписиЗаПрошлыйПериод.ОблагаетсяЕНВД
			|ИЗ
			|	ВТЗаписиЗаПрошлыйПериод КАК ЗаписиЗаПрошлыйПериод
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НачисленияСДаннымиУчета.ФизическоеЛицо,
			|	НачисленияСДаннымиУчета.ВидДохода,
			|	НачисленияСДаннымиУчета.ДатаПолученияДохода,
			|	НачисленияСДаннымиУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
			|	НачисленияСДаннымиУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
			|	НачисленияСДаннымиУчета.ЯвляетсяДоходомФармацевта,
			|	НачисленияСДаннымиУчета.ЛьготныйТерриториальныйТариф,
			|	НачисленияСДаннымиУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
			|	НачисленияСДаннымиУчета.КлассУсловийТруда,
			|	НачисленияСДаннымиУчета.Сумма,
			|	НачисленияСДаннымиУчета.Скидка,
			|	НачисленияСДаннымиУчета.Начисление,
			|	НачисленияСДаннымиУчета.Сотрудник,
			|	НачисленияСДаннымиУчета.Подразделение,
			|	НачисленияСДаннымиУчета.ДатаНачала,
			|	НачисленияСДаннымиУчета.РаспределятьЕНВД,
			|	НачисленияСДаннымиУчета.ОблагаетсяЕНВД
			|ИЗ
			|	ВТНачисленияСДаннымиУчета КАК НачисленияСДаннымиУчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТНачисленияСДаннымиУчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Временная.ФизическоеЛицо,
			|	Временная.ВидДохода,
			|	Временная.ДатаПолученияДохода,
			|	Временная.ОблагаетсяВзносамиНаДоплатуЛетчикам,
			|	Временная.ОблагаетсяВзносамиНаДоплатуШахтерам,
			|	Временная.ЯвляетсяДоходомФармацевта,
			|	Временная.ЛьготныйТерриториальныйТариф,
			|	Временная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
			|	Временная.КлассУсловийТруда,
			|	СУММА(Временная.Сумма) КАК Сумма,
			|	СУММА(Временная.Скидка) КАК Скидка,
			|	Временная.Начисление,
			|	Временная.Сотрудник,
			|	Временная.Подразделение,
			|	Временная.ДатаНачала,
			|	Временная.РаспределятьЕНВД,
			|	Временная.ОблагаетсяЕНВД
			|ПОМЕСТИТЬ ВТНачисленияСДаннымиУчета
			|ИЗ
			|	ВТВременная КАК Временная
			|
			|СГРУППИРОВАТЬ ПО
			|	Временная.ФизическоеЛицо,
			|	Временная.ВидДохода,
			|	Временная.ДатаПолученияДохода,
			|	Временная.ОблагаетсяВзносамиНаДоплатуЛетчикам,
			|	Временная.ОблагаетсяВзносамиНаДоплатуШахтерам,
			|	Временная.ЯвляетсяДоходомФармацевта,
			|	Временная.ЛьготныйТерриториальныйТариф,
			|	Временная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
			|	Временная.КлассУсловийТруда,
			|	Временная.Начисление,
			|	Временная.Сотрудник,
			|	Временная.Подразделение,
			|	Временная.ДатаНачала,
			|	Временная.РаспределятьЕНВД,
			|	Временная.ОблагаетсяЕНВД";
			Запрос.Выполнить();

			ТаблицыКУдалению = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВТЗаписиЗаПрошлыйПериод");
			ТаблицыКУдалению.Добавить("ВТВременная");
			ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, ТаблицыКУдалению)

		КонецЕсли;

	КонецЕсли;

	ТаблицыКУдалению = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВТДоходыЗаПериод");
	ТаблицыКУдалению.Добавить("ВТПоложительныеДоходыПоРегистратору");
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, ТаблицыКУдалению)

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьВТСДаннымиУчета")
Процедура ВИЛС_СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц)

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОсобыеУсловияТруда", Новый Структура("Организация",Организация)) Или ПериодРегистрации < УчетСтраховыхВзносовКлиентСервер.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда

		УчетСтраховыхВзносовБазовый.СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СДаннымиУчета.Сотрудник,
		|	СДаннымиУчета.Начисление,
		|	СДаннымиУчета.ДатаНачала,
		|	СДаннымиУчета.Подразделение,
		|	СписокНачислений.УсловияТруда,
		|	СДаннымиУчета.ВидДохода,
		|	СДаннымиУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СДаннымиУчета.ФизическоеЛицо,
		|	СДаннымиУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СДаннымиУчета.ЯвляетсяДоходомФармацевта,
		|	СДаннымиУчета.ЛьготныйТерриториальныйТариф,
		|	СДаннымиУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СДаннымиУчета.КлассУсловийТруда,
		|	СДаннымиУчета.КоэффициентУчетаСтроки
		|ПОМЕСТИТЬ ВТВременнаяТаблица
		|ИЗ
		|	ВТСДаннымиУчета КАК СДаннымиУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК СписокНачислений
		|		ПО СДаннымиУчета.Сотрудник = СписокНачислений.Сотрудник
		|			И СДаннымиУчета.ДатаНачала = СписокНачислений.ДатаНачала
		|			И СДаннымиУчета.Подразделение = СписокНачислений.ПодразделениеОрганизации
		|			И СДаннымиУчета.Начисление = СписокНачислений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСДаннымиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Сотрудник,
		|	ВременнаяТаблица.Начисление,
		|	ВременнаяТаблица.ДатаНачала,
		|	ВременнаяТаблица.Подразделение,
		|	ВременнаяТаблица.УсловияТруда,
		|	ВременнаяТаблица.ВидДохода,
		|	ВременнаяТаблица.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ВременнаяТаблица.ФизическоеЛицо,
		|	ВременнаяТаблица.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ВременнаяТаблица.ЯвляетсяДоходомФармацевта,
		|	ВременнаяТаблица.ЛьготныйТерриториальныйТариф,
		|	ВременнаяТаблица.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ВременнаяТаблица.КлассУсловийТруда,
		|	ВременнаяТаблица.КоэффициентУчетаСтроки
		|ПОМЕСТИТЬ ВТСДаннымиУчета
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВременнаяТаблица";
		Запрос.Выполнить();

		Возврат
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеОСотруднике.Должность,
	|	ДанныеОСотруднике.ДатаНачала КАК Период
	|ПОМЕСТИТЬ ВТДолжности
	|ИЗ
	|	ВТКадровыхДанных КАК ДанныеОСотруднике";
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.Выполнить();

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ВсеЗаписи = Истина;
	УчетСтраховыхВзносов.ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, КонецМесяца(ПериодРегистрации), Ложь);

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
	"КлассыУсловийТрудаПоДолжностям",
	Запрос.МенеджерВременныхТаблиц,
	Ложь,
	ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
	"ВТДолжности",
	"Должность"),
	ПараметрыПостроения);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Начисление,
	|	ДанныеОСотруднике.ЯвляетсяПрокурором,
	|	ДанныеОСотруднике.ЯвляетсяВоеннослужащим,
	|	ДанныеОСотруднике.РаботаетВСтуденческомОтряде
	|ПОМЕСТИТЬ ВТСписокНачислений
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыхДанных КАК ДанныеОСотруднике
	|		ПО СписокНачислений.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И СписокНачислений.ДатаНачала = ДанныеОСотруднике.ДатаНачала
	|			И СписокНачислений.Начисление = ДанныеОСотруднике.Начисление
	|			И СписокНачислений.ПодразделениеОрганизации = ДанныеОСотруднике.Подразделение
	|			И СписокНачислений.УсловияТруда = ДанныеОСотруднике.УсловияТруда";
	Запрос.Выполнить();

	УчетСтраховыхВзносов.СформироватьВТСоответствиеВидовДоходаНачислениям(МенеджерВременныхТаблиц, ПериодРегистрации);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации,
	|	СписокНачислений.УсловияТруда
	|ПОМЕСТИТЬ ВТДляОпределенияДанныхУчета
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ДатаНачала КАК ДатаНачала,
	|	СписокНачислений.ПодразделениеОрганизации КАК Подразделение,
	|	СписокНачислений.УсловияТруда,
	|	ЕСТЬNULL(ВидыДоходаПоНачислениям.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)) КАК ВидДохода,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяЧленомЛетногоЭкипажа, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяШахтером, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяФармацевтом, ЛОЖЬ) КАК ЯвляетсяДоходомФармацевта,
	|	ЕСТЬNULL(ДанныеОСотруднике.ПрименяемыйЛьготныйТерриториальныйТариф, ЛОЖЬ) КАК ЛьготныйТерриториальныйТариф,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяРаботникомСДосрочнойПенсией, ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) КАК КлассУсловийТруда,
	|	ЕСТЬNULL(СУММА(ДанныеОСотруднике.КоэффициентУчетаСтроки), 1) КАК КоэффициентУчетаСтроки
	|ПОМЕСТИТЬ ВТСДаннымиУчета
	|ИЗ
	|	ВТДляОпределенияДанныхУчета КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыхДанных КАК ДанныеОСотруднике
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКлассыУсловийТрудаПоДолжностямСрезПоследних КАК КлассыУсловийТрудаПоДолжностям
	|			ПО ДанныеОСотруднике.Должность = КлассыУсловийТрудаПоДолжностям.Должность
	|				И ДанныеОСотруднике.ДатаНачала = КлассыУсловийТрудаПоДолжностям.Период
#Вставка
// Здесь можно описать новое поведение.      // fix Suetin 07.04.2021 13:02:09   Не будем сединять,КлассУсловийТруда д.б. ПУСТЫМ
	|				И ЛОЖЬ
#КонецВставки
	|		ПО СписокНачислений.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И СписокНачислений.ДатаНачала = ДанныеОСотруднике.ДатаНачала
	|			И СписокНачислений.Начисление = ДанныеОСотруднике.Начисление
	|			И СписокНачислений.ПодразделениеОрганизации = ДанныеОСотруднике.Подразделение
	|			И СписокНачислений.УсловияТруда = ДанныеОСотруднике.УсловияТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДоходаПоНачислениям КАК ВидыДоходаПоНачислениям
	|		ПО СписокНачислений.Начисление = ВидыДоходаПоНачислениям.Начисление
	|			И (ДанныеОСотруднике.ЯвляетсяВоеннослужащим = ВидыДоходаПоНачислениям.ЯвляетсяВоеннослужащим)
	|			И (ДанныеОСотруднике.ЯвляетсяПрокурором = ВидыДоходаПоНачислениям.ЯвляетсяПрокурором)
	|			И (ДанныеОСотруднике.РаботаетВСтуденческомОтряде = ВидыДоходаПоНачислениям.РаботаетВСтуденческомОтряде)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СписокНачислений.Сотрудник = Сотрудники.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОСотруднике.ЯвляетсяЧленомЛетногоЭкипажа,
	|	ДанныеОСотруднике.ЯвляетсяШахтером,
	|	ДанныеОСотруднике.ПрименяемыйЛьготныйТерриториальныйТариф,
	|	ДанныеОСотруднике.ЯвляетсяРаботникомСДосрочнойПенсией,
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации,
	|	СписокНачислений.УсловияТруда,
	|	СписокНачислений.ДатаНачала,
	|	Сотрудники.ФизическоеЛицо,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяФармацевтом, ЛОЖЬ),
	|	ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)),
	|	ЕСТЬNULL(ВидыДоходаПоНачислениям.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСписокНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыДоходаПоНачислениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДляОпределенияДанныхУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДолжности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКлассыУсловийТрудаПоДолжностямСрезПоследних";

	Запрос.Выполнить();

КонецПроцедуры
