	
&ИзменениеИКонтроль("ТекстОтраженияВРеглУчете")	
Функция ВИЛС_ТекстОтраженияВРеглУчете() Экспорт
	А = 0;
#Область ТекстЗапросаНачисленоПоСтатьям
	ТекстЗапросаНачисленоПоСтатьям = "
	// зарплата и взносы на расходы по статьям
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.Сумма) КАК Сумма,
	|	СУММА(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА Строки.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
#Удаление	
	|	Строки.СчетКт КАК СчетКт,
#КонецУдаления
#Вставка
	|	Строки.СчетКт КАК СчетКт,
	//begin fix Клещ А.Н. 21.06.2019  
	|	ВЫБОР КОГДА Строки.СчетКт =  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|       ТОГДА ЕстьNULL(СоответствияФизЛицКонтрагентам.Контрагент,Значение(Справочник.ФизическиеЛица.ПустаяСсылка))
	//end fix Клещ А.Н. 21.06.2019
#КонецВставки	
	|   КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА  Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
#Удаление	
	|	КОНЕЦ КАК СубконтоКт1,
#КонецУдаления
#Вставка
	|	КОНЕЦ КАК СубконтоКт1,
	//begin fix Клещ А.Н. 21.06.2019  Строки.СубконтоКт2 КАК СубконтоКт2,
	|	ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|       ТОГДА ЕстьNULL(СоответствияФизЛицКонтрагентам.Договор,Строки.СубконтоКт2)
	|   ИНАЧЕ
	|       Строки.СубконтоКт2
	|   КОНЕЦ КАК СубконтоКт2,
	//end fix Клещ А.Н. 21.06.2019
#КонецВставки	
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	СУММА(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|			ТОГДА ""Начисление заработной платы""
	|		ИНАЧЕ ""Начисление взносов с заработной платы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО
#Удаление	
	|		ОбъектыСтроительства.Ссылка = Строки.АналитикаРасходов
#КонецУдаления
#Вставка
	|		ОбъектыСтроительства.Ссылка = Строки.АналитикаРасходов
	//begin fix Клещ А.Н. 10.05.2019  
	|       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						  	ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска КАК ЭлементПоиска,
	|                           ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия Как Контрагент,
	|						  	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор
	|						  ИЗ
	|							РегистрСведений.ВИЛС_СоответствияПоРазделамУчета КАК ВИЛС_СоответствияПоРазделамУчета
	|								ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|									ПО ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия = ДоговорыКонтрагентов.Контрагент
	|										И (ВИЛС_СоответствияПоРазделамУчета.РазрезУчета = ЗНАЧЕНИЕ(Справочник.ВИЛС_ИменаРазделовСоответствий.СоответствиеФизЛицаИКонтрагента))
	|
	|						  СГРУППИРОВАТЬ ПО
	|							ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска,
	|                           ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия) КАК СоответствияФизЛицКонтрагентам
	|       ПО  Строки.ФизическоеЛицо = СоответствияФизЛицКонтрагентам.ЭлементПоиска
	//end fix Клещ А.Н. 10.05.2019
#КонецВставки	
	|ГДЕ
	|	Строки.ВидОперации НЕ В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Операция.Организация,
	|	Строки.АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА Строки.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) ТОГДА 
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ,
#Удаление	
	|	Строки.СчетКт,
#КонецУдаления
#Вставка
	|	Строки.СчетКт,
	//begin fix Клещ А.Н. 21.06.2019  
	|	ВЫБОР КОГДА Строки.СчетКт =  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|       ТОГДА ЕстьNULL(СоответствияФизЛицКонтрагентам.Контрагент,Значение(Справочник.ФизическиеЛица.ПустаяСсылка))
	//end fix Клещ А.Н. 21.06.2019
#КонецВставки	
	|   КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
#Удаление	
	|	КОНЕЦ,
#КонецУдаления
#Вставка
	|	КОНЕЦ,
	//begin fix Клещ А.Н. 21.06.2019  Строки.СубконтоКт2 КАК СубконтоКт2,
	|	ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|       ТОГДА ЕстьNULL(СоответствияФизЛицКонтрагентам.Договор,Строки.СубконтоКт2)
	|   ИНАЧЕ
	|       Строки.СубконтоКт2
	|   КОНЕЦ,
	//end fix Клещ А.Н. 21.06.2019
#КонецВставки	
	|	Строки.СтатьяРасходов,
	|	Строки.Подразделение,
	|	Строки.НаправлениеДеятельности,
	|	Строки.СтатьяРасходов,
	|	Строки.Подразделение,
	|	Строки.ТипНалога
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// зарплата и взносы на прочие операции (устаревшее)
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.Сумма) КАК Сумма,
	|	СУММА(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	СУММА(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|			ТОГДА ""Начисление заработной платы""
	|		ИНАЧЕ ""Начисление взносов с заработной платы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации НЕ В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Операция.Организация,
	|	Строки.СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ,
	|	Строки.СубконтоКт2,
	|	Строки.Подразделение,
	|	Строки.Подразделение,
	|	Строки.ТипНалога
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// зарплата и взносы на пассивы
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	СУММА(Строки.Сумма) КАК Сумма,
	|	СУММА(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.АналитикаАктивовПассивов КАК НаправлениеДеятельностиДт,
	|	
	|	Строки.СчетУчета КАК СчетДт,
	|	Строки.Субконто1 КАК СубконтоДт1,
	|	Строки.Субконто2 КАК СубконтоДт2,
	|	Строки.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
#Удаление	
	|	ИНАЧЕ
#КонецУдаления
#Вставка
	|	ИНАЧЕ
	//begin fix Клещ А.Н. 26.06.2019 |  Строки.ФизическоеЛицо 
	|		ЕстьNULL(СоответствияФизЛицКонтрагентам.Контрагент,Строки.ФизическоеЛицо)
	//end fix Клещ А.Н. 26.06.2019
#КонецВставки	
#Удаление	
	|	КОНЕЦ КАК СубконтоКт1,
#КонецУдаления
#Вставка
	|	КОНЕЦ КАК СубконтоКт1,
	//begin fix Клещ А.Н. 26.06.2019 |	Строки.СубконтоКт2 КАК СубконтоКт2, 
	|   ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|		ТОГДА ЕСТЬNULL(СоответствияФизЛицКонтрагентам.Договор, Строки.СубконтоКт2)
	|	ИНАЧЕ 
	|       Строки.СубконтоКт2
	|   КОНЕЦ КАК СубконтоКт2,
	//end fix Клещ А.Н. 26.06.2019
#КонецВставки	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	СУММА(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|			ТОГДА ""Начисление заработной платы""
	|		ИНАЧЕ ""Начисление взносов с заработной платы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
#Удаление	
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
#КонецУдаления
#Вставка
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	//begin fix Клещ А.Н. 10.05.2019  
	|       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						  	ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска КАК ЭлементПоиска,
	|                           ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия Как Контрагент,
	|						  	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор
	|						  ИЗ
	|							РегистрСведений.ВИЛС_СоответствияПоРазделамУчета КАК ВИЛС_СоответствияПоРазделамУчета
	|								ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|									ПО ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия = ДоговорыКонтрагентов.Контрагент
	|										И (ВИЛС_СоответствияПоРазделамУчета.РазрезУчета = ЗНАЧЕНИЕ(Справочник.ВИЛС_ИменаРазделовСоответствий.СоответствиеФизЛицаИКонтрагента))
	|
	|						  СГРУППИРОВАТЬ ПО
	|							ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска,
	|                           ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия) КАК СоответствияФизЛицКонтрагентам
	|       ПО  Строки.ФизическоеЛицо = СоответствияФизЛицКонтрагентам.ЭлементПоиска
	//end fix Клещ А.Н. 10.05.2019
#КонецВставки	
	|
	|ГДЕ
	|	Строки.ВидОперации НЕ В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Операция.Организация,
	|	Строки.АналитикаРасходов,
	|	Строки.СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
#Удаление	
	|	ИНАЧЕ
#КонецУдаления
#Вставка
	|	ИНАЧЕ
	//begin fix Клещ А.Н. 26.06.2019 |  Строки.ФизическоеЛицо 
	|		ЕстьNULL(СоответствияФизЛицКонтрагентам.Контрагент,Строки.ФизическоеЛицо)
	//end fix Клещ А.Н. 26.06.2019
#КонецВставки	
#Удаление	
	|	КОНЕЦ,
#КонецУдаления
#Вставка
	|	КОНЕЦ,
	//begin fix Клещ А.Н. 26.06.2019 |	Строки.СубконтоКт2 КАК СубконтоКт2, 
	|   ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|		ТОГДА ЕСТЬNULL(СоответствияФизЛицКонтрагентам.Договор, Строки.СубконтоКт2)
	|	ИНАЧЕ 
	|       Строки.СубконтоКт2
	|   КОНЕЦ,
	//end fix Клещ А.Н. 26.06.2019,
#КонецВставки	
	|	Строки.СтатьяРасходов,
	|	Строки.Подразделение,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаАктивовПассивов,
	|	Строки.СчетУчета,
	|	Строки.Субконто1,
	|	Строки.Субконто2,
	|	Строки.Субконто3,
	|	Строки.ТипНалога
	|";
	
#КонецОбласти

// Отпуск за счет обязательств и резервов: одинаковое отражение в бухгалтерском и налоговом учетах.
#Область ТекстЗапросаЕжегодныйОтпускОценочныеОбязательстваИРезервы
	ТекстЗапросаЕжегодныйОтпускОценочныеОбязательстваИРезервы = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	
	|	ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам)
	|	КОНЕЦ КАК СчетДт,
	
	|	ЗНАЧЕНИЕ(Справочник.Резервы.РезервЕжегодныхОтпусков) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Отпуск за счет обязательств и резервов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы))
	|";

#КонецОбласти

// Отпуск за счет обязательств: отражение резервов только в БУ, в НУ на счета затрат.
#Область ТекстЗапросаЕжегодныйОтпускОценочныеОбязательства

	ТекстЗапросаЕжегодныйОтпускОценочныеОбязательства = "
	// резервы в БУ
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	
	|	ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам)
	|	КОНЕЦ КАК СчетДт,
	
	|	ЗНАЧЕНИЕ(Справочник.Резервы.РезервЕжегодныхОтпусков) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	
	|	Строки.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет обязательств"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы в НУ по статьям
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА Строки.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.Сумма КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	- Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.Сумма КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	- Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет обязательств"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = Строки.АналитикаРасходов
	|ГДЕ
	|	Строки.ВидОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы в НУ по прочим операциям (устаревшее)
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.Сумма КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	- Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.Сумма КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	- Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет обязательств"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы в НУ на пассивы
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	Строки.СчетУчета КАК СчетДт,
	|	
	|	Строки.Субконто1 КАК СубконтоДт1,
	|	Строки.Субконто2 КАК СубконтоДт2,
	|	Строки.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.Сумма КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	- Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.Сумма КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	- Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет обязательств"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиАктивовПассивов
	|";

#КонецОбласти

// Отпуск за счет резервов: отражение резервов только в НУ, в БУ на счета затрат
#Область ТекстЗапросаЕжегодныйОтпускРезервы
	
	ТекстЗапросаЕжегодныйОтпускРезервы = "
	// резервы в НУ
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	
	|	ВЫБОР КОГДА Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам)
	|	КОНЕЦ КАК СчетДт,
	
	|	ЗНАЧЕНИЕ(Справочник.Резервы.РезервЕжегодныхОтпусков) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.Сумма КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	- Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.Сумма КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	- Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет резервов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|ГДЕ
	|	Строки.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// резервы в НУ по сдельным в БУ
	|ВЫБРАТЬ
	|	Строки.Регистратор КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ) КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ВЫБОР КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка) ТОГДА
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам)
	|	КОНЕЦ КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Резервы.РезервЕжегодныхОтпусков) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	СУММА(Строки.ПостояннаяРазница + Строки.ВременнаяРазница) КАК СуммаНУДт,
	|	- СУММА(Строки.ПостояннаяРазница) КАК СуммаПРДт,
	|	- СУММА(Строки.ВременнаяРазница) КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ВтСчета.СчетУчета КАК СчетКт,
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Строки.ВидПлатежаВГосБюджет
	|	КОНЕЦ КАК СубконтоКт1,
	|
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ВидНачисленияОплатыТруда
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК СубконтоКт2,
	|
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	СУММА(Строки.ПостояннаяРазница + Строки.ВременнаяРазница) КАК СуммаНУКт,
	|	- СУММА(Строки.ПостояннаяРазница) КАК СуммаПРКт,
	|	- СУММА(Строки.ВременнаяРазница) КАК СуммаВРКт,
	|	""Отпуск за счет резервов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК Строки
	|	ПО
	|		ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСчетаУчетаНалоговИВзносов КАК ВтСчета
	|	ПО
	|		Строки.ТипНалога = ВтСчета.ТипНалога
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ), День)
	|	
	|ГДЕ
	|	Строки.ВидОперацииПоЗарплате В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Регистратор,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ),
	|	Строки.Организация,
	|	Строки.Подразделение,
	|	Строки.НаправлениеДеятельности,
	|	Строки.ВидРабот,
	|	Строки.ГруппаПродукции,
	|	Строки.ВидНачисленияОплатыТруда,
	|	ВтСчета.СчетУчета,
	|	Строки.ФизическоеЛицо,
	|	Строки.ВидПлатежаВГосБюджет,
	|	Строки.ТипНалога
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы в БУ по статьям
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА Строки.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет резервов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = Строки.АналитикаРасходов
	|ГДЕ
	|	Строки.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы в БУ по прочим операциям (устаревшее)
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет резервов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы в БУ на пассивы
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	Строки.СчетУчета КАК СчетДт,
	|	
	|	Строки.Субконто1 КАК СубконтоДт1,
	|	Строки.Субконто2 КАК СубконтоДт2,
	|	Строки.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	Строки.Сумма КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетКт КАК СчетКт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам И Строки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоКт1,
	|	Строки.СубконтоКт2 КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	Строки.Сумма КАК СуммаВРКт,
	|	""Отпуск за счет резервов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиАктивовПассивов
	|";
	
#КонецОбласти

#Область ТекстЗапросаНачисленоСдельно
	ТекстЗапросаНачисленоСдельно = "
	// прямые производственные
	|ВЫБРАТЬ
	|	Строки.Регистратор КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ) КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.СуммаРегл) КАК Сумма,
	|	Сумма(Строки.СуммаРегл / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаДт,//ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) 
	|	//ВЫБОР
	|	//КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|	//	ТОГДА СоответствияСпособовОтражения.ЭлементСоответствия.СтатьяРасходов
	|	//	ИНАЧЕ СоответствияСпособовОтражения.ЭлементСоответствия.СтатьяРасходовВзносов
	|   //КОНЕЦ  
	|   НЕОПРЕДЕЛЕНО  КАК АналитикаУчетаДт,//НЕОПРЕДЕЛЕНО ,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР
	|	КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА ЕстьNULL(СоответствияСпособовОтражения.ЭлементСоответствия.СтатьяРасходов,Строки.ВидРабот)
	|		ИНАЧЕ ЕстьNULL(СоответствияСпособовОтражения.ЭлементСоответствия.СтатьяРасходовВзносов,Строки.ВидРабот)
	|   КОНЕЦ КАК СубконтоДт1,//Строки.ВидРабот 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.СдельнаяОплатаТруда) КАК СубконтоДт2,//Строки.Подразделение
	|	Строки.ГруппаПродукции КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Сумма(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУДт,
	|	Сумма(Строки.ПостояннаяРазница) КАК СуммаПРДт,
	|	Сумма(Строки.ВременнаяРазница) КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ВтСчета.СчетУчета КАК СчетКт,
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Строки.ВидПлатежаВГосБюджет
	|	КОНЕЦ КАК СубконтоКт1,
	|
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ВидНачисленияОплатыТруда
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК СубконтоКт2,
	//|   Неопределено КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Сумма(Строки.СуммаРегл) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Сумма(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУКт,
	|	Сумма(Строки.ПостояннаяРазница) КАК СуммаПРКт,
	|	Сумма(Строки.ВременнаяРазница) КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|			ТОГДА ""Начисление сдельной заработной платы""
	|		ИНАЧЕ ""Начисление взносов со сдельной заработной платы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК Строки
	|	ПО
	|		ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСчетаУчетаНалоговИВзносов КАК ВтСчета
	|	ПО
	|		Строки.ТипНалога = ВтСчета.ТипНалога
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ), День)
	//begin fix Клещ А.Н. 10.05.2019
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтражениеЗарплатыВФинансовомУчете.Регистратор КАК Регистратор,
	|			ОтражениеЗарплатыВФинансовомУчете.Организация КАК Организация,
	|			ОтражениеЗарплатыВФинансовомУчете.Подразделение КАК Подразделение,
	|			ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|			ВЫРАЗИТЬ(ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия КАК Справочник.СпособыОтраженияЗарплатыВБухУчете) КАК ЭлементСоответствия
	|		ИЗ
	|			РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК ОтражениеЗарплатыВФинансовомУчете
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносы КАК ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВИЛС_СоответствияПоРазделамУчета КАК ВИЛС_СоответствияПоРазделамУчета
	|					ПО ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска
	|						И (ВИЛС_СоответствияПоРазделамУчета.РазрезУчета = ЗНАЧЕНИЕ(Справочник.ВИЛС_ИменаРазделовСоответствий.ОтражениеЗПВФинУчете))
	|				ПО ОтражениеЗарплатыВФинансовомУчете.Регистратор = ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.Ссылка
	|					И ОтражениеЗарплатыВФинансовомУчете.Подразделение = ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.ПодразделениеПредприятия
	|					И (ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.ОплатаСдельныхРабот)
	|		ГДЕ
	|			ОтражениеЗарплатыВФинансовомУчете.Регистратор В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ДокументыКОтражению.Ссылка
	|					ИЗ
	|						ДокументыКОтражению)
	|			И ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.Ссылка В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ДокументыКОтражению.Ссылка
	|					ИЗ
	|						ДокументыКОтражению)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтражениеЗарплатыВФинансовомУчете.Регистратор,
	|			ОтражениеЗарплатыВФинансовомУчете.Организация,
	|			ОтражениеЗарплатыВФинансовомУчете.Подразделение,
	|			ОтражениеЗарплатыВФинансовомУчетеНачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете,
	|			ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия) КАК СоответствияСпособовОтражения	
	|		ПО (Строки.Регистратор = СоответствияСпособовОтражения.Регистратор)
	|			И (Строки.Подразделение = СоответствияСпособовОтражения.Подразделение)
	//end fix Клещ А.Н. 10.05.2019
	|	
	|ГДЕ
	|	Строки.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Регистратор,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ),
	|	Строки.Организация,
	|	Строки.Подразделение,
	|	Строки.НаправлениеДеятельности,
	|	Строки.ВидРабот,
	|	Строки.ГруппаПродукции,
	|	Строки.ВидНачисленияОплатыТруда,
	|	ВтСчета.СчетУчета,
	|	Строки.ФизическоеЛицо,
	|	Строки.ВидПлатежаВГосБюджет,
	|	Строки.ТипНалога
	|   ,
	|	ВЫБОР
	|	КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|		ТОГДА ЕстьNULL(СоответствияСпособовОтражения.ЭлементСоответствия.СтатьяРасходов,Строки.ВидРабот)
	|		ИНАЧЕ ЕстьNULL(СоответствияСпособовОтражения.ЭлементСоответствия.СтатьяРасходовВзносов,Строки.ВидРабот)
	|   КОНЕЦ 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// на расходы
	|ВЫБРАТЬ
	|	Строки.Регистратор КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ) КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.СуммаРегл) КАК Сумма,
	|	Сумма(Строки.СуммаРегл / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	ВЫБОР 
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|	КОНЕЦ КАК ВидСчетаДт,
	|
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL ТОГДА
	|			Строки.СтатьяРасходов
	|	ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаУчетаДт,
	|
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL ТОГДА
	|			Строки.Подразделение
	|	ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL ТОГДА
	|			Строки.СтатьяРасходов
	|	ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт1,
	|
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL ТОГДА
	|			Строки.АналитикаРасходов
	|	ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт2,
	|
	|	ВЫБОР
	|		КОГДА НЕ СтатьиСтроительства.Ссылка ЕСТЬ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	Сумма(Строки.СуммаРегл) КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ВтСчета.СчетУчета КАК СчетКт,
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Строки.ВидПлатежаВГосБюджет
	|	КОНЕЦ КАК СубконтоКт1,
	|
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ВидНачисленияОплатыТруда
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК СубконтоКт2,
	|
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|			ТОГДА ""Начисление сдельной заработной платы""
	|		ИНАЧЕ ""Начисление взносов со сдельной заработной платы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК Строки
	|	ПО
	|		ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСчетаУчетаНалоговИВзносов КАК ВтСчета
	|	ПО
	|		Строки.ТипНалога = ВтСчета.ТипНалога
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ), День)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаПрочиеАктивы
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаПрочиеАктивы.Ссылка
	|		И СтатьиНаПрочиеАктивы.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = Строки.АналитикаРасходов
	|ГДЕ
	|	Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Регистратор,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ),
	|	Строки.Организация,
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL 
	|			ТОГДА Строки.СтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL 
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL 
	|			ТОГДА Строки.СтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL 
	|			ТОГДА Строки.АналитикаРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ СтатьиСтроительства.Ссылка ЕСТЬ NULL ТОГДА
	|			ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|					ТОГДА ОбъектыСтроительства.СпособСтроительства
	|				ИНАЧЕ 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|			КОНЕЦ
	|		КОГДА СтатьиНаПрочиеАктивы.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВтСчета.СчетУчета,
	|	ВЫБОР
	|		КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|			ТОГДА Строки.ФизическоеЛицо
	|		ИНАЧЕ Строки.ВидПлатежаВГосБюджет
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|			ТОГДА Строки.ВидНачисленияОплатыТруда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	Строки.Подразделение,
	|	Строки.НаправлениеДеятельности,
	|	Строки.ТипНалога
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// на прочие пассивы
	|ВЫБРАТЬ
	|	Строки.Регистратор КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ) КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.СуммаРегл) КАК Сумма,
	|	Сумма(Строки.СуммаРегл / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.АналитикаАктивовПассивов КАК НаправлениеДеятельностиДт,
	|
	|	Строки.СчетУчета КАК СчетДт,
	|
	|	Строки.Субконто1 КАК СубконтоДт1,
	|	Строки.Субконто2 КАК СубконтоДт2,
	|	Строки.Субконто3 КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ВтСчета.СчетУчета КАК СчетКт,
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Строки.ВидПлатежаВГосБюджет
	|	КОНЕЦ КАК СубконтоКт1,
	|
	|	ВЫБОР КОГДА ВтСчета.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) ТОГДА
	|		Строки.ВидНачисленияОплатыТруда
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК СубконтоКт2,
	|
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Сумма(Строки.СуммаРегл) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	ВЫБОР
	|		КОГДА Строки.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|			ТОГДА ""Начисление сдельной заработной платы""
	|		ИНАЧЕ ""Начисление взносов со сдельной заработной платы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК Строки
	|	ПО
	|		ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСчетаУчетаНалоговИВзносов КАК ВтСчета
	|	ПО
	|		Строки.ТипНалога = ВтСчета.ТипНалога
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ), День)
	|	
	|ГДЕ
	|	Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Регистратор,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ),
	|	Строки.Организация,
	|	Строки.Подразделение,
	|	Строки.СчетУчета,
	|	ВтСчета.СчетУчета,
	|	Строки.АналитикаАктивовПассивов,
	|	Строки.Субконто1,
	|	Строки.Субконто2,
	|	Строки.Субконто3,
	|	Строки.ФизическоеЛицо,
	|	Строки.ВидНачисленияОплатыТруда,
	|	Строки.ТипНалога,
	|	Строки.ВидПлатежаВГосБюджет
	|";
#КонецОбласти

#Область ТекстЗапросаНДФЛ
	ТекстЗапросаНДФЛ = "
	// НДФЛ, НФДЛДивидендыСотрудникам
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.Сумма) КАК Сумма,
	|	Сумма(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	ВЫБОР КОГДА Операция.ПроводкиПоРаботникам 
	|		ТОГДА Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДФЛ"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (Значение(Перечисление.ВидыОперацийПоЗарплате.НДФЛ),
	|		Значение(Перечисление.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам))
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Строки.РегистрацияВНалоговомОргане,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.ПроводкиПоРаботникам
	|			ТОГДА Строки.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Строки.ПодразделениеПредприятия,
	|	Строки.ПодразделениеПредприятия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// НДФЛДоходыКонтрагентов
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.Сумма) КАК Сумма,
	|	Сумма(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами) КАК СчетДт,
	|	
	//begin fix Клещ А.Н. 21.06.2019  НЕОПРЕДЕЛЕНО КАК СубконтоДт1,КАК СубконтоДт2,
	|	ЕстьNULL(СоответствияФизЛицКонтрагентам.Контрагент,НЕОПРЕДЕЛЕНО)  КАК СубконтоДт1,
	|	ЕстьNULL(СоответствияФизЛицКонтрагентам.Договор,НЕОПРЕДЕЛЕНО) КАК СубконтоДт2,
	//end fix Клещ А.Н. 21.06.2019	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДФЛ (доходы контрагентов)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	//begin fix Клещ А.Н. 23.06.2019  
	|       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						  	ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска КАК ЭлементПоиска,
	|                           ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия Как Контрагент,
	|						  	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор
	|						  ИЗ
	|							РегистрСведений.ВИЛС_СоответствияПоРазделамУчета КАК ВИЛС_СоответствияПоРазделамУчета
	|								ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|									ПО ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия = ДоговорыКонтрагентов.Контрагент
	|										И (ВИЛС_СоответствияПоРазделамУчета.РазрезУчета = ЗНАЧЕНИЕ(Справочник.ВИЛС_ИменаРазделовСоответствий.СоответствиеФизЛицаИКонтрагента))
	|
	|						  СГРУППИРОВАТЬ ПО
	|							ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска,
	|                           ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия) КАК СоответствияФизЛицКонтрагентам
	|       ПО  Строки.ФизическоеЛицо = СоответствияФизЛицКонтрагентам.ЭлементПоиска
	//end fix Клещ А.Н. 23.06.2019
	|
	|ГДЕ
	|	Строки.ВидОперации В (Значение(Перечисление.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов),
	|		Значение(Перечисление.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками))
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Строки.РегистрацияВНалоговомОргане,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.ПроводкиПоРаботникам
	|			ТОГДА Строки.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Строки.ПодразделениеПредприятия,
	|	Строки.ПодразделениеПредприятия,
	//begin fix Клещ А.Н. 21.06.2019  НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	ЕстьNULL(СоответствияФизЛицКонтрагентам.Контрагент,НЕОПРЕДЕЛЕНО),
	|	ЕстьNULL(СоответствияФизЛицКонтрагентам.Договор,НЕОПРЕДЕЛЕНО)
	//end fix Клещ А.Н. 21.06.2019
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// НДФЛПередачаЗадолженностиВНалоговыйОрган
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	-Сумма(Строки.Сумма) КАК Сумма,
	|	-Сумма(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	ВЫБОР КОГДА Операция.ПроводкиПоРаботникам 
	|		ТОГДА Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	-Сумма(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДФЛ (передача задолженности в налоговый орган)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации = Значение(Перечисление.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган)
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Строки.РегистрацияВНалоговомОргане,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.ПроводкиПоРаботникам
	|			ТОГДА Строки.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Строки.ПодразделениеПредприятия,
	|	Строки.ПодразделениеПредприятия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// НДФЛПрочиеРасчетыСПерсоналом
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.Сумма) КАК Сумма,
	|	Сумма(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоПрочимОперациям) КАК СчетДт,
	|	Строки.ФизическоеЛицо КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДФЛ (прочие расчеты с персоналом)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации = Значение(Перечисление.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом)
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Строки.РегистрацияВНалоговомОргане,
	|	Операция.Организация,
	|	Строки.ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Строки.ПодразделениеПредприятия,
	|	Строки.ПодразделениеПредприятия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// НДФЛДоначисленныйПоРезультатамПроверки
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Сумма(Строки.Сумма) КАК Сумма,
	|	Сумма(Строки.Сумма / КурсВалютыУпрУчета.Курс) КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	ВЫБОР КОГДА Операция.ПроводкиПоРаботникам 
	|		ТОГДА Строки.ФизическоеЛицо
	|	ИНАЧЕ
	|		Значение(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Сумма(Строки.Сумма) КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДФЛ (доначисленный по результатам проверки)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации = Значение(Перечисление.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки)
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Строки.РегистрацияВНалоговомОргане,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.ПроводкиПоРаботникам
	|			ТОГДА Строки.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Строки.ПодразделениеПредприятия,
	|	Строки.ПодразделениеПредприятия
	|";
#КонецОбласти

#Область ТекстЗапросаУдержания
	ТекстЗапросаУдержания = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетУчета КАК СчетКт,
	|	Строки.Субконто1 КАК СубконтоКт1,
	|	Строки.Субконто2 КАК СубконтоКт2,
	|	Строки.Субконто3 КАК СубконтоКт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	Строки.ВидОперации КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.УдержаннаяЗарплата КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации НЕ В (Значение(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Возврат излишне выплаченных суммы вследствие счетных ошибок
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	&ВалютаРеглУчета КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	ВЫБОР КОГДА НЕ Операция.ПроводкиПоРаботникам ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		Строки.ФизическоеЛицо
	|	КОНЕЦ КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	Строки.СтатьяДоходов КАК АналитикаУчетаКт,
	|	Строки.ПодразделениеПредприятия КАК МестоУчетаКт,
	|
	|	&ВалютаРеглУчета КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	Строки.Сумма  КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Возврат излишне выплаченных суммы вследствие счетных ошибок"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.УдержаннаяЗарплата КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|
	|ГДЕ
	|	Строки.ВидОперации В (Значение(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок))
	|";
	
#КонецОбласти
	
#Область ТекстЗапросаНачисленныеПроцентыПоЗаймам
	
	ТекстЗапросаНачисленныеПроцентыПоЗаймам = "
	// Начисленные проценты по займам
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.Сумма / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	Строки.Сумма КАК ВалютаДт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоПредоставленнымЗаймам) КАК СчетДт,
	|	Строки.ФизическоеЛицо КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	Строки.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	Строки.СтатьяДоходов КАК АналитикаУчетаКт,
	|	Строки.ПодразделениеПредприятия КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.ПодразделениеПредприятия КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисленные проценты по займам"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныеПроцентыПоЗаймам КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ), День)
	|";
	
#КонецОбласти
	
	ТекстыОтражения = Новый Массив;
	ТекстыОтражения.Добавить(ТекстЗапросаНачисленоПостатьям);
	ТекстыОтражения.Добавить(ТекстЗапросаЕжегодныйОтпускОценочныеОбязательстваИРезервы);
	ТекстыОтражения.Добавить(ТекстЗапросаЕжегодныйОтпускРезервы);
	ТекстыОтражения.Добавить(ТекстЗапросаЕжегодныйОтпускОценочныеОбязательства);
	ТекстыОтражения.Добавить(ТекстЗапросаНачисленоСдельно);
	ТекстыОтражения.Добавить(ТекстЗапросаНДФЛ);
	ТекстыОтражения.Добавить(ТекстЗапросаУдержания);
	ТекстыОтражения.Добавить(ТекстЗапросаНачисленныеПроцентыПоЗаймам);
	
	Возврат СтрСоединить(ТекстыОтражения, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
КонецФункции

&Вместо("ТекстЗапросаТаблицаНачисленнаяЗарплатаИВзносы")
Процедура ВИЛС_ТекстЗапросаТаблицаНачисленнаяЗарплатаИВзносы(Запрос, ТекстыЗапроса)
	
#Область ВтТаблицаДанныхСпособовОтражения
	
	ИмяРегистра = "ВтТаблицаДанныхСпособовОтражения";
	
	ТекстЗапросаВтТаблицаДанныхСпособовОтражения = Справочники.СпособыОтраженияЗарплатыВБухУчете.ТекстЗапросаДанныхСпособов("ВтТаблицаДанныхСпособовОтражения");
	
	ТекстыЗапроса.Добавить(ТекстЗапросаВтТаблицаДанныхСпособовОтражения, ИмяРегистра);
	
#КонецОбласти
	
#Область ВТТаблицаДокумента
	
	ИмяРегистра = "ВТТаблицаДокумента";
	ТекстЗапросаВТТаблицаДокумента =
	"ВЫБРАТЬ
	|	ЗарплатаСводно.Ссылка КАК Ссылка,
	|	ЗарплатаСводно.Ссылка.Организация КАК Организация,
	|	ЗарплатаСводно.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаСводно.ПодразделениеПредприятия КАК Подразделение,
	|	ЗарплатаСводно.ВидОперации КАК ВидОперации,
	|	ЗарплатаСводно.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ЗарплатаСводно.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ВЫБОР
	|		КОГДА ЗарплатаСводно.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НатуральныйДоход)
	|			ТОГДА 0
	|		ИНАЧЕ ЗарплатаСводно.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ЗарплатаСводно.ПФРСтраховая КАК ПФРСтраховая,
	|	ЗарплатаСводно.ПФРНакопительная КАК ПФРНакопительная,
	|	ЗарплатаСводно.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
	|	ЗарплатаСводно.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
	|	ЗарплатаСводно.ПФРСПревышения КАК ПФРСПревышения,
	|	ЗарплатаСводно.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
	|	ЗарплатаСводно.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
	|	ЗарплатаСводно.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ЗарплатаСводно.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ЗарплатаСводно.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
	|	ЗарплатаСводно.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
	|	ЗарплатаСводно.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
	|	ЗарплатаСводно.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
	|	ЗарплатаСводно.ФСС КАК ФСС,
	|	ЗарплатаСводно.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	ЗарплатаСводно.ФФОМС КАК ФФОМС,
	|	ЗарплатаСводно.ТФОМС КАК ТФОМС,
	|	ЗарплатаСводно.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗарплатаСводно.ВзносыВсего
	|ПОМЕСТИТЬ ВТТаблицаДокумента
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносы КАК ЗарплатаСводно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО ЗарплатаСводно.Ссылка = ДокументыКОтражению.Ссылка
	|ГДЕ
	|	ЗарплатаСводно.Ссылка.Сводно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаДетально.Ссылка,
	|	ЗарплатаДетально.Ссылка.Организация КАК Организация,
	|	ЗарплатаДетально.НомерСтроки,
	|	ЗарплатаДетально.ПодразделениеПредприятия,
	|	ЗарплатаДетально.ВидОперации,
	|	ЗарплатаДетально.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ЗарплатаДетально.СпособОтраженияЗарплатыВБухучете,
	|	СУММА(ВЫБОР
	|		КОГДА ЗарплатаДетально.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НатуральныйДоход)
	|			ТОГДА 0
	|		ИНАЧЕ ЗарплатаДетально.Сумма
	|	КОНЕЦ),
	|	СУММА(ЗарплатаДетально.ПФРСтраховая),
	|	СУММА(ЗарплатаДетально.ПФРНакопительная),
	|	СУММА(ЗарплатаДетально.ПФРПоСуммарномуТарифу),
	|	СУММА(ЗарплатаДетально.ПФРДоПредельнойВеличины),
	|	СУММА(ЗарплатаДетально.ПФРСПревышения),
	|	СУММА(ЗарплатаДетально.ПФРНаДоплатуЛетчикам),
	|	СУММА(ЗарплатаДетально.ПФРНаДоплатуШахтерам),
	|	СУММА(ЗарплатаДетально.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах),
	|	СУММА(ЗарплатаДетально.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах),
	|	СУММА(ЗарплатаДетально.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки),
	|	СУММА(ЗарплатаДетально.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка),
	|	СУММА(ЗарплатаДетально.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки),
	|	СУММА(ЗарплатаДетально.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка),
	|	СУММА(ЗарплатаДетально.ФСС),
	|	СУММА(ЗарплатаДетально.ФССНесчастныеСлучаи),
	|	СУММА(ЗарплатаДетально.ФФОМС),
	|	СУММА(ЗарплатаДетально.ТФОМС),
	|	ЗарплатаДетально.ВидНачисленияОплатыТрудаДляНУ,
	|	ЗарплатаДетально.ФизическоеЛицо,
	|	СУММА(ЗарплатаДетально.ВзносыВсего)
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносыПоФизлицам КАК ЗарплатаДетально
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО ЗарплатаДетально.Ссылка = ДокументыКОтражению.Ссылка
	|ГДЕ
	|	НЕ ЗарплатаДетально.Ссылка.Сводно
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ЗарплатаДетально.Ссылка,
	|	ЗарплатаДетально.Ссылка.Организация,
	|	ЗарплатаДетально.НомерСтроки,
	|	ЗарплатаДетально.ПодразделениеПредприятия,
	|	ЗарплатаДетально.ВидОперации,
	|	ЗарплатаДетально.ОблагаетсяЕНВД,
	|	ЗарплатаДетально.СпособОтраженияЗарплатыВБухучете,
	|	ЗарплатаДетально.ВидНачисленияОплатыТрудаДляНУ,
	|	ЗарплатаДетально.ФизическоеЛицо";
	
	ТекстыЗапроса.Добавить(ТекстЗапросаВТТаблицаДокумента, ИмяРегистра);
	
#КонецОбласти
	
#Область ТаблицаДокумента
	
	ИмяРегистра = "ТаблицаДокумента";
	ТекстЗапросаТаблицаДокумента =
	// сумма оплаты труда
	"ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка КАК Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки КАК НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение КАК Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ) КАК ОплатаСдельныхРабот,
	|	СтатьиРасходов.СтатьяРасходов КАК СтатьяРасходов,
	|	СтатьиРасходов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивов
	|	КОНЕЦ КАК АналитикаАктивовПассивов,
	|	СтатьиРасходов.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	СтатьиРасходов.Субконто2 КАК Субконто2,
	|	СтатьиРасходов.Субконто3 КАК Субконто3,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
	//begin fix Клещ А.Н. 10.05.2019 ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) 
	|			ТОГДА ЕстьNULL(НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	//end fix Клещ А.Н. 10.05.2019
	|		ИНАЧЕ НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|		КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПрочиеРасчетыСПерсоналом)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоПрочимОперациям)
	|		КОГДА НачисленнаяЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|	КОНЕЦ КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка) КАК ТипНалога,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ПустаяСсылка) КАК ВидПлатежаВГосБюджет 
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРСтраховаяЧасть
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРСтраховая,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_страх),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРСтраховаяЧасть),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРНакопительнаяЧасть
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРНакопительная,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_нак),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРНакопительнаяЧасть),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРПоСуммарномуТарифу
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРПоСуммарномуТарифу,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРПоСуммарномуТарифу),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРДоПредельнойВеличины
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРДоПредельнойВеличины,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДоПредельнойВеличины),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРСПревышения
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРСПревышения)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРСПревышения)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРСПревышения,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРСПревышения),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРДополнительныйТарифЛЭ
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРНаДоплатуЛетчикам,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДополнительныйТарифЛЭ),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРДополнительныйТарифШахтеры
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРНаДоплатуШахтерам,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_шахтеры),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДополнительныйТарифШахтеры),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРЗаЗанятыхНаПодземныхИВредныхРаботах со спец. оценкой
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах + НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах со спец. оценкой
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРЗаЗанятыхНаПодземныхИВредныхРаботах без спец. оценки
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ВзносыБезСпецоценки) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах без спец. оценки
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ВзносыБезСпецоценки) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ФСС
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ФСС)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ФСС)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФСС,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФСС),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ФССНС
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ)
	|		И СтатьиРасходов.РежимУчетаВзносовНаТравматизм <> 1,
	|	СтатьиРасходов.СтатьяРасходовТравматизм,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовТравматизм = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовТравматизм = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовТравматизм = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ФССНС)
	|		КОГДА СтатьиРасходов.АналитикаРасходовТравматизм = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовТравматизм
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовТравматизм = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовТравматизм = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовТравматизм = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ФССНС)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовТравматизм = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовТравматизм
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Травматизм = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Травматизм
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Травматизм,
	|	СтатьиРасходов.Субконто3Травматизм,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФССНесчастныеСлучаи,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФССНС),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ФФОМС
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ФФОМС)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ФФОМС)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФФОМС,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФФОМС),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФФОМС),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ТФОМС
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.НомерСтроки,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЕСТЬNULL(СтатьиРасходов.ОплатаСдельныхРабот, ЛОЖЬ),
	|	СтатьиРасходов.СтатьяРасходовВзносов,
	|	СтатьиРасходов.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ТФОМС)
	|		КОГДА СтатьиРасходов.АналитикаРасходовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаРасходовВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ТФОМС)
	|		КОГДА СтатьиРасходов.АналитикаАктивовПассивовВзносов = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.Организация
	|		ИНАЧЕ СтатьиРасходов.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ,
	|	СтатьиРасходов.СчетУчетаВзносов,
	|	ВЫБОР
	|		КОГДА СтатьиРасходов.Субконто1Взносов = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	|		ИНАЧЕ СтатьиРасходов.Субконто1Взносов
	|	КОНЕЦ,
	|	СтатьиРасходов.Субконто2Взносов,
	|	СтатьиРасходов.Субконто3Взносов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ТФОМС,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТФОМС),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ТФОМС),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК ВидПлатежаВГосБюджет
	|ИЗ
	|	ВТТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаДанныхСпособовОтражения КАК СтатьиРасходов
	|		ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтатьиРасходов.СпособОтражения
	|			И (НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = СтатьиРасходов.ОблагаетсяЕНВД)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаДокумента, ИмяРегистра);
	
#КонецОбласти
	
#Область ВТНачисленнаяЗарплатаИВзносы
	
	ИмяРегистра = "ВТНачисленнаяЗарплатаИВзносы";
	ТекстЗапросаВТНачисленнаяЗарплатаИВзносы =
	"ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	МИНИМУМ(НачисленнаяЗарплатаИВзносы.НомерСтроки),
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.НаправлениеДеятельности,
	|	НачисленнаяЗарплатаИВзносы.АналитикаРасходов,
	|	НачисленнаяЗарплатаИВзносы.АналитикаАктивовПассивов,
	|	НачисленнаяЗарплатаИВзносы.СчетУчета,
	|	НачисленнаяЗарплатаИВзносы.Субконто1,
	|	НачисленнаяЗарплатаИВзносы.Субконто2,
	|	НачисленнаяЗарплатаИВзносы.Субконто3,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) КАК Сумма,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл
	|ПОМЕСТИТЬ ВТНачисленнаяЗарплатаИВзносы
	|ИЗ
	|	ТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|
	|ГДЕ
	|	НачисленнаяЗарплатаИВзносы.ВидОперации НЕ В(
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы))
	|	И НЕ НачисленнаяЗарплатаИВзносы.ОплатаСдельныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.АналитикаРасходов,
	|	НачисленнаяЗарплатаИВзносы.АналитикаАктивовПассивов,
	|	НачисленнаяЗарплатаИВзносы.СчетУчета,
	|	НачисленнаяЗарплатаИВзносы.Субконто1,
	|	НачисленнаяЗарплатаИВзносы.Субконто2,
	|	НачисленнаяЗарплатаИВзносы.Субконто3,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.НаправлениеДеятельности,
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|
	|ИМЕЮЩИЕ
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// отпуска за счет обязательств и резервов
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	МИНИМУМ(НачисленнаяЗарплатаИВзносы.НомерСтроки),
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.НаправлениеДеятельности,
	|	НачисленнаяЗарплатаИВзносы.АналитикаРасходов,
	|	НачисленнаяЗарплатаИВзносы.АналитикаАктивовПассивов,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям),
	|	ЗНАЧЕНИЕ(Справочник.Резервы.РезервЕжегодныхОтпусков),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма),
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|ИЗ
	|	ТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|
	|ГДЕ
	|	НачисленнаяЗарплатаИВзносы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы))
	|	И НачисленнаяЗарплатаИВзносы.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|	И НЕ НачисленнаяЗарплатаИВзносы.ОплатаСдельныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.НаправлениеДеятельности,
	|	НачисленнаяЗарплатаИВзносы.АналитикаРасходов,
	|	НачисленнаяЗарплатаИВзносы.АналитикаАктивовПассивов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|
	|ИМЕЮЩИЕ
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// взносы за счет обязательств и резервов
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	МИНИМУМ(НачисленнаяЗарплатаИВзносы.НомерСтроки),
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.НаправлениеДеятельности,
	|	НачисленнаяЗарплатаИВзносы.АналитикаРасходов,
	|	НачисленнаяЗарплатаИВзносы.АналитикаАктивовПассивов,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам),
	|	ЗНАЧЕНИЕ(Справочник.Резервы.РезервЕжегодныхОтпусков),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма),
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|ИЗ
	|	ТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|
	|ГДЕ
	|	НачисленнаяЗарплатаИВзносы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы))
	|	И НачисленнаяЗарплатаИВзносы.ТипНалога <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|	И НЕ НачисленнаяЗарплатаИВзносы.ОплатаСдельныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.НаправлениеДеятельности,
	|	НачисленнаяЗарплатаИВзносы.АналитикаРасходов,
	|	НачисленнаяЗарплатаИВзносы.АналитикаАктивовПассивов,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|
	|ИМЕЮЩИЕ
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы по страхованию ФСС
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	МИНИМУМ(НачисленнаяЗарплатаИВзносы.НомерСтроки),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФСС),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма),
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|
	|ГДЕ
	|	НачисленнаяЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС)
	|	И НЕ НачисленнаяЗарплатаИВзносы.ОплатаСдельныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет
	|
	|ИМЕЮЩИЕ
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// расходы по страхованию ФСС НС
	|ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	МИНИМУМ(НачисленнаяЗарплатаИВзносы.НомерСтроки),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФССНС),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма),
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ТаблицаДокумента КАК НачисленнаяЗарплатаИВзносы
	|
	|ГДЕ
	|	НачисленнаяЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС)
	|	И НЕ НачисленнаяЗарплатаИВзносы.ОплатаСдельныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяЗарплатаИВзносы.Ссылка,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.СчетКт,
	|	НачисленнаяЗарплатаИВзносы.ТипНалога,
	|	НачисленнаяЗарплатаИВзносы.ВидПлатежаВГосБюджет
	|
	|ИМЕЮЩИЕ
	|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапросаВТНачисленнаяЗарплатаИВзносы, ИмяРегистра);
	
#КонецОбласти
	
КонецПроцедуры

&Вместо("ЗаполнитьПодразделениеПредприятияНачисленоСдельно")
Процедура ВИЛС_ЗаполнитьПодразделениеПредприятияНачисленоСдельно(НачисленнаяЗарплатаИВзносы, СтруктураПараметров)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТрудозатратыНЗП.Подразделение КАК ПодразделениеПредприятия,
	|	ТрудозатратыНЗП.Сотрудник КАК ФизическоеЛицо,
	|	СУММА(ТрудозатратыНЗП.НормативнаяСтоимость) КАК НормативнаяСтоимость
	|ПОМЕСТИТЬ ВТБазаРаспределения
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНЗП
	|ГДЕ
	|	ТрудозатратыНЗП.Регистратор ССЫЛКА Документ.ВыработкаСотрудников
	|	И ТрудозатратыНЗП.Сотрудник В(&СписокФизическихЛиц)
	|	И ТрудозатратыНЗП.Организация = &Организация
	|	И ТрудозатратыНЗП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыНЗП.Подразделение,
	|	ТрудозатратыНЗП.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выработка.Подразделение,
	|	ТЧСотрудники.Работник,
	|	СУММА(ТЧСотрудники.Сумма)
	|ИЗ
	|	Документ.ВыработкаСотрудников.Работники КАК ТЧСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыработкаСотрудников КАК Выработка
	|		ПО ТЧСотрудники.Ссылка = Выработка.Ссылка
	|ГДЕ
	|	ТЧСотрудники.Работник В(&СписокФизическихЛиц)
	|	И Выработка.Проведен
	|	И Выработка.Организация = &Организация
	|	И Выработка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выработка.ВидНаряда В (ЗНАЧЕНИЕ(Перечисление.ВидыБригадныхНарядов.Ремонт), ЗНАЧЕНИЕ(Перечисление.ВидыБригадныхНарядов.ПрочиеРаботы)) 
	|	И Выработка.Автораспределение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧСотрудники.Работник,
	|	Выработка.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выработка.Подразделение,
	|	ТЧСотрудники.Работник,
	|	СУММА(ТЧСотрудники.Сумма)
	|ИЗ
	|	Документ.ВыработкаСотрудников.ВидыРабот КАК ТЧСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыработкаСотрудников КАК Выработка
	|		ПО ТЧСотрудники.Ссылка = Выработка.Ссылка
	|ГДЕ
	|	ТЧСотрудники.Работник В(&СписокФизическихЛиц)
	|	И Выработка.Проведен
	|	И Выработка.Организация = &Организация
	|	И Выработка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выработка.ВидНаряда В (ЗНАЧЕНИЕ(Перечисление.ВидыБригадныхНарядов.Ремонт), ЗНАЧЕНИЕ(Перечисление.ВидыБригадныхНарядов.ПрочиеРаботы))
	|	И НЕ Выработка.Автораспределение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧСотрудники.Работник,
	|	Выработка.Подразделение
	//begin fix Клещ А.Н. 10.05.2019  
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Подразделение,
	|	Т.ФизическоеЛицо,
	|	СУММА(Т.Сумма)
	|ИЗ
	|	(ВЫБРАТЬ
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
	|		ПлановыеНачисленияПоДоговорам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		МАКСИМУМ(ПлановыеНачисленияПоДоговорам.Сумма) КАК Сумма,
	|		ПлановыеНачисленияПоДоговорам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрСведений.ПлановыеНачисленияПоДоговорам КАК ПлановыеНачисленияПоДоговорам
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|			ПО ПлановыеНачисленияПоДоговорам.Подразделение = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция.Подразделение
	|	ГДЕ
	|		ПлановыеНачисленияПоДоговорам.МесяцНачисления МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПлановыеНачисленияПоДоговорам.ФизическоеЛицо В(&СписокФизическихЛиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение,
	|		ПлановыеНачисленияПоДоговорам.ФизическоеЛицо,
	|		ПлановыеНачисленияПоДоговорам.Регистратор) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Подразделение,
	|	Т.ФизическоеЛицо
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Подразделение,
	|	Т.ФизическоеЛицо,
	|	СУММА(Т.Сумма)
	|ИЗ
	|	(ВЫБРАТЬ
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
	|		ДанныеПоБывшимРаботникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		МАКСИМУМ(ДанныеПоБывшимРаботникам.Сумма) КАК Сумма,
	|		ДанныеПоБывшимРаботникам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК ДанныеПоБывшимРаботникам
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|			ПО ДанныеПоБывшимРаботникам.Подразделение = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция.Подразделение
	|	ГДЕ
	|		ДанныеПоБывшимРаботникам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеПоБывшимРаботникам.ФизическоеЛицо В(&СписокФизическихЛиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение,
	|		ДанныеПоБывшимРаботникам.ФизическоеЛицо,
	|		ДанныеПоБывшимРаботникам.Регистратор) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Подразделение,
	|	Т.ФизическоеЛицо
	|;
	//end fix Клещ А.Н. 10.05.2019
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБазаРаспределения.ПодразделениеПредприятия,
	|	СУММА(ВТБазаРаспределения.НормативнаяСтоимость) КАК Коэффициент,
	|	ВТБазаРаспределения.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	ВТБазаРаспределения КАК ВТБазаРаспределения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТБазаРаспределения.ПодразделениеПредприятия,
	|	ВТБазаРаспределения.ФизическоеЛицо
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;");
	
	СписокФизическихЛиц = НачисленнаяЗарплатаИВзносы.ВыгрузитьКолонку("ФизическоеЛицо");
	СписокСпособов = НачисленнаяЗарплатаИВзносы.ВыгрузитьКолонку("СпособОтраженияЗарплатыВБухучете");
	ОплатаСдельныхРабот = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокСпособов, "ОплатаСдельныхРабот");
	
	Запрос.УстановитьПараметр("СписокФизическихЛиц",    СписокФизическихЛиц);
	Запрос.УстановитьПараметр("НачалоПериода",          НачалоМесяца(СтруктураПараметров.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода",           КонецМесяца(СтруктураПараметров.ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация",            СтруктураПараметров.Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ПодразделенияСдельщиков = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Колонки = "Сумма, " + КолонкиДляСуммирования();
	МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Колонки,,,Истина);
	
	ТаблицаДополнения = НачисленнаяЗарплатаИВзносы.СкопироватьКолонки();
	
	МассивУдаляемыхСтрок = Новый Массив;
	
	Для Каждого Строка Из НачисленнаяЗарплатаИВзносы Цикл
		
		Если ЗначениеЗаполнено(Строка.СпособОтраженияЗарплатыВБухучете) Тогда
			Если не НачисленнаяЗарплатаИВзносы.Колонки.Найти("Начисление") = Неопределено Тогда
				НачисленоСдельно = ОплатаСдельныхРабот[Строка.СпособОтраженияЗарплатыВБухучете] 
				или Строка.Начисление = Перечисления.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги
				или ТипЗнч(Строка.Начисление) = Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам")
				или Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоговорАвторскогоЗаказа;
				
			Иначе
				НачисленоСдельно = ОплатаСдельныхРабот[Строка.СпособОтраженияЗарплатыВБухучете] 
				или Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоговорАвторскогоЗаказа;   
			КонецЕсли;

		Иначе
			НачисленоСдельно = Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоСдельноДоход;
		КонецЕсли;
		
		Если Не НачисленоСдельно Тогда
			Продолжить;
		КонецЕсли;
		
		ПодразделенияСдельщиков.Сбросить();
		ПодразделенияСдельщиков.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо");
		Выборка = ПодразделенияСдельщиков.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			Продолжить;
		ИначеЕсли Выборка.Количество() = 1 Тогда
			
			Выборка.Следующий();
			Строка.ПодразделениеПредприятия = Выборка.ПодразделениеПредприятия;
			
			Продолжить;
		КонецЕсли;
		
		МассивКоэффициентов = Новый Массив;
		МассивПодразделений = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			МассивКоэффициентов.Добавить(Выборка.Коэффициент);
			МассивПодразделений.Добавить(Выборка.ПодразделениеПредприятия);
		КонецЦикла;
		
		МассивыРаспределений = Новый Структура();
		
		Для Каждого Колонка Из МассивКолонок Цикл
			
			Если Строка[Колонка] = 0 Тогда
				РезультатРаспределения = Новый Массив;
				Для Каждого Коэффициент Из МассивКоэффициентов Цикл
					РезультатРаспределения.Добавить(0);
				КонецЦикла;
			Иначе
				РезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Строка[Колонка], МассивКоэффициентов);
			КонецЕсли;
			
			МассивыРаспределений.Вставить(Колонка, РезультатРаспределения);
			
		КонецЦикла;
		
		Индекс = 0;
		
		Для Каждого Коэффициент Из МассивКоэффициентов Цикл
			
			НоваяСтрока = ТаблицаДополнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , Колонки);
			
			Для Каждого Колонка Из МассивКолонок Цикл
				НоваяСтрока[Колонка] = МассивыРаспределений[Колонка][Индекс];
			КонецЦикла;
			
			НоваяСтрока.ПодразделениеПредприятия = МассивПодразделений[Индекс];
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		МассивУдаляемыхСтрок.Добавить(Строка);
		
	КонецЦикла;
	
	Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
		НачисленнаяЗарплатаИВзносы.Удалить(Строка);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДополнения, НачисленнаяЗарплатаИВзносы);
	
КонецПроцедуры
