
&После("ПередНачаломКомпоновкиРезультата")
Процедура ВИЛС_ПередНачаломКомпоновкиРезультата()
	Схема = Новый Схемазапроса();
	Схема.УстановитьТекстЗапроса(СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Элементы.НачисленияУдержания.Запрос);
	Для Каждого ПакетЗапроса Из Схема.ПакетЗапросов Цикл
			
		Если ТипЗнч(ПакетЗапроса) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПакетЗапроса.ТаблицаДляПомещения = "ВТПоследниеПериодыСведенияОбУчетеЗатрат" Тогда
			Попытка
				Для каждого Оператор Из ПакетЗапроса.Операторы Цикл
					ИскомоеПоле = Оператор.ВыбираемыеПоля.Найти("МАКСИМУМ(БухучетЗарплатыСотрудников.ПериодЗаписи)");
					Если ИскомоеПоле = Неопределено Тогда
						Продолжить;
					Иначе
					    НовоеВыражение = Новый ВыражениеСхемыЗапроса("БухучетЗарплатыСотрудников.ПериодЗаписи");
						Оператор.ВыбираемыеПоля.Установить(Оператор.ВыбираемыеПоля.Индекс(ИскомоеПоле), НовоеВыражение);	
					    Оператор.Группировка.Добавить(НовоеВыражение);
						Оператор.ВыбиратьРазличные = Истина;     
						СхемаКомпоновкиДанных.НаборыДанных.НачисленияУдержанияОбъединенные.Элементы.НачисленияУдержания.Запрос = Схема.ПолучитьТекстЗапроса();
						Прервать;
					КонецЕсли; 
				КонецЦикла;
			
				Прервать;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры