
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	НоваяКоманда = Команды.Добавить("ВИЛС_ПодключениеКПользователю");
	НоваяКоманда.Действие = "ВИЛС_ПодключитьсяКПользователю_Подключаемый";
	НоваяКнопка = Элементы.Вставить("ВИЛС_ПодключитьсяКПользователю",Тип("КнопкаФормы"),Элементы.ОсновнаяКоманднаяПанель,Элементы.ОткрытьПользователя);
	НоваяКнопка.Картинка = БиблиотекаКартинок.RFDIОперацииВыполнены;
	НоваяКнопка.ИмяКоманды = "ВИЛС_ПодключениеКПользователю";
	
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ПодключитьсяКПользователю_Подключаемый(Кнопка)
	ТекДанные = Элементы.СписокПользователей.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяКомпьютера = ТекДанные.Компьютер;
	ЗапуститьПриложение("""C:\Program Files\TightVNC\tvnviewer.exe"""+ " -host="+ИмяКомпьютера+" -password="+"""Admin#1""");
КонецПроцедуры
