
//&Вместо("ТекстЗапросаДанныхОснованияДляПечатнойФормыСчетФактура")
//Функция ВИЛС_ТекстЗапросаДанныхОснованияДляПечатнойФормыСчетФактура()
//	
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	ДанныеДокументов.Ссылка                                   КАК Ссылка,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
//	|	ДанныеДокументов.Валюта                                   КАК Валюта,
//	|	ДанныеДокументов.Организация                              КАК Организация,
//	|	ДанныеДокументов.НалогообложениеНДС                       КАК НалогообложениеНДС,
//	|	ДанныеДокументов.Подразделение                            КАК Подразделение,
//	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                  КАК Склад,
//	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)             КАК Грузоотправитель,
//	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)             КАК Грузополучатель,
//	|	ЛОЖЬ                                                      КАК РасчетыЧерезОтдельногоКонтрагента,
//	|	ДанныеДокументов.Номенклатура                             КАК Номенклатура,
//	|	ВЫРАЗИТЬ(ДанныеДокументов.Содержание КАК СТРОКА(1000))    КАК Содержание,
//	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)             КАК Комиссионер,
//	//|	НЕОПРЕДЕЛЕНО                                              КАК Основание,            // begin fix Suetin 11.02.2019 16:33:15
//	//|	НЕОПРЕДЕЛЕНО                            				  КАК ОснованиеДата,
//	//|	НЕОПРЕДЕЛЕНО                           					  КАК ОснованиеНомер,
//	|	ДанныеДокументов.Договор                                  КАК Основание,
//	|	ДанныеДокументов.ЗаказДавальца                            КАК ЗаказДавальца,
//	|	ДанныеДокументов.ЗаказДавальца.Номер                      КАК НомерЗаказаДавальца,
//	|	ДанныеДокументов.ЗаказДавальца.Дата                       КАК ДатаЗаказаДавальца,
//	|	ДанныеДокументов.Дата                      				  КАК ОснованиеДата,
//	|	ДанныеДокументов.Номер                 					  КАК ОснованиеНомер,      // end fix Suetin 11.02.2019 16:33:22
//	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьНомер,
//	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьДата,
//	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьВыдана,
//	|	НЕОПРЕДЕЛЕНО                                              КАК ДоверенностьЛицо,
//	|	ВЫРАЗИТЬ(ДанныеДокументов.ДополнительнаяИнформацияПоДоставке КАК СТРОКА(100)) КАК ДополнительнаяИнформацияПоДоставке,     // fix Suetin 01.02.2019 13:42:38
//	|   ДанныеДокументов.Договор								  КАК Договор,                                                    // fix Suetin 05.02.2019 2:13:56
//	|	НЕОПРЕДЕЛЕНО                                              КАК Кладовщик,
//	|	НЕОПРЕДЕЛЕНО                                              КАК ДолжностьКладовщика
//	|
//	|//ОператорПОМЕСТИТЬ
//	|ИЗ
//	|	Документ.ОтчетДавальцу КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В (&ДокументОснование_ОтчетДавальцу)";
//	
//	Возврат ТекстЗапроса;
//	
//КонецФункции

//&Вместо("ПоместитьВременнуюТаблицуТоваров")
//Процедура ВИЛС_ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения)
//	
//	Если ПараметрыЗаполнения = Неопределено Тогда
//		ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
//	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",     Константы.ВалютаУправленческогоУчета.Получить());
//	Запрос.УстановитьПараметр("ПересчитыватьВВалютуРегл",       ПараметрыЗаполнения.ПересчитыватьВВалютуРегл);
//	
//	Если ПараметрыЗаполнения.ПересчитыватьВВалютуРегл Тогда
//		Если ПараметрыЗаполнения.АктуализироватьРасчеты И НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
//		
//			Запрос.Текст = "
//			|ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
//			|ИЗ
//			|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
//			|
//			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//			|		ТаблицаДанныхДокументов КАК ДанныеДокументов
//			|	ПО
//			|		РасчетыСКлиентами.Регистратор = ДанныеДокументов.Ссылка
//			|
//			|ГДЕ
//			|	ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
//			|	И РасчетыСКлиентами.Активность
//			|";
//			ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
//			МассивАналитикУчетаПоПартнерам = ТаблицаАналитик.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам");
//			
//			Если МассивАналитикУчетаПоПартнерам.Количество() > 0 Тогда
//				ОкончаниеПериодаРасчета = КонецМесяца(ВзаиморасчетыСервер.ПолучитьМаксимальнуюДатуВКоллекцииДокументов(МенеджерВременныхТаблиц)) + 1;
//				АналитикиРасчета = РаспределениеВзаиморасчетовВызовСервера.АналитикиРасчета();
//				АналитикиРасчета.АналитикиУчетаПоПартнерам = МассивАналитикУчетаПоПартнерам;
//				Попытка
//					РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ОкончаниеПериодаРасчета, АналитикиРасчета);
//				Исключение
//					ТекстСообщения = НСтр("ru ='Печатная форма сформирована по неактуальным данным.
//					|Необходимо актуализировать взаиморасчеты вручную и переформировать печатную форму.'");
//					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//				КонецПопытки;
//			КонецЕсли;
//		Иначе
//			
//			Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ДанныеДокументов.Ссылка КАК Ссылка
//			|ИЗ
//			|	ТаблицаДанныхДокументов КАК ДанныеДокументов
//			|ГДЕ 
//			|	ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
//			|	ИЛИ ДанныеДокументов.Валюта <> &ВалютаУправленческогоУчета";
//			МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
//			РегистрыСведений.СуммыДокументовВВалютеРегл.РассчитатьСуммыДокументовВВалютеРегл(МассивДокументов);
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	ТаблицаДокумента.Ссылка                                КАК Ссылка,
//	|	ТаблицаДокумента.НомерСтроки                           КАК НомерСтроки,
//	|	ТаблицаДокумента.Номенклатура                          КАК Номенклатура,
//	|	ТаблицаДокумента.Характеристика                        КАК Характеристика,
//	|	ДанныеДокументов.Номенклатура                          КАК Услуга,
//	|	ДанныеДокументов.Содержание                            КАК Содержание,
//	|	ТаблицаДокумента.Количество                            КАК Количество,
//	|	ТаблицаДокумента.ВИЛС_КоличествоШТ                     КАК ВИЛС_КоличествоШТ,  // fix Suetin 11.02.2019 14:48:58
//	|	ТаблицаДокумента.СуммаСНДС - ТаблицаДокумента.СуммаНДС КАК СуммаБезНДС,
//	|	ТаблицаДокумента.СтавкаНДС                             КАК СтавкаНДС,
//	|	ТаблицаДокумента.СуммаНДС                              КАК СуммаНДС
//	|
//	|ПОМЕСТИТЬ ТаблицаТоваров
//	|ИЗ
//	|	Документ.ОтчетДавальцу.Продукция КАК ТаблицаДокумента
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
//	|	ПО
//	|		ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
//	|
//	|ГДЕ
//	|	ДанныеДокументов.Валюта = &ВалютаРегламентированногоУчета
//	|	ИЛИ (НЕ &ПересчитыватьВВалютуРегл)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокумента.Ссылка                                 КАК Ссылка,
//	|	ТаблицаДокумента.НомерСтроки                            КАК НомерСтроки,
//	|	ТаблицаДокумента.Номенклатура                           КАК Номенклатура,
//	|	ТаблицаДокумента.Характеристика                         КАК Характеристика,
//	|	ДанныеДокументов.Номенклатура                           КАК Услуга,
//	|	ДанныеДокументов.Содержание                             КАК Содержание,
//	|	ТаблицаДокумента.Количество                             КАК Количество,    
//	|	ТаблицаДокумента.ВИЛС_КоличествоШТ                      КАК ВИЛС_КоличествоШТ,      // fix Suetin 11.02.2019 14:49:39
//	|	ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаБезНДСРегл, 0) КАК СуммаБезНДС,
//	|	ТаблицаДокумента.СтавкаНДС                              КАК СтавкаНДС,
//	|	ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаНДСРегл, 0)    КАК СуммаНДС
//	|
//	|ИЗ
//	|	Документ.ОтчетДавальцу.Продукция КАК ТаблицаДокумента
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
//	|	ПО
//	|		ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
//	|	
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыДокументовВВалютеРегл
//	|	ПО
//	|		ТаблицаДокумента.Ссылка = СуммыДокументовВВалютеРегл.Регистратор
//	|		И ТаблицаДокумента.ИдентификаторСтроки = СуммыДокументовВВалютеРегл.ИдентификаторСтроки
//	|
//	|ГДЕ
//	|	ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
//	|	И &ПересчитыватьВВалютуРегл
//	|	И СуммыДокументовВВалютеРегл.Активность";
//	
//	Запрос.Выполнить();
//	
//КонецПроцедуры

//&Вместо("ПреобразоватьВременнуюТаблицуТоваровДляСчетаФактуры")
//Процедура ВИЛС_ПреобразоватьВременнуюТаблицуТоваровДляСчетаФактуры(МенеджерВременныхТаблиц)
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	ТаблицаДокумента.Ссылка                                КАК Ссылка,
//	|	ТаблицаДокумента.Услуга                                КАК Номенклатура,
//	|	ТаблицаДокумента.Содержание                            КАК Содержание,
//	|	НЕОПРЕДЕЛЕНО                                           КАК Характеристика,
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)            КАК НомерГТД,
//	|	1                                                      КАК Количество,
//	|	1                                                      КАК КоличествоУпаковок,
//	|	СУММА(ТаблицаДокумента.ВИЛС_КоличествоШТ)              КАК ВИЛС_КоличествоШТ,        // fix Suetin 11.02.2019 15:13:49
//	|	ТаблицаДокумента.СтавкаНДС                             КАК СтавкаНДС,
//	|	СУММА(ТаблицаДокумента.СуммаБезНДС)                    КАК СуммаБезНДС,
//	|	СУММА(ТаблицаДокумента.СуммаНДС)                       КАК СуммаНДС,
//	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки)                 КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
//	|	ЛОЖЬ                                                   КАК ЭтоТовар,
//	|	ЛОЖЬ                                                   КАК ВернутьМногооборотнуюТару
//	|
//	|ПОМЕСТИТЬ ОтчетДавальцуТаблицаТоваров
//	|ИЗ
//	|	ТаблицаТоваров КАК ТаблицаДокумента
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Ссылка,
//	|	ТаблицаДокумента.Услуга,
//	|	ТаблицаДокумента.Содержание,
//	|	ТаблицаДокумента.СтавкаНДС
//	|;
//	|/////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ТаблицаТоваров
//	|";
//	
//	Запрос.Выполнить();
//	
//КонецПроцедуры
