

&НаСервере
&После("ОбъектРасчетовПриИзменении")
Процедура ВИЛС_ОбъектРасчетовПриИзменении(ТекущаяСтрокаИдентификатор)
	ИмяТЧ = Документы.ВводОстатков.ИмяТабличнойЧастиРасчетовПоТипуОперации(Объект.ТипОперации);
	ТекущиеДанные = Объект[ИмяТЧ].НайтиПоИдентификатору(ТекущаяСтрокаИдентификатор);
	Если Не ТекущиеДанные = Неопределено Тогда
		Реквизиты = Новый Структура("Номер, Дата");
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.ОбъектРасчетов,Реквизиты);
		ТекущиеДанные.ДатаРасчетногоДокумента	= ЗначенияРеквизитов.Дата;
		ТекущиеДанные.НомерРасчетногоДокумента	= ЗначенияРеквизитов.Номер; 
	КонецЕсли;	
КонецПроцедуры

