
&Вместо("СтруктураОснования")
Функция ВИЛС_СтруктураОснования(Объект, ПоДоговору)
	
	СтруктураОснование = Новый Структура;
	СтруктураОснование.Вставить("Основание");
	СтруктураОснование.Вставить("ОснованиеНомер");
	СтруктураОснование.Вставить("ОснованиеДата");
	
	Если Не ПоДоговору = Ложь И ЗначениеЗаполнено(Объект.Договор) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК Основание,
		|	ДоговорыКонтрагентов.Дата КАК ОснованиеДата,
		|	ДоговорыКонтрагентов.Номер КАК ОснованиеНомер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Объект.Договор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтруктураОснование.Основание = СокрЛП(Выборка.Основание);
			СтруктураОснование.ОснованиеДата = Объект.Дата;   //  ТТН	Выборка.ОснованиеДата;   // begin fix Suetin 01.02.2019 11:18:21
			СтруктураОснование.ОснованиеНомер = СокрЛП(Объект.Номер); // ТТН	СокрЛП(Выборка.ОснованиеНомер);  // end fix Suetin 01.02.2019 11:18:43
		КонецЕсли;
		
	ИначеЕсли Не ПоДоговору = Истина И Объект.ПередачаПоЗаказам Тогда
		
		МассивЗаказов = Неопределено;
		Если ЗначениеЗаполнено(Объект.ЗаказПереработчику) Тогда
			
			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(Объект.ЗаказПереработчику);
			
		ИначеЕсли Объект.Товары.Количество() <> 0 Тогда
			
			Если ТипЗнч(Объект) = Тип("Структура") Тогда
				МассивЗаказов = Объект.Товары.ВыгрузитьКолонку("ЗаказПереработчику");
			Иначе
				МассивЗаказов = Объект.Товары.Выгрузить(, "ЗаказПереработчику").ВыгрузитьКолонку("ЗаказПереработчику");
			КонецЕсли;
			
		КонецЕсли;
		
		Если МассивЗаказов <> Неопределено Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаказыКлиентов.НомерПоДаннымПартнера КАК НомерПоДаннымПартнера,
			|	ЗаказыКлиентов.ДатаПоДаннымПартнера  КАК ДатаПоДаннымПартнера,
			|	ЗаказыКлиентов.Номер                 КАК Номер,
			|	ЗаказыКлиентов.Дата                  КАК Дата,
			|	&СинонимЗаказа                       КАК Синоним
			|ИЗ
			|	Документ.ЗаказПереработчику КАК ЗаказыКлиентов
			|ГДЕ
			|	ЗаказыКлиентов.Ссылка В(&МассивЗаказов)");
			
			Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
			Запрос.УстановитьПараметр("СинонимЗаказа", НСтр("ru='Заказ переработчику'"));
			Выборка = Запрос.Выполнить().Выбрать();
			
			ТекстПоЗаказам = "";
			ОдноОснование = Выборка.Количество() = 1;
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.НомерПоДаннымПартнера) И ЗначениеЗаполнено(Выборка.ДатаПоДаннымПартнера) Тогда
					
					ИнформацияОЗаказе = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 № %2 от %3'"),                    // Строка с параметрами
						Выборка.Синоним,                                 // 1 параметр
						Выборка.НомерПоДаннымПартнера,                   // 2 параметр
						Формат(Выборка.ДатаПоДаннымПартнера, "ДЛФ=DD")); // 3 параметр
					ДатаПоЗаказам  = Выборка.ДатаПоДаннымПартнера;
					НомерПоЗаказам = Выборка.НомерПоДаннымПартнера;
				Иначе
					
					ИнформацияОЗаказе = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Выборка, Выборка.Синоним);
					ДатаПоЗаказам  = Выборка.Дата;
					НомерПоЗаказам = Выборка.Номер;
				КонецЕсли;
				
				ТекстПоЗаказам = ТекстПоЗаказам + ", " + ИнформацияОЗаказе;
				
			КонецЦикла;
			
			СтруктураОснование.Основание      = СокрЛП(Сред(ТекстПоЗаказам, 3));
			СтруктураОснование.ОснованиеДата  = ?(ОдноОснование, ДатаПоЗаказам, "");
			СтруктураОснование.ОснованиеНомер = ?(ОдноОснование,ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерПоЗаказам),"");
		КонецЕсли;
		// begin fix Suetin 31.01.2019 16:40:59
		Если ЗначениеЗаполнено(Объект.Договор) Тогда 
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК Основание,
				|	ДоговорыКонтрагентов.Дата КАК ОснованиеДата,
				|	ДоговорыКонтрагентов.Номер КАК ОснованиеНомер
				|ИЗ
				|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|ГДЕ
				|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Объект.Договор);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если МассивЗаказов <> Неопределено Тогда
					СтруктураОснование.Основание = СокрЛП(Выборка.Основание) + "; " + СокрЛП(СтруктураОснование.Основание);   //;
				Иначе
					СтруктураОснование.Основание = СокрЛП(Выборка.Основание);
				КонецЕсли;	
				СтруктураОснование.ОснованиеДата = Объект.Дата;   //  ТТН
				СтруктураОснование.ОснованиеНомер = СокрЛП(Объект.Номер); // ТТН
			КонецЕсли;
		КонецЕсли;	
		// end fix Suetin 31.01.2019 16:41:46
	КонецЕсли;
	
	Возврат СтруктураОснование; // Возврат значения по умолчанию
	
КонецФункции

&Вместо("ТаблицаОснованийДляПечати")
Функция ВИЛС_ТаблицаОснованийДляПечати(Объект)
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "Дата, Номер");
	КонецЕсли;
	
	ТаблицаОснований = Новый ТаблицаЗначений;
	ТаблицаОснований.Колонки.Добавить("Основание",      Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(300)));
	ТаблицаОснований.Колонки.Добавить("ОснованиеДата",  Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата))); 
	ТаблицаОснований.Колонки.Добавить("ОснованиеНомер", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(128)));
	
	СтруктураОснования = СтруктураОснования(Объект, Ложь);   // fix Suetin 01.02.2019 18:03:57  Истина
	Если ЗначениеЗаполнено(СтруктураОснования.Основание) Тогда
		//Если ЗначениеЗаполнено(Объект.Договор) Тогда
		//	СтруктураОснования.Основание = 
		//			СтруктураОснования.Основание 
		//			+ "; "            // fix Suetin 01.02.2019 18:04:58	,
		//			+ СтрШаблон(НСтр("ru='в переработку на давальческой основе по договору №%1 от %2'"), 
		//					Строка(РеквизитыДоговора.Номер), 
		//					Формат(РеквизитыДоговора.Дата, "ДЛФ=DD"));
		//Иначе
		//	СтруктураОснования.Основание = 
		//			СтруктураОснования.Основание 
		//			+ "; "            // fix Suetin 01.02.2019 18:04:58	,
		//			+ НСтр("ru='в переработку на давальческой основе'");
		//КонецЕсли; 
				
		ДобавленнаяСтрока = ТаблицаОснований.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, СтруктураОснования);
	КонецЕсли;
	
	СтруктураОснования = СтруктураОснования(Объект, Истина);   // fix Suetin 01.02.2019 18:03:42  Ложь
	Если ЗначениеЗаполнено(СтруктураОснования.Основание) Тогда
		
		//Если ТаблицаОснований.Количество() = 0 Тогда
		//	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		//		СтруктураОснования.Основание = СтруктураОснования.Основание 
		//				+ "; "          // fix Suetin 01.02.2019 18:04:58	,
		//				+ СтрШаблон(НСтр("ru='в переработку на давальческой основе по договору №%1 от %2'"), 
		//					Строка(РеквизитыДоговора.Номер), 
		//					Формат(РеквизитыДоговора.Дата, "ДЛФ=DD"));
		//	Иначе
		//		СтруктураОснования.Основание = СтруктураОснования.Основание 
		//				+ "; "           // fix Suetin 01.02.2019 18:04:58	,
		//				+ НСтр("ru='в переработку на давальческой основе'");
		//	КонецЕсли;
		//КонецЕсли;
		ДобавленнаяСтрока = ТаблицаОснований.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, СтруктураОснования);
		
	КонецЕсли;
	
	Если ТаблицаОснований.Количество() = 0 Тогда
		ДобавленнаяСтрока = ТаблицаОснований.Добавить();
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			ДобавленнаяСтрока.Основание = СтрШаблон(НСтр("ru='В переработку на давальческой основе по договору №%1 от %2'"), 
															Строка(РеквизитыДоговора.Номер), 
															Формат(РеквизитыДоговора.Дата, "ДЛФ=DD"));
		Иначе
			ДобавленнаяСтрока.Основание = НСтр("ru='В переработку на давальческой основе'");
		КонецЕсли;
														
		ДобавленнаяСтрока.ОснованиеДата = Объект.Дата;		// fix Suetin 01.02.2019 18:02:14?(ЗначениеЗаполнено(Объект.Договор), РеквизитыДоговора.Дата, ""); 
		ДобавленнаяСтрока.ОснованиеНомер = Объект.Номер;		// fix Suetin 01.02.2019 18:02:14?(ЗначениеЗаполнено(Объект.Договор), ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДоговора.Номер), ""); 
	КонецЕсли;
	
	Возврат ТаблицаОснований;
	
КонецФункции
