&Вместо("ПартнерыФормаВыбораСпискаПриСозданииНаСервере")
Процедура ВИЛС_ПартнерыФормаВыбораСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.УпрощенныйВводДоступен               = УпрощенныйВводДоступен();
	Форма.ТекущийПользователь                  = Пользователи.АвторизованныйПользователь();
	Форма.ДоступноДобавлениеПартнеров          = ПравоДоступа("Добавление", Метаданные.Справочники.Партнеры);
	Форма.ИспользоватьБизнесРегионы            = ПолучитьФункциональнуюОпцию("ИспользоватьБизнесРегионы");
	Форма.ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ИспользоватьПроверкуКонтрагентов           = ПроверкаКонтрагентов.ПроверкаКонтрагентовВключена();
	
	Если Не СтрНайти(Форма.ИмяФормы, "Контрагенты") > 0 Тогда
		
		ЗапросСИнформациейПоКонтрагенту = ложь;//fix Ложь;

		Форма.Список.ТекстЗапроса = ТекстЗапросаДинамическогоСпискаПартнеры(ЗапросСИнформациейПоКонтрагенту);
		Форма.Элементы.ГруппаКонтрагентыПартнера.Видимость      = НЕ Форма.ИспользоватьПартнеровКакКонтрагентов;
		ОтображатьИнформациюПоПроверкеКонтрагентов = Форма.ИспользоватьПартнеровКакКонтрагентов
		                                                          И ИспользоватьПроверкуКонтрагентов
		                                                          И ЗапросСИнформациейПоКонтрагенту;
		Форма.Элементы.ЕстьОшибкиПроверкаКонтрагентов.Видимость = ОтображатьИнформациюПоПроверкеКонтрагентов;
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		                                                               "ГруппаЛегенда",
		                                                               "Видимость",
		                                                               ОтображатьИнформациюПоПроверкеКонтрагентов);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		                                                               "СписокКонтекстноеМенюПеренестиЭлемент",
		                                                               "Видимость",
		                                                               НЕ Форма.ИспользоватьПартнеровКакКонтрагентов);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		                                                               "ФормаПеренестиЭлемент",
		                                                               "Видимость",
		                                                               НЕ Форма.ИспользоватьПартнеровКакКонтрагентов);
		// Сервис 1С-ЭДО
		ЭлементЭДО = Форма.Элементы.Найти("ЭДО");
		Если ЭлементЭДО <> Неопределено Тогда
			ЭлементЭДО.Видимость = Форма.ИспользоватьПартнеровКакКонтрагентов И ЗапросСИнформациейПоКонтрагенту;
		КонецЕсли;
		// Конец Сервис 1С-ЭДО
		
	Иначе
		
		Форма.Элементы.ЕстьОшибкиПроверкаКонтрагентов.Видимость = ИспользоватьПроверкуКонтрагентов;
		Форма.Элементы.ГруппаЛегенда.Видимость                  = ИспользоватьПроверкуКонтрагентов;
		
	КонецЕсли;
	
	Если Форма.ДоступноДобавлениеПартнеров И Не Форма.УпрощенныйВводДоступен Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		                                                               "ФормаСкопировать",
		                                                               "Видимость",
		                                                               Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,
	                                                                   "ОтборПоПолнотекстовомуПоискуУстановлен",
	                                                                   Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,
	                                                                   "ОтборПоПолнотекстовомуПоиску",
	                                                                   Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,
	                                                                   "ОтборПоСегментуУстановлен",
	                                                                   Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,
	                                                                   "ОтборПоСегменту",
	                                                                   Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,
	                                                                   "ПредставлениеОбособленногоПодразделения",
	                                                                   НСтр("ru='Обособленное подразделение'"));

	ДоступностьПолнотекстовыйПоискСписокПартнеры(Форма);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоздатьНового", "Видимость", Форма.УпрощенныйВводДоступен);
	
	ЗаполнитьСписокВыбораТипФильтраСписокПартнеров(Форма, Форма.Элементы.ТипФильтра.СписокВыбора);
	Форма.ТипФильтра = Форма.Элементы.ТипФильтра.СписокВыбора[0].Значение;
	УстановитьВидимостьКомандОтчетов(Форма);
	УстановитьОтборыДинамическийСписокПартнеры(Форма);
	СоздатьРеквизитыДляОтображенияКИ(Форма);
	
КонецПроцедуры