#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область СоставСемьи

&Вместо("ПредставлениеЧленаСемьи")
Функция ВИЛС_ПредставлениеЧленаСемьи(ЧленСемьи)
	ПредставлениеЧленаСемьи = "%1: %2, %3";    // begin fix Suetin 05.08.2019 16:42:03 Добавил , %3
	ПредставлениеЧленаСемьи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеЧленаСемьи, ЧленСемьи.СтепеньРодства, СокрЛП(ЧленСемьи.ФИО), Формат(ЧленСемьи.ДатаРождения, "ДФ=""гггг 'г.р.'"""));  // end fix Suetin 05.08.2019 16:42:08 , СокрЛП(ЧленСемьи.ФИО), Формат(ЧленСемьи.ДатаРождения, "ДФ=""гггг 'г.р.'")
	Возврат ПредставлениеЧленаСемьи;
КонецФункции

#КонецОбласти 

#КонецОбласти

#КонецЕсли