
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.КонтактныеЛицаПартнеров"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
	МассивКолонок = Новый Массив();
	
	ДЗ = РеквизитФормыВЗначение("РаспоряженияНаДоставку",Тип("ДеревоЗначений"));
	МассивКолонок = Новый Массив;
	Колонка = ДЗ.Колонки.Добавить("ВИЛС_КонтактноеЛицо", ДопустимыеТипы);
	РеквизитФормы = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РаспоряженияНаДоставку", Колонка.Заголовок);
	МассивКолонок.Добавить(РеквизитФормы);
	ЗначениеВРеквизитФормы(ДЗ, "РаспоряженияНаДоставку");
	ИзменитьРеквизиты(МассивКолонок);
	
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.РаспоряженияНаДоставку, Элементы.РаспоряженияНаДоставку.ПодчиненныеЭлементы.РаспоряженияНаДоставкуВремя);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "РаспоряженияНаДоставку.ВИЛС_КонтактноеЛицо";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Контактное лицо (ВИЛС)";
	////ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	////ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	//ДобавляемыйЭлемент.УстановитьДействие("Нажатие", "ВИЛС_КонтактноеЛицоНажатие");    // ПриИзменении
КонецПроцедуры
