
&ИзменениеИКонтроль("СформироватьВТРасширенныхСведенийОДоходах")
Процедура ВИЛС_СформироватьВТРасширенныхСведенийОДоходах(НачалоПериода, ОкончаниеПериода, ДатаАктуальности, МенеджерВременныхТаблиц, ТолькоРазрешенные, ДляПервичнойОтчетностиПФР, ИсключатьДоходыРегистратора, Регистратор, УчитыватьОпоздавшиеИзмененияПрименяемыхТарифов, ОставлятьМесяцыБезДоходов)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("НачалоПериода",		НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода",	ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("ДатаОтменыЕНВД",		ЗарплатаКадры.ДатаОтменыЕНВД());
	Запрос.УстановитьПараметр("НеУчитыватьУстаревшуюОтчетность", Не ДляПервичнойОтчетностиПФР);
	Запрос.УстановитьПараметр("НачалоПредшествующегоГода", ДобавитьМесяц(НачалоГода(Мин(НачалоПериода, ДатаАктуальности)), -12));
	Запрос.УстановитьПараметр("ДатаСтрахованияВременноПребывающих",	ДатаСтрахованияВременноПребывающих());
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));

	Если НачалоГода(НачалоПериода) >= ДатаВводаЛьготногоТарифаПоНС_ПЗдляИП() Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ИСТИНА КАК ПредоставлятьЛьготуПоИнвалидам
		|ПОМЕСТИТЬ ВТЛьготыПоФСС_НСДляОрганизаций
		|ИЗ
		|	ВТФизЛицаОрганизаций КАК СписокСотрудников";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ИСТИНА КАК ПредоставлятьЛьготуПоИнвалидам
		|ИЗ
		|	ВТФизЛицаОрганизаций КАК СписокСотрудников";
		ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
			СтрокаТЗ.ПредоставлятьЛьготуПоИнвалидам = ЗарплатаКадры.ЭтоЮридическоеЛицо(СтрокаТЗ.ГоловнаяОрганизация)
		КонецЦикла;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокОрганизаций.ГоловнаяОрганизация,
		|	СписокОрганизаций.ПредоставлятьЛьготуПоИнвалидам
		|ПОМЕСТИТЬ ВТЛьготыПоФСС_НСДляОрганизаций
		|ИЗ
		|	&ВременнаяТаблица КАК СписокОрганизаций";
		Запрос.УстановитьПараметр("ВременнаяТаблица", ВременнаяТаблица)
	КонецЕсли;
	Запрос.Выполнить();

	// Формируем список месяцев, в разрезе которых собираем данные.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, КонецМесяца(НачалоГода(НачалоПериода)), КонецМесяца(ОкончаниеПериода),,, "ВТПериодыРасширенныхСведенийОДоходах", Истина);

	// Получаем временные таблицы, используя общие алгоритмы.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТПериодыФизЛицОрганизаций
	|ИЗ
	|	ВТФизЛицаОрганизаций КАК СписокСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРасширенныхСведенийОДоходах КАК Периоды
	|		ПО (ИСТИНА)";
	Запрос.Выполнить();

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ВсеЗаписи = Истина;
	ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, ДатаАктуальности, ДляПервичнойОтчетностиПФР И УчитыватьОпоздавшиеИзмененияПрименяемыхТарифов);

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
	"ПрименяемыеТарифыСтраховыхВзносов",
	Запрос.МенеджерВременныхТаблиц,
	ТолькоРазрешенные,
	ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
	"ВТПериодыФизЛицОрганизаций",
	"ГоловнаяОрганизация"),
	ПараметрыПостроения);

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ВсеЗаписи = Истина;
	ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, ДатаАктуальности, ДляПервичнойОтчетностиПФР);

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
	"СведенияОбИнвалидностиФизическихЛиц",
	Запрос.МенеджерВременныхТаблиц,
	ТолькоРазрешенные,
	ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
	"ВТПериодыФизЛицОрганизаций",
	"ФизическоеЛицо"),
	ПараметрыПостроения);

	СформироватьВТДанныеОПравахНаСтрахование(Запрос.МенеджерВременныхТаблиц, "ВТПериодыФизЛицОрганизаций", ТолькоРазрешенные, ДатаАктуальности, ДляПервичнойОтчетностиПФР);
	СформироватьВТОписаниеТарифов(НачалоПериода, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц);

	МассивВидовДохода = Новый Массив;
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеСодержаниеПрокуроров);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.МатпомощьПрокуроров);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.КомпенсацииОблагаемыеВзносамиПрокуроров);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликомНеОблагаемыеФСС_НС);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.КомпенсацииОблагаемыеВзносами);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.МатпомощьПриРожденииРебенка);
	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.Матпомощь);
	Запрос.УстановитьПараметр("ВидыДохода", МассивВидовДохода);

	ЗарплатаКадры.СоздатьПустуюВТ(МенеджерВременныхТаблиц, "РегистрНакопления.СведенияОДоходахСтраховыеВзносы");
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТДанныеОбИнвалидности", Истина);
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТИспользуемыеТарифы", Истина);

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОДоходахСтраховыеВзносы.Период КАК Период,
	|	СведенияОДоходахСтраховыеВзносы.Регистратор КАК Регистратор,
	|	СведенияОДоходахСтраховыеВзносы.НомерСтроки КАК НомерСтроки,
	|	СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахСтраховыеВзносы.Организация КАК Организация,
	|	СведенияОДоходахСтраховыеВзносы.ВидДохода КАК ВидДохода,
	|	ВЫБОР
	|		КОГДА СведенияОДоходахСтраховыеВзносы.Период < &ДатаОтменыЕНВД
	|			ТОГДА СведенияОДоходахСтраховыеВзносы.ОблагаетсяЕНВД
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОблагаетсяЕНВД,
	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходахСтраховыеВзносы.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
	|	СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда КАК КлассУсловийТруда,
#КонецУдаления
#Вставка
	|	&КлассУсловийТруда,
#КонецВставки
	|	СведенияОДоходахСтраховыеВзносы.Сумма КАК Сумма,
	|	СведенияОДоходахСтраховыеВзносы.Скидка КАК Скидка,
	|	СведенияОДоходахСтраховыеВзносы.Сотрудник КАК Сотрудник,
	|	СведенияОДоходахСтраховыеВзносы.Начисление КАК Начисление,
	|	СведенияОДоходахСтраховыеВзносы.Подразделение КАК Подразделение,
	|	СведенияОДоходахСтраховыеВзносы.ДатаНачала КАК ДатаНачала,
	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	СведенияОДоходахСтраховыеВзносы.ПоАктуПроверки КАК ПоАктуПроверки
	|ПОМЕСТИТЬ ВТДанныеУчета
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
	|ГДЕ
	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И СведенияОДоходахСтраховыеВзносы.Период МЕЖДУ &НачалоПредшествующегоГода И &ДатаАктуальности
	|	И СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛицаОрганизаций.ФизическоеЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)
	|	И СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация В
	|			(ВЫБРАТЬ
	|				ФизЛицаОрганизаций.ГоловнаяОрганизация
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОДоходахСтраховыеВзносы.Период,
	|	СведенияОДоходахСтраховыеВзносы.Регистратор,
	|	СведенияОДоходахСтраховыеВзносы.НомерСтроки,
	|	СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация,
	|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
	|	СведенияОДоходахСтраховыеВзносы.Организация,
	|	СведенияОДоходахСтраховыеВзносы.ВидДохода,
	|	ВЫБОР
	|		КОГДА СведенияОДоходахСтраховыеВзносы.Период < &ДатаОтменыЕНВД
	|			ТОГДА СведенияОДоходахСтраховыеВзносы.ОблагаетсяЕНВД
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходахСтраховыеВзносы.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
	|	СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда,
#КонецУдаления
#Вставка
	|	&КлассУсловийТруда,
#КонецВставки
	|	СведенияОДоходахСтраховыеВзносы.Сумма,
	|	СведенияОДоходахСтраховыеВзносы.Скидка,
	|	СведенияОДоходахСтраховыеВзносы.Сотрудник,
	|	СведенияОДоходахСтраховыеВзносы.Начисление,
	|	СведенияОДоходахСтраховыеВзносы.Подразделение,
	|	СведенияОДоходахСтраховыеВзносы.ДатаНачала,
	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода,
	|	СведенияОДоходахСтраховыеВзносы.ПоАктуПроверки
	|ИЗ
	|	ВТРегистрНакопления_СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
	|ГДЕ
	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И СведенияОДоходахСтраховыеВзносы.Период МЕЖДУ &НачалоПредшествующегоГода И &ДатаАктуальности
	|	И (СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо, СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация) В
	|			(ВЫБРАТЬ
	|				ФизЛицаОрганизаций.ФизическоеЛицо,
	|				ФизЛицаОрганизаций.ГоловнаяОрганизация
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТРазныеФизЛицаОрганизаций
	|ИЗ
	|	ВТФизЛицаОрганизаций КАК СписокСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходах.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СведенияОДоходах.ВидДохода КАК ВидДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
	|	СведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СведенияОДоходах.Сумма КАК Сумма,
	|	СведенияОДоходах.Скидка КАК Скидка,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ДатаПолученияДохода < &ДатаСтрахованияВременноПребывающих
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|	КОНЕЦ КАК ЯвляетсяДоходомФармацевта,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ДатаПолученияДохода < &ДатаСтрахованияВременноПребывающих
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|	КОНЕЦ КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ДатаПолученияДохода < &ДатаСтрахованияВременноПребывающих
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
	|		ИНАЧЕ СведенияОДоходах.ЛьготныйТерриториальныйТариф
	|	КОНЕЦ КАК ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.Сотрудник КАК Сотрудник,
	|	СведенияОДоходах.Начисление КАК Начисление,
	|	СведенияОДоходах.Регистратор КАК Регистратор,
	|	СведенияОДоходах.НомерСтроки КАК НомерСтроки,
	|	СведенияОДоходах.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.СКЕ, СведенияОДоходах.Организация) КАК СКЕ,
	|	СведенияОДоходах.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПодземныеИВредныеРаботы,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТяжелыеИПрочиеРаботы,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПустаяСсылка,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Опасный,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Вредный1,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Вредный2,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Вредный3,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Вредный4,
	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуПФР, ЛОЖЬ) КАК ВидДоходаВходитВБазуПФР,
	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуФСС, ЛОЖЬ) КАК ВидДоходаВходитВБазуФСС,
	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС, ЛОЖЬ) КАК ВидДоходаВходитВБазуФСС_НС,
	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуФОМС, ЛОЖЬ) КАК ВидДоходаВходитВБазуФОМС,
	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.АвторскиеВознаграждения, ЛОЖЬ) КАК ВидДоходаАвторскиеВознаграждения,
	|	&НеУчитыватьУстаревшуюОтчетность
	|		ИЛИ НЕ СведенияОДоходах.ПоАктуПроверки
	|			И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, КВАРТАЛ) КАК ВключатьВПервичнуюОтчетностьПФР
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	ВТРазныеФизЛицаОрганизаций КАК ФизЛицаОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеУчета КАК СведенияОДоходах
	|		ПО ФизЛицаОрганизаций.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
	|			И ФизЛицаОрганизаций.ГоловнаяОрганизация = СведенияОДоходах.ГоловнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиницВторичный КАК ИсторияСамостоятельныхКлассификационныхЕдиницВторичный
	|		ПО (СведенияОДоходах.Подразделение = ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.СтруктурнаяЕдиница)
	|			И (СведенияОДоходах.Период МЕЖДУ ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.ДатаНачала И ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.ДатаОкончания)
	|ГДЕ
	|	СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
	|	И СведенияОДоходах.Регистратор <> &ИсключаемыйРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.СКЕ КАК Организация,
	|	ВременнаяТаблица.ПериодРегистрации КАК Период
	|ПОМЕСТИТЬ ВТПереченьСКЕ
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ВременнаяТаблица";

	Если Не ТолькоРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
#Вставка
	//begin fix Клещ А.Н. 12.09.2019 &КлассУсловийТруда,//СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда КАК КлассУсловийТруда, 
	ТекстЗапроса = ?(НачалоПериода <Дата('20250101'),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка) КАК КлассУсловийТруда"),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда КАК КлассУсловийТруда"));
	//end fix Клещ А.Н. 12.09.2019
#КонецВставки
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ВсеЗаписи = Истина;

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
	"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев",
	Запрос.МенеджерВременныхТаблиц,
	ТолькоРазрешенные,
	ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
	"ВТПереченьСКЕ",
	"Организация"),
	ПараметрыПостроения);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СведенияОбИнвалидностиФизическихЛиц.Период, МЕСЯЦ) КАК Период,
	|	СведенияОбИнвалидностиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(СведенияОбИнвалидностиФизическихЛиц.Инвалидность, ЛОЖЬ) КАК Инвалид,
	|	СведенияОбИнвалидностиФизическихЛиц.ДатаВыдачи КАК СправкаОбИнвалидностиДатаВыдачи,
	|	СведенияОбИнвалидностиФизическихЛиц.СрокДействияСправки КАК СправкаОбИнвалидностиСрокДействия
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	ВТСведенияОбИнвалидностиФизическихЛицСрезПоследних КАК СведенияОбИнвалидностиФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносов.Период, МЕСЯЦ) КАК Период,
	|	ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
	|		ИНАЧЕ ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа = ОписаниеТарифов.ВидТарифа
	|			И (ГОД(ПрименяемыеТарифыСтраховыхВзносов.Период) = ОписаниеТарифов.РасчетныйПериод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, ГОД) КАК РасчетныйПериод,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ПериодРегистрации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПериодРегистрации,
	|	СписокФизЛиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	СписокФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(СписокФизЛиц.ФизическоеЛицо.ДатаРождения) < 1967
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НачислятьНакопительнуюЧасть,
	|	СписокФизЛиц.ФизическоеЛицо.ФИО КАК ФизическоеЛицоНаименование,
	|	ДанныеОбИнвалидности.Инвалид КАК Инвалид,
	|	ВЫБОР
	|		КОГДА НЕ ЛьготыПоФСС_НСДляОрганизаций.ПредоставлятьЛьготуПоИнвалидам
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеОбИнвалидности.Инвалид
	|			ТОГДА ИСТИНА
	|		КОГДА ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ОрганизацияИнвалидов
	|	КОНЕЦ КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
	|	ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
	|	ДанныеОПравеНаСтрахование.ЗастрахованПФР КАК ЗастрахованПФР,
	|	ДанныеОПравеНаСтрахование.ЗастрахованФОМС КАК ЗастрахованФОМС,
	|	ДанныеОПравеНаСтрахование.ЗастрахованФСС КАК ЗастрахованФСС,
	|	ДанныеОПравеНаСтрахование.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляОтраслейПострадавшихОтКоронавируснойИнфекции)
	|				И НЕ ЕСТЬNULL(ОписаниеТарифаОрганизации.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|		КОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф
	|		КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|				И НЕ ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
	|				И НЕ ЕСТЬNULL(ОписаниеТарифаОрганизации.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|		КОГДА ДанныеОбИнвалидности.Инвалид
	|				И ОписаниеТарифаОрганизации.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифаОрганизации.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И ДоходыПоФизлицам.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ЕНВД)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
	|		КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяЕНВД, ЛОЖЬ) КАК ОблагаетсяЕНВД,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)) КАК ВидДохода,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Начисление, ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)) КАК Начисление,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР, ЛОЖЬ) КАК ВходитВБазуПФР,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС, ЛОЖЬ) КАК ВходитВБазуФСС,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС_НС, ЛОЖЬ) КАК ВходитВБазуФСС_НС,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФОМС, ЛОЖЬ) КАК ВходитВБазуФОМС,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяВзносамиНаДоплатуШахтерам, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией, ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ЕСТЬNULL(ДоходыПоФизлицам.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) КАК КлассУсловийТруда,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяВзносамиНаДоплатуЛетчикам, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ДоходыПоФизлицам.ВидДохода В (&ВидыДохода)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.Трудовой)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.ГражданскоПравовой)
	|		КОНЕЦ, ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.ПустаяСсылка)) КАК ТипДоговора,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК Скидка,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК СуммаПФР,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК СкидкаПФР,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК СуммаФОМС,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК СкидкаФОМС,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК СуммаФСС,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК СкидкаФСС,
	|	ВЫБОР
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР, ЛОЖЬ)
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПФР,
	|	ВЫБОР
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованФОМС
	|				И ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФОМС, ЛОЖЬ)
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаФОМС,
	|	ВЫБОР
	|		КОГДА (ДанныеОПравеНаСтрахование.ЗастрахованФСС
	|				ИЛИ ДанныеОПравеНаСтрахование.ЗастрахованФССкакИностранец)
	|				И ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС, ЛОЖЬ)
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаФСС,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС_НС
	|			ТОГДА ДоходыПоФизлицам.Сумма - ВЫБОР
	|					КОГДА ДоходыПоФизлицам.ВидДоходаАвторскиеВознаграждения
	|						ТОГДА 0
	|					ИНАЧЕ ДоходыПоФизлицам.Скидка
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаФСС_НС,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
	|				И ДоходыПоФизлицам.ПустаяСсылка
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботы,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
	|				И ДоходыПоФизлицам.ПустаяСсылка
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботы,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
	|				И ДоходыПоФизлицам.Опасный
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыОпасный,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
	|				И ДоходыПоФизлицам.Опасный
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыОпасный,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
	|				И ДоходыПоФизлицам.Вредный1
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный1,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
	|				И ДоходыПоФизлицам.Вредный1
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный1,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
	|				И ДоходыПоФизлицам.Вредный2
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный2,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
	|				И ДоходыПоФизлицам.Вредный2
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный2,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
	|				И ДоходыПоФизлицам.Вредный3
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный3,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
	|				И ДоходыПоФизлицам.Вредный3
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный3,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
	|				И ДоходыПоФизлицам.Вредный4
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный4,
	|	ВЫБОР
	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
	|				И ДоходыПоФизлицам.Вредный4
	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный4,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор,
	|	ЕСТЬNULL(ДоходыПоФизлицам.НомерСтроки, 0) КАК НомерСтроки,
	|	ЕСТЬNULL(ДоходыПоФизлицам.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ДоходыПоФизлицам.СКЕ, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК СКЕ,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачала,
	|	ЕСТЬNULL(ДоходыПоФизлицам.ВключатьВПервичнуюОтчетностьПФР, ИСТИНА) КАК ВключатьВПервичнуюОтчетностьПФР,
	|	ЕСТЬNULL(СтавкаВзноса.Ставка, 0) КАК СтавкаНаНСиПЗ,
	|	0 КАК МРОТзаМесяц
	|ПОМЕСТИТЬ ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС
	|ИЗ
	|	ВТПериодыФизЛицОрганизаций КАК СписокФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоФизлицамМесяцам КАК ДоходыПоФизлицам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних КАК СтавкаВзноса
	|			ПО ДоходыПоФизлицам.ПериодРегистрации = СтавкаВзноса.Период
	|				И ДоходыПоФизлицам.СКЕ = СтавкаВзноса.Организация
	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ДоходыПоФизлицам.ГоловнаяОрганизация
	|			И СписокФизЛиц.ФизическоеЛицо = ДоходыПоФизлицам.ФизическоеЛицо
	|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ДоходыПоФизлицам.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифаОрганизации
	|			ПО ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ОписаниеТарифаОрганизации.ВидТарифа
	|				И (ГОД(ИспользуемыеТарифы.Период) = ОписаниеТарифаОрганизации.РасчетныйПериод)
	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ИспользуемыеТарифы.ГоловнаяОрганизация
	|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ИспользуемыеТарифы.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносовСрезПоследних
	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ГоловнаяОрганизация
	|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.Период, МЕСЯЦ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛьготыПоФСС_НСДляОрганизаций КАК ЛьготыПоФСС_НСДляОрганизаций
	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ЛьготыПоФСС_НСДляОрганизаций.ГоловнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				КОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
	|					ТОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ГОД(СписокФизЛиц.Период) = ОписаниеТарифов.РасчетныйПериод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК ДанныеОбИнвалидности
	|		ПО (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ДанныеОбИнвалидности.Период)
	|			И СписокФизЛиц.ФизическоеЛицо = ДанныеОбИнвалидности.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравахНаСтрахование КАК ДанныеОПравеНаСтрахование
	|		ПО (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ДанныеОПравеНаСтрахование.Период)
	|			И СписокФизЛиц.ФизическоеЛицо = ДанныеОПравеНаСтрахование.ФизическоеЛицо
	|			И СписокФизЛиц.ГоловнаяОрганизация = ДанныеОПравеНаСтрахование.ГоловнаяОрганизация";
	Если Не ТолькоРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();

	ТаблицыКУничтожению = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВТПериодыРасширенныхСведенийОДоходах");
	ТаблицыКУничтожению.Добавить("ВТДоходыПоФизлицамМесяцам");
	ТаблицыКУничтожению.Добавить("ВТРазныеФизЛицаОрганизаций");
	ТаблицыКУничтожению.Добавить("ВТДанныеУчета");
	ТаблицыКУничтожению.Добавить("ВТТарифыСтраховыхВзносовСрезПоследних");
	ТаблицыКУничтожению.Добавить("ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних");
	ТаблицыКУничтожению.Добавить("ВТСведенияОбИнвалидностиФизическихЛицСрезПоследних");
	ТаблицыКУничтожению.Добавить("ВТДанныеОПравахНаСтрахование");
	ТаблицыКУничтожению.Добавить("ВТПериодыФизЛицОрганизаций");
	ТаблицыКУничтожению.Добавить("ВТЛьготыПоФСС_НСДляОрганизаций");
	ТаблицыКУничтожению.Добавить("ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС");
	ТаблицыКУничтожению.Добавить("ВТФизЛицаКОбработке");
	ТаблицыКУничтожению.Добавить("ВТПереченьСКЕ");

	ИмяТаблицы = "ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС";

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОДоходах.РасчетныйПериод КАК РасчетныйПериод,
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТФизЛицаКОбработке
	|ИЗ
	|	ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)";
	Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда

		ТаблицыКУничтожению.Добавить("ВТМинимальнаяОплатаТрудаРФСрезПоследних");
		ТаблицыКУничтожению.Добавить("ВТМесяцыТарифаМСП");
		ТаблицыКУничтожению.Добавить("ВТДанныеДляВыделенияМРОТ");

		// Формируем список лет для чтения МРОТ.
		ИзмеренияДаты = Новый ТаблицаЗначений();
		ИзмеренияДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты()));
		НачалоГода = НачалоГода(НачалоПериода);
		// первый год
		ИзмеренияДаты.Добавить().Период = НачалоГода;
		// прибавим остальные годы
		Пока НачалоГода < НачалоГода(ОкончаниеПериода) Цикл
			НачалоГода = КонецГода(НачалоГода) + 1;
			ИзмеренияДаты.Добавить().Период = НачалоГода;
		КонецЦикла;

		// Получаем временные таблицы, используя общие алгоритмы.
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;

		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МинимальнаяОплатаТрудаРФ",
		Запрос.МенеджерВременныхТаблиц,
		ТолькоРазрешенные,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИзмеренияДаты),
		ПараметрыПостроения);

		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.РасчетныйПериод КАК РасчетныйПериод,
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТМесяцыТарифаМСП
		|ИЗ
		|	ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.РасчетныйПериод КАК РасчетныйПериод,
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МинимальнаяОплатаТрудаРФ.Размер КАК РазмерМРОТ,
		|	СУММА(СведенияОДоходах.БазаПФР) КАК БазаПФР,
		|	СУММА(СведенияОДоходах.БазаФОМС) КАК БазаФОМС,
		|	СУММА(СведенияОДоходах.БазаФСС) КАК БазаФСС
		|ПОМЕСТИТЬ ВТДанныеДляВыделенияМРОТ
		|ИЗ
		|	ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияОДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМесяцыТарифаМСП КАК МесяцыТарифаМСП
		|		ПО СведенияОДоходах.Период = МесяцыТарифаМСП.Период
		|			И СведенияОДоходах.ГоловнаяОрганизация = МесяцыТарифаМСП.ГоловнаяОрганизация
		|			И СведенияОДоходах.ФизическоеЛицо = МесяцыТарифаМСП.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМинимальнаяОплатаТрудаРФСрезПоследних КАК МинимальнаяОплатаТрудаРФ
		|		ПО СведенияОДоходах.РасчетныйПериод = МинимальнаяОплатаТрудаРФ.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	МинимальнаяОплатаТрудаРФ.Размер,
		|	СведенияОДоходах.РасчетныйПериод,
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ГоловнаяОрганизация,
		|	СведенияОДоходах.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Период КАК Период,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.РасчетныйПериод КАК РасчетныйПериод,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ПериодРегистрации КАК ПериодРегистрации,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Организация КАК Организация,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Инвалид КАК Инвалид,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованПФР КАК ЗастрахованПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФСС КАК ЗастрахованФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ДанныеДляВыделенияМРОТ.РазмерМРОТ ЕСТЬ НЕ NULL 
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства)
		|		ИНАЧЕ СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидДохода КАК ВидДохода,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Начисление КАК Начисление,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуПФР КАК ВходитВБазуПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФСС КАК ВходитВБазуФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.КлассУсловийТруда КАК КлассУсловийТруда,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ТипДоговора КАК ТипДоговора,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Сумма КАК Сумма,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Скидка КАК Скидка,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаПФР КАК СуммаПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаПФР КАК СкидкаПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаФОМС КАК СуммаФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаФОМС КАК СкидкаФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаФСС КАК СуммаФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаФСС КАК СкидкаФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПФР КАК БазаПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФОМС КАК БазаФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФСС КАК БазаФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФСС_НС КАК БазаФСС_НС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботы КАК БазаПодземныеИВредныеРаботы,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботы КАК БазаТяжелыеИПрочиеРаботы,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыОпасный КАК БазаПодземныеИВредныеРаботыОпасный,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыОпасный КАК БазаТяжелыеИПрочиеРаботыОпасный,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный1 КАК БазаПодземныеИВредныеРаботыВредный1,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный1 КАК БазаТяжелыеИПрочиеРаботыВредный1,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный2 КАК БазаПодземныеИВредныеРаботыВредный2,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный2 КАК БазаТяжелыеИПрочиеРаботыВредный2,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный3 КАК БазаПодземныеИВредныеРаботыВредный3,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный3 КАК БазаТяжелыеИПрочиеРаботыВредный3,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный4 КАК БазаПодземныеИВредныеРаботыВредный4,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный4 КАК БазаТяжелыеИПрочиеРаботыВредный4,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Регистратор КАК Регистратор,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.НомерСтроки КАК НомерСтроки,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Подразделение КАК Подразделение,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ДатаНачала КАК ДатаНачала,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СКЕ КАК СКЕ,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ,
		|	ДанныеДляВыделенияМРОТ.РазмерМРОТ КАК РазмерМРОТ,
		|	ЕСТЬNULL(ДанныеДляВыделенияМРОТ.БазаПФР > ДанныеДляВыделенияМРОТ.РазмерМРОТ, ЛОЖЬ) КАК ТребуетсяВыделятьМРОТ_ПФР,
		|	ЕСТЬNULL(ДанныеДляВыделенияМРОТ.БазаФОМС > ДанныеДляВыделенияМРОТ.РазмерМРОТ, ЛОЖЬ) КАК ТребуетсяВыделятьМРОТ_ФОМС,
		|	ЕСТЬNULL(ДанныеДляВыделенияМРОТ.БазаФСС > ДанныеДляВыделенияМРОТ.РазмерМРОТ, ЛОЖЬ) КАК ТребуетсяВыделятьМРОТ_ФСС,
		|	ДанныеДляВыделенияМРОТ.БазаПФР КАК БазаЗаМесяцПФР,
		|	ДанныеДляВыделенияМРОТ.БазаФОМС КАК БазаЗаМесяцФОМС,
		|	ДанныеДляВыделенияМРОТ.БазаФСС КАК БазаЗаМесяцФСС
		|ИЗ
		|	ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияБезУточненияЗастрахованностиИностранцевВФСС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛицаКОбработке КАК ФизЛицаКОбработке
		|		ПО СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицо = ФизЛицаКОбработке.ФизическоеЛицо
		|			И СведенияБезУточненияЗастрахованностиИностранцевВФСС.РасчетныйПериод = ФизЛицаКОбработке.РасчетныйПериод
		|			И СведенияБезУточненияЗастрахованностиИностранцевВФСС.ГоловнаяОрганизация = ФизЛицаКОбработке.ГоловнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляВыделенияМРОТ КАК ДанныеДляВыделенияМРОТ
		|		ПО СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицо = ДанныеДляВыделенияМРОТ.ФизическоеЛицо
		|			И СведенияБезУточненияЗастрахованностиИностранцевВФСС.Период = ДанныеДляВыделенияМРОТ.Период
		|			И СведенияБезУточненияЗастрахованностиИностранцевВФСС.ГоловнаяОрганизация = ДанныеДляВыделенияМРОТ.ГоловнаяОрганизация
		|ГДЕ
		|	ФизЛицаКОбработке.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГоловнаяОрганизация,
		|	ФизическоеЛицо,
		|	Период";

		Результат = Запрос.Выполнить().Выгрузить();
		ДобавленныеСтроки = Результат.СкопироватьКолонки();

		ГоловнаяОрганизация = Неопределено;
		Период = Неопределено;
		ФизическоеЛицо = Неопределено;
		ОсновнойТариф = Справочники.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим;
		ЗаменяемыйТариф = Справочники.ВидыТарифовСтраховыхВзносов.ДляСубъектовМалогоПредпринимательства;
		СтрокаПоиска = "ФизическоеЛицо,Период,ГоловнаяОрганизация";
		Результат.Индексы.Добавить(СтрокаПоиска);
		СтруктураПоиска = Новый Структура(СтрокаПоиска); 
		СтрокиМесяца = Неопределено;

		Для каждого ТекущаяСтрока Из Результат Цикл

			Если ГоловнаяОрганизация <> ТекущаяСтрока.ГоловнаяОрганизация 
				Или Период <> ТекущаяСтрока.Период 
				Или ФизическоеЛицо <> ТекущаяСтрока.ФизическоеЛицо Тогда

				Если СтрокиМесяца <> Неопределено Тогда
					ВыделитьБазуМРОТНаОсновнойТариф(СтрокиМесяца, ДобавленныеСтроки, ОсновнойТариф)
				КонецЕсли;

				СтрокиМесяца = Неопределено;
				ЗаменятьНаОсновнойТарифВсеЗаписи = Не ТекущаяСтрока.ТребуетсяВыделятьМРОТ_ПФР И Не ТекущаяСтрока.ТребуетсяВыделятьМРОТ_ФОМС И Не ТекущаяСтрока.ТребуетсяВыделятьМРОТ_ФСС;
				Если Не ЗаменятьНаОсновнойТарифВсеЗаписи Тогда
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
					СтрокиМесяца = Результат.НайтиСтроки(СтруктураПоиска);
				КонецЕсли;
				ГоловнаяОрганизация = ТекущаяСтрока.ГоловнаяОрганизация; 
				Период = ТекущаяСтрока.Период; 
				ФизическоеЛицо = ТекущаяСтрока.ФизическоеЛицо;

			КонецЕсли;

			Если ЗаменятьНаОсновнойТарифВсеЗаписи Тогда
				НоваяСтрока = ДобавленныеСтроки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				Если НоваяСтрока.ВидТарифаСтраховыхВзносов = ЗаменяемыйТариф Тогда
					НоваяСтрока.ВидТарифаСтраховыхВзносов = ОсновнойТариф;
				КонецЕсли;
				Продолжить;
			КонецЕсли;

			Если ТекущаяСтрока.БазаПФР = 0 И ТекущаяСтрока.БазаФОМС = 0 И ТекущаяСтрока.БазаФСС = 0 Тогда
				НоваяСтрока = ДобавленныеСтроки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				Если НоваяСтрока.ВидТарифаСтраховыхВзносов = ЗаменяемыйТариф Тогда
					НоваяСтрока.ВидТарифаСтраховыхВзносов = ОсновнойТариф;
				КонецЕсли;
				Продолжить;
			КонецЕсли;

		КонецЦикла;	
		Если СтрокиМесяца <> Неопределено Тогда
			ВыделитьБазуМРОТНаОсновнойТариф(СтрокиМесяца, ДобавленныеСтроки, ОсновнойТариф)
		КонецЕсли;

		Запрос.УстановитьПараметр("ДанныеСВыделеннымМРОТ", ДобавленныеСтроки); Результат = Неопределено; ДобавленныеСтроки = Неопределено;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Период КАК Период,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.РасчетныйПериод КАК РасчетныйПериод,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ПериодРегистрации КАК ПериодРегистрации,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Организация КАК Организация,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Инвалид КАК Инвалид,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованПФР КАК ЗастрахованПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФСС КАК ЗастрахованФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Сотрудник КАК Сотрудник,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидДохода КАК ВидДохода,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Начисление КАК Начисление,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуПФР КАК ВходитВБазуПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФСС КАК ВходитВБазуФСС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.КлассУсловийТруда КАК КлассУсловийТруда,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ТипДоговора КАК ТипДоговора,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.Сумма КАК ЧИСЛО(20, 2)), 0) КАК Сумма,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.Скидка КАК ЧИСЛО(20, 2)), 0) КАК Скидка,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаПФР КАК ЧИСЛО(20, 2)), 0) КАК СуммаПФР,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаПФР КАК ЧИСЛО(20, 2)), 0) КАК СкидкаПФР,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаФОМС КАК ЧИСЛО(20, 2)), 0) КАК СуммаФОМС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаФОМС КАК ЧИСЛО(20, 2)), 0) КАК СкидкаФОМС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаФСС КАК ЧИСЛО(20, 2)), 0) КАК СуммаФСС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаФСС КАК ЧИСЛО(20, 2)), 0) КАК СкидкаФСС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПФР КАК ЧИСЛО(20, 2)), 0) КАК БазаПФР,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФОМС КАК ЧИСЛО(20, 2)), 0) КАК БазаФОМС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФСС КАК ЧИСЛО(20, 2)), 0) КАК БазаФСС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФСС_НС КАК ЧИСЛО(20, 2)), 0) КАК БазаФСС_НС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботы КАК ЧИСЛО(20, 2)), 0) КАК БазаПодземныеИВредныеРаботы,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботы КАК ЧИСЛО(20, 2)), 0) КАК БазаТяжелыеИПрочиеРаботы,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыОпасный КАК ЧИСЛО(20, 2)), 0) КАК БазаПодземныеИВредныеРаботыОпасный,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыОпасный КАК ЧИСЛО(20, 2)), 0) КАК БазаТяжелыеИПрочиеРаботыОпасный,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный1 КАК ЧИСЛО(20, 2)), 0) КАК БазаПодземныеИВредныеРаботыВредный1,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный1 КАК ЧИСЛО(20, 2)), 0) КАК БазаТяжелыеИПрочиеРаботыВредный1,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный2 КАК ЧИСЛО(20, 2)), 0) КАК БазаПодземныеИВредныеРаботыВредный2,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный2 КАК ЧИСЛО(20, 2)), 0) КАК БазаТяжелыеИПрочиеРаботыВредный2,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный3 КАК ЧИСЛО(20, 2)), 0) КАК БазаПодземныеИВредныеРаботыВредный3,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный3 КАК ЧИСЛО(20, 2)), 0) КАК БазаТяжелыеИПрочиеРаботыВредный3,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный4 КАК ЧИСЛО(20, 2)), 0) КАК БазаПодземныеИВредныеРаботыВредный4,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный4 КАК ЧИСЛО(20, 2)), 0) КАК БазаТяжелыеИПрочиеРаботыВредный4,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Регистратор КАК Регистратор,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.НомерСтроки КАК НомерСтроки,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.Подразделение КАК Подразделение,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ДатаНачала КАК ДатаНачала,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СКЕ КАК СКЕ,
		|	СведенияБезУточненияЗастрахованностиИностранцевВФСС.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ
		|ПОМЕСТИТЬ ВТДанныеСВыделеннымМРОТ
		|ИЗ
		|	&ДанныеСВыделеннымМРОТ КАК СведенияБезУточненияЗастрахованностиИностранцевВФСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСВыделеннымМРОТ.Период КАК Период,
		|	ДанныеСВыделеннымМРОТ.РасчетныйПериод КАК РасчетныйПериод,
		|	ДанныеСВыделеннымМРОТ.ПериодРегистрации КАК ПериодРегистрации,
		|	ДанныеСВыделеннымМРОТ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ДанныеСВыделеннымМРОТ.Организация КАК Организация,
		|	ДанныеСВыделеннымМРОТ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеСВыделеннымМРОТ.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
		|	ДанныеСВыделеннымМРОТ.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
		|	ДанныеСВыделеннымМРОТ.Инвалид КАК Инвалид,
		|	ДанныеСВыделеннымМРОТ.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	ДанныеСВыделеннымМРОТ.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованПФР КАК ЗастрахованПФР,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованФСС КАК ЗастрахованФСС,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|	ДанныеСВыделеннымМРОТ.Сотрудник КАК Сотрудник,
		|	ДанныеСВыделеннымМРОТ.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ДанныеСВыделеннымМРОТ.ВидДохода КАК ВидДохода,
		|	ДанныеСВыделеннымМРОТ.Начисление КАК Начисление,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуПФР КАК ВходитВБазуПФР,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуФСС КАК ВходитВБазуФСС,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДанныеСВыделеннымМРОТ.КлассУсловийТруда КАК КлассУсловийТруда,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДанныеСВыделеннымМРОТ.ТипДоговора КАК ТипДоговора,
		|	СУММА(ДанныеСВыделеннымМРОТ.Сумма) КАК Сумма,
		|	СУММА(ДанныеСВыделеннымМРОТ.Скидка) КАК Скидка,
		|	СУММА(ДанныеСВыделеннымМРОТ.СуммаПФР) КАК СуммаПФР,
		|	СУММА(ДанныеСВыделеннымМРОТ.СкидкаПФР) КАК СкидкаПФР,
		|	СУММА(ДанныеСВыделеннымМРОТ.СуммаФОМС) КАК СуммаФОМС,
		|	СУММА(ДанныеСВыделеннымМРОТ.СкидкаФОМС) КАК СкидкаФОМС,
		|	СУММА(ДанныеСВыделеннымМРОТ.СуммаФСС) КАК СуммаФСС,
		|	СУММА(ДанныеСВыделеннымМРОТ.СкидкаФСС) КАК СкидкаФСС,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПФР) КАК БазаПФР,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаФОМС) КАК БазаФОМС,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаФСС) КАК БазаФСС,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаФСС_НС) КАК БазаФСС_НС,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботы) КАК БазаПодземныеИВредныеРаботы,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботы) КАК БазаТяжелыеИПрочиеРаботы,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыОпасный) КАК БазаПодземныеИВредныеРаботыОпасный,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыОпасный) КАК БазаТяжелыеИПрочиеРаботыОпасный,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный1) КАК БазаПодземныеИВредныеРаботыВредный1,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный1) КАК БазаТяжелыеИПрочиеРаботыВредный1,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный2) КАК БазаПодземныеИВредныеРаботыВредный2,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный2) КАК БазаТяжелыеИПрочиеРаботыВредный2,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный3) КАК БазаПодземныеИВредныеРаботыВредный3,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный3) КАК БазаТяжелыеИПрочиеРаботыВредный3,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный4) КАК БазаПодземныеИВредныеРаботыВредный4,
		|	СУММА(ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный4) КАК БазаТяжелыеИПрочиеРаботыВредный4,
		|	ДанныеСВыделеннымМРОТ.Регистратор КАК Регистратор,
		|	ДанныеСВыделеннымМРОТ.НомерСтроки КАК ЗаменяемыйНомерСтроки,
		|	ДанныеСВыделеннымМРОТ.Подразделение КАК Подразделение,
		|	ДанныеСВыделеннымМРОТ.ДатаНачала КАК ДатаНачала,
		|	ДанныеСВыделеннымМРОТ.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР,
		|	ДанныеСВыделеннымМРОТ.СКЕ КАК СКЕ,
		|	ДанныеСВыделеннымМРОТ.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ
		|ПОМЕСТИТЬ ВТДанныеСВыделеннымМРОТСгруппированные
		|ИЗ
		|	ВТДанныеСВыделеннымМРОТ КАК ДанныеСВыделеннымМРОТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеСВыделеннымМРОТ.Период,
		|	ДанныеСВыделеннымМРОТ.РасчетныйПериод,
		|	ДанныеСВыделеннымМРОТ.ПериодРегистрации,
		|	ДанныеСВыделеннымМРОТ.ГоловнаяОрганизация,
		|	ДанныеСВыделеннымМРОТ.Организация,
		|	ДанныеСВыделеннымМРОТ.ФизическоеЛицо,
		|	ДанныеСВыделеннымМРОТ.НачислятьНакопительнуюЧасть,
		|	ДанныеСВыделеннымМРОТ.ФизическоеЛицоНаименование,
		|	ДанныеСВыделеннымМРОТ.Инвалид,
		|	ДанныеСВыделеннымМРОТ.ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	ДанныеСВыделеннымМРОТ.ВидЗастрахованногоЛица,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованПФР,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованФОМС,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованФСС,
		|	ДанныеСВыделеннымМРОТ.ЗастрахованФССкакИностранец,
		|	ДанныеСВыделеннымМРОТ.Сотрудник,
		|	ДанныеСВыделеннымМРОТ.ВидТарифаСтраховыхВзносов,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяЕНВД,
		|	ДанныеСВыделеннымМРОТ.ВидДохода,
		|	ДанныеСВыделеннымМРОТ.Начисление,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуПФР,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуФСС,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуФСС_НС,
		|	ДанныеСВыделеннымМРОТ.ВходитВБазуФОМС,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ДанныеСВыделеннымМРОТ.КлассУсловийТруда,
		|	ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ДанныеСВыделеннымМРОТ.ТипДоговора,
		|	ДанныеСВыделеннымМРОТ.Регистратор,
		|	ДанныеСВыделеннымМРОТ.НомерСтроки,
		|	ДанныеСВыделеннымМРОТ.Подразделение,
		|	ДанныеСВыделеннымМРОТ.ДатаНачала,
		|	ДанныеСВыделеннымМРОТ.ВключатьВПервичнуюОтчетностьПФР,
		|	ДанныеСВыделеннымМРОТ.СКЕ,
		|	ДанныеСВыделеннымМРОТ.СтавкаНаНСиПЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДанные.Период КАК Период,
		|	ВсеДанные.РасчетныйПериод КАК РасчетныйПериод,
		|	ВсеДанные.ПериодРегистрации КАК ПериодРегистрации,
		|	ВсеДанные.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВсеДанные.Организация КАК Организация,
		|	ВсеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеДанные.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
		|	ВсеДанные.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
		|	ВсеДанные.Инвалид КАК Инвалид,
		|	ВсеДанные.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|	ВсеДанные.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|	ВсеДанные.ЗастрахованПФР КАК ЗастрахованПФР,
		|	ВсеДанные.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|	ВсеДанные.ЗастрахованФСС КАК ЗастрахованФСС,
		|	ВсеДанные.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|	ВсеДанные.Сотрудник КАК Сотрудник,
		|	ВсеДанные.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ВсеДанные.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ВсеДанные.ВидДохода КАК ВидДохода,
		|	ВсеДанные.Начисление КАК Начисление,
		|	ВсеДанные.ВходитВБазуПФР КАК ВходитВБазуПФР,
		|	ВсеДанные.ВходитВБазуФСС КАК ВходитВБазуФСС,
		|	ВсеДанные.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|	ВсеДанные.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
		|	ВсеДанные.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|	ВсеДанные.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ВсеДанные.КлассУсловийТруда КАК КлассУсловийТруда,
		|	ВсеДанные.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|	ВсеДанные.ТипДоговора КАК ТипДоговора,
		|	ВсеДанные.Сумма КАК Сумма,
		|	ВсеДанные.Скидка КАК Скидка,
		|	ВсеДанные.СуммаПФР КАК СуммаПФР,
		|	ВсеДанные.СкидкаПФР КАК СкидкаПФР,
		|	ВсеДанные.СуммаФОМС КАК СуммаФОМС,
		|	ВсеДанные.СкидкаФОМС КАК СкидкаФОМС,
		|	ВсеДанные.СуммаФСС КАК СуммаФСС,
		|	ВсеДанные.СкидкаФСС КАК СкидкаФСС,
		|	ВсеДанные.БазаПФР КАК БазаПФР,
		|	ВсеДанные.БазаФОМС КАК БазаФОМС,
		|	ВсеДанные.БазаФСС КАК БазаФСС,
		|	ВсеДанные.БазаФСС_НС КАК БазаФСС_НС,
		|	ВсеДанные.БазаПодземныеИВредныеРаботы КАК БазаПодземныеИВредныеРаботы,
		|	ВсеДанные.БазаТяжелыеИПрочиеРаботы КАК БазаТяжелыеИПрочиеРаботы,
		|	ВсеДанные.БазаПодземныеИВредныеРаботыОпасный КАК БазаПодземныеИВредныеРаботыОпасный,
		|	ВсеДанные.БазаТяжелыеИПрочиеРаботыОпасный КАК БазаТяжелыеИПрочиеРаботыОпасный,
		|	ВсеДанные.БазаПодземныеИВредныеРаботыВредный1 КАК БазаПодземныеИВредныеРаботыВредный1,
		|	ВсеДанные.БазаТяжелыеИПрочиеРаботыВредный1 КАК БазаТяжелыеИПрочиеРаботыВредный1,
		|	ВсеДанные.БазаПодземныеИВредныеРаботыВредный2 КАК БазаПодземныеИВредныеРаботыВредный2,
		|	ВсеДанные.БазаТяжелыеИПрочиеРаботыВредный2 КАК БазаТяжелыеИПрочиеРаботыВредный2,
		|	ВсеДанные.БазаПодземныеИВредныеРаботыВредный3 КАК БазаПодземныеИВредныеРаботыВредный3,
		|	ВсеДанные.БазаТяжелыеИПрочиеРаботыВредный3 КАК БазаТяжелыеИПрочиеРаботыВредный3,
		|	ВсеДанные.БазаПодземныеИВредныеРаботыВредный4 КАК БазаПодземныеИВредныеРаботыВредный4,
		|	ВсеДанные.БазаТяжелыеИПрочиеРаботыВредный4 КАК БазаТяжелыеИПрочиеРаботыВредный4,
		|	ВсеДанные.Регистратор КАК Регистратор,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
		|	ВсеДанные.Подразделение КАК Подразделение,
		|	ВсеДанные.ДатаНачала КАК ДатаНачала,
		|	ВсеДанные.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР,
		|	ВсеДанные.МРОТзаМесяц КАК МРОТзаМесяц,
		|	ВсеДанные.СКЕ КАК СКЕ,
		|	ВсеДанные.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ
		|ПОМЕСТИТЬ ВТСведенияБезУточненияЗастрахованностиИностранцевВФССОбработанные
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеСВыделеннымМРОТ.Период КАК Период,
		|		ДанныеСВыделеннымМРОТ.РасчетныйПериод КАК РасчетныйПериод,
		|		ДанныеСВыделеннымМРОТ.ПериодРегистрации КАК ПериодРегистрации,
		|		ДанныеСВыделеннымМРОТ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|		ДанныеСВыделеннымМРОТ.Организация КАК Организация,
		|		ДанныеСВыделеннымМРОТ.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ДанныеСВыделеннымМРОТ.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
		|		ДанныеСВыделеннымМРОТ.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
		|		ДанныеСВыделеннымМРОТ.Инвалид КАК Инвалид,
		|		ДанныеСВыделеннымМРОТ.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|		ДанныеСВыделеннымМРОТ.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
		|		ДанныеСВыделеннымМРОТ.ЗастрахованПФР КАК ЗастрахованПФР,
		|		ДанныеСВыделеннымМРОТ.ЗастрахованФОМС КАК ЗастрахованФОМС,
		|		ДанныеСВыделеннымМРОТ.ЗастрахованФСС КАК ЗастрахованФСС,
		|		ДанныеСВыделеннымМРОТ.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
		|		ДанныеСВыделеннымМРОТ.Сотрудник КАК Сотрудник,
		|		ДанныеСВыделеннымМРОТ.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|		ДанныеСВыделеннымМРОТ.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|		ДанныеСВыделеннымМРОТ.ВидДохода КАК ВидДохода,
		|		ДанныеСВыделеннымМРОТ.Начисление КАК Начисление,
		|		ДанныеСВыделеннымМРОТ.ВходитВБазуПФР КАК ВходитВБазуПФР,
		|		ДанныеСВыделеннымМРОТ.ВходитВБазуФСС КАК ВходитВБазуФСС,
		|		ДанныеСВыделеннымМРОТ.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
		|		ДанныеСВыделеннымМРОТ.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
		|		ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
		|		ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		ДанныеСВыделеннымМРОТ.КлассУсловийТруда КАК КлассУсловийТруда,
		|		ДанныеСВыделеннымМРОТ.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|		ДанныеСВыделеннымМРОТ.ТипДоговора КАК ТипДоговора,
		|		ДанныеСВыделеннымМРОТ.Сумма КАК Сумма,
		|		ДанныеСВыделеннымМРОТ.Скидка КАК Скидка,
		|		ДанныеСВыделеннымМРОТ.СуммаПФР КАК СуммаПФР,
		|		ДанныеСВыделеннымМРОТ.СкидкаПФР КАК СкидкаПФР,
		|		ДанныеСВыделеннымМРОТ.СуммаФОМС КАК СуммаФОМС,
		|		ДанныеСВыделеннымМРОТ.СкидкаФОМС КАК СкидкаФОМС,
		|		ДанныеСВыделеннымМРОТ.СуммаФСС КАК СуммаФСС,
		|		ДанныеСВыделеннымМРОТ.СкидкаФСС КАК СкидкаФСС,
		|		ДанныеСВыделеннымМРОТ.БазаПФР КАК БазаПФР,
		|		ДанныеСВыделеннымМРОТ.БазаФОМС КАК БазаФОМС,
		|		ДанныеСВыделеннымМРОТ.БазаФСС КАК БазаФСС,
		|		ДанныеСВыделеннымМРОТ.БазаФСС_НС КАК БазаФСС_НС,
		|		ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботы КАК БазаПодземныеИВредныеРаботы,
		|		ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботы КАК БазаТяжелыеИПрочиеРаботы,
		|		ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыОпасный КАК БазаПодземныеИВредныеРаботыОпасный,
		|		ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыОпасный КАК БазаТяжелыеИПрочиеРаботыОпасный,
		|		ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный1 КАК БазаПодземныеИВредныеРаботыВредный1,
		|		ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный1 КАК БазаТяжелыеИПрочиеРаботыВредный1,
		|		ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный2 КАК БазаПодземныеИВредныеРаботыВредный2,
		|		ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный2 КАК БазаТяжелыеИПрочиеРаботыВредный2,
		|		ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный3 КАК БазаПодземныеИВредныеРаботыВредный3,
		|		ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный3 КАК БазаТяжелыеИПрочиеРаботыВредный3,
		|		ДанныеСВыделеннымМРОТ.БазаПодземныеИВредныеРаботыВредный4 КАК БазаПодземныеИВредныеРаботыВредный4,
		|		ДанныеСВыделеннымМРОТ.БазаТяжелыеИПрочиеРаботыВредный4 КАК БазаТяжелыеИПрочиеРаботыВредный4,
		|		ДанныеСВыделеннымМРОТ.Регистратор КАК Регистратор,
		|		ДанныеСВыделеннымМРОТ.Подразделение КАК Подразделение,
		|		ДанныеСВыделеннымМРОТ.ДатаНачала КАК ДатаНачала,
		|		ДанныеСВыделеннымМРОТ.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР,
		|		МинимальнаяОплатаТрудаРФ.Размер КАК МРОТзаМесяц,
		|		ДанныеСВыделеннымМРОТ.СКЕ КАК СКЕ,
		|		ДанныеСВыделеннымМРОТ.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ
		|	ИЗ
		|		ВТДанныеСВыделеннымМРОТСгруппированные КАК ДанныеСВыделеннымМРОТ
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТМинимальнаяОплатаТрудаРФСрезПоследних КАК МинимальнаяОплатаТрудаРФ
		|			ПО ДанныеСВыделеннымМРОТ.РасчетныйПериод = МинимальнаяОплатаТрудаРФ.Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Период,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.РасчетныйПериод,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ПериодРегистрации,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ГоловнаяОрганизация,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Организация,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицо,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.НачислятьНакопительнуюЧасть,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицоНаименование,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Инвалид,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ИспользоватьЛьготуИнвалидамПоФСС_НС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидЗастрахованногоЛица,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованПФР,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФОМС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФСС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ЗастрахованФССкакИностранец,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Сотрудник,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидТарифаСтраховыхВзносов,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяЕНВД,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВидДохода,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Начисление,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуПФР,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФСС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФСС_НС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВходитВБазуФОМС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиНаДоплатуШахтерам,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.КлассУсловийТруда,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ОблагаетсяВзносамиНаДоплатуЛетчикам,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ТипДоговора,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Сумма,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Скидка,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаПФР,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаПФР,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаФОМС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаФОМС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СуммаФСС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СкидкаФСС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПФР,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФОМС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФСС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаФСС_НС,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботы,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботы,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыОпасный,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыОпасный,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный1,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный1,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный2,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный2,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный3,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный3,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаПодземныеИВредныеРаботыВредный4,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.БазаТяжелыеИПрочиеРаботыВредный4,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Регистратор,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.Подразделение,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ДатаНачала,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.ВключатьВПервичнуюОтчетностьПФР,
		|		МинимальнаяОплатаТрудаРФ.Размер,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СКЕ,
		|		СведенияБезУточненияЗастрахованностиИностранцевВФСС.СтавкаНаНСиПЗ
		|	ИЗ
		|		ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияБезУточненияЗастрахованностиИностранцевВФСС
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаКОбработке КАК ФизЛицаКОбработке
		|			ПО СведенияБезУточненияЗастрахованностиИностранцевВФСС.ФизическоеЛицо = ФизЛицаКОбработке.ФизическоеЛицо
		|				И СведенияБезУточненияЗастрахованностиИностранцевВФСС.РасчетныйПериод = ФизЛицаКОбработке.РасчетныйПериод
		|				И СведенияБезУточненияЗастрахованностиИностранцевВФСС.ГоловнаяОрганизация = ФизЛицаКОбработке.ГоловнаяОрганизация
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТМинимальнаяОплатаТрудаРФСрезПоследних КАК МинимальнаяОплатаТрудаРФ
		|			ПО СведенияБезУточненияЗастрахованностиИностранцевВФСС.РасчетныйПериод = МинимальнаяОплатаТрудаРФ.Период
		|	ГДЕ
		|		ФизЛицаКОбработке.ФизическоеЛицо ЕСТЬ NULL) КАК ВсеДанные";
		Запрос.Выполнить();
		ТаблицыКУничтожению.Добавить("ВТДанныеСВыделеннымМРОТ");
		ТаблицыКУничтожению.Добавить("ВТДанныеСВыделеннымМРОТСгруппированные");
		ТаблицыКУничтожению.Добавить("ВТСведенияБезУточненияЗастрахованностиИностранцевВФССОбработанные");
		ИмяТаблицы = "ВТСведенияБезУточненияЗастрахованностиИностранцевВФССОбработанные";
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации,
	|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходах.Организация КАК Организация,
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
	|	СведенияОДоходах.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
	|	СведенияОДоходах.Инвалид КАК Инвалид,
	|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
	|	СведенияОДоходах.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
	|	СведенияОДоходах.ЗастрахованПФР КАК ЗастрахованПФР,
	|	СведенияОДоходах.ЗастрахованФОМС КАК ЗастрахованФОМС,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ЗастрахованФСС
	|			ТОГДА ИСТИНА
	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
	|				И НЕ ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗастрахованФСС,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
	|				И ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗастрахованФССкакИностранец,
	|	СведенияОДоходах.Сотрудник КАК Сотрудник,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СведенияОДоходах.ВидДохода КАК ВидДохода,
	|	СведенияОДоходах.Начисление КАК Начисление,
	|	СведенияОДоходах.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ТипДоговора КАК ТипДоговора,
	|	СУММА(СведенияОДоходах.Сумма) КАК Сумма,
	|	СУММА(СведенияОДоходах.Скидка) КАК Скидка,
	|	СУММА(СведенияОДоходах.СуммаПФР) КАК СуммаПФР,
	|	СУММА(СведенияОДоходах.СкидкаПФР) КАК СкидкаПФР,
	|	СУММА(СведенияОДоходах.СуммаФОМС) КАК СуммаФОМС,
	|	СУММА(СведенияОДоходах.СкидкаФОМС) КАК СкидкаФОМС,
	|	СУММА(СведенияОДоходах.СуммаФСС) КАК СуммаФСС,
	|	СУММА(СведенияОДоходах.СкидкаФСС) КАК СкидкаФСС,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК БазаПФР,
	|	СУММА(СведенияОДоходах.БазаФОМС) КАК БазаФОМС,
	|	СУММА(СведенияОДоходах.БазаФСС) КАК БазаФСС,
	|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаФСС_НС,
	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) КАК БазаПодземныеИВредныеРаботы,
	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы) КАК БазаТяжелыеИПрочиеРаботы,
	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыОпасный) КАК БазаПодземныеИВредныеРаботыОпасный,
	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыОпасный) КАК БазаТяжелыеИПрочиеРаботыОпасный,
	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный1) КАК БазаПодземныеИВредныеРаботыВредный1,
	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный1) КАК БазаТяжелыеИПрочиеРаботыВредный1,
	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный2) КАК БазаПодземныеИВредныеРаботыВредный2,
	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный2) КАК БазаТяжелыеИПрочиеРаботыВредный2,
	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный3) КАК БазаПодземныеИВредныеРаботыВредный3,
	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный3) КАК БазаТяжелыеИПрочиеРаботыВредный3,
	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный4) КАК БазаПодземныеИВредныеРаботыВредный4,
	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный4) КАК БазаТяжелыеИПрочиеРаботыВредный4,
	|	0 КАК СуммаПревысившаяПределПФР,
	|	0 КАК СуммаПревысившаяПределФСС,
	|	0 КАК СуммаПревысившаяПределФОМС,
	|	ЛОЖЬ КАК ДобавленнаяСтрока,
	|	СведенияОДоходах.Регистратор КАК Регистратор,
	|	СведенияОДоходах.НомерСтроки КАК НомерСтроки,
	|	СведенияОДоходах.Подразделение КАК Подразделение,
	|	СведенияОДоходах.ДатаНачала КАК ДатаНачала,
	|	СведенияОДоходах.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР,
	|	СведенияОДоходах.СКЕ КАК СКЕ,
	|	СведенияОДоходах.СтавкаНаНСиПЗ КАК СтавкаНаНСиПЗ,
	|	МАКСИМУМ(СведенияОДоходах.МРОТзаМесяц) КАК МРОТзаМесяц
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО СведенияОДоходах.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ГОД(СведенияОДоходах.Период) = ОписаниеТарифов.РасчетныйПериод)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ПериодРегистрации,
	|	СведенияОДоходах.ГоловнаяОрганизация,
	|	СведенияОДоходах.Организация,
	|	СведенияОДоходах.ФизическоеЛицо,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	СведенияОДоходах.ФизическоеЛицоНаименование,
	|	СведенияОДоходах.Инвалид,
	|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС,
	|	СведенияОДоходах.ВидЗастрахованногоЛица,
	|	СведенияОДоходах.ЗастрахованПФР,
	|	СведенияОДоходах.ЗастрахованФОМС,
	|	СведенияОДоходах.Сотрудник,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Начисление,
	|	СведенияОДоходах.ВходитВБазуПФР,
	|	СведенияОДоходах.ВходитВБазуФСС,
	|	СведенияОДоходах.ВходитВБазуФОМС,
	|	СведенияОДоходах.ВходитВБазуФСС_НС,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходах.ТипДоговора,
	|	СведенияОДоходах.Регистратор,
	|	СведенияОДоходах.Подразделение,
	|	СведенияОДоходах.ДатаНачала,
	|	СведенияОДоходах.ВключатьВПервичнуюОтчетностьПФР,
	|	СведенияОДоходах.НомерСтроки,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ЗастрахованФСС
	|			ТОГДА ИСТИНА
	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
	|				И НЕ ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
	|				И ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СведенияОДоходах.СКЕ,
	|	СведенияОДоходах.СтавкаНаНСиПЗ
	|
	|ИМЕЮЩИЕ
	|	(СУММА(СведенияОДоходах.Сумма) <> 0
	|		ИЛИ СУММА(СведенияОДоходах.Скидка) <> 0
	|		ИЛИ СУММА(СведенияОДоходах.БазаПФР) <> 0
	|		ИЛИ СУММА(СведенияОДоходах.БазаФОМС) <> 0
	|		ИЛИ СУММА(СведенияОДоходах.БазаФСС) <> 0
	|		ИЛИ СУММА(СведенияОДоходах.БазаФСС_НС) <> 0)";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС", ИмяТаблицы);
	Если ОставлятьМесяцыБезДоходов Тогда
		НачальнаяПозиция = СтрНайти(ТекстЗапроса, "ИМЕЮЩИЕ");
		ТекстЗапроса = Лев(ТекстЗапроса, НачальнаяПозиция - 1);
	КонецЕсли;   

	Запрос.Текст = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|";
	Запрос.Выполнить();

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, ТаблицыКУничтожению);

КонецПроцедуры

//&Вместо("СформироватьВТРасширенныхСведенийОДоходах")
//// Помещает в переданный МенеджерВременныхТаблиц временные таблицы: 
////	ВТСведенияОДоходах, содержащую данные о доходах, зарегистрированные в учете по страховым взносам, и
////		дополненные сведениями о физлицах и о виде тарифа страховых взносов
//// а также таблицы с промежуточными данными, которые могут быть использованы независимо.
////	1. ВТРазмерыТарифныхСтавок, содержащую данные о ставках взносов.
////  2. ВТДанныеОбИнвалидности, содержащую данные о наличии инвалидности и справке об инвалидности.
////  3. ВТИспользуемыеТарифы, содержащую данные о применяемых помесячно тарифах.
////  4. ВТОписаниеТарифов, содержащую данные о необходимости применения особого тарифа для инвалидов для каждого тарифа
////  страховых взносов.
////
//// Параметры:
////  НачалоПериода - дата -
////  ОкончаниеПериода - дата -
////  ДатаАктуальности - дата -  
////  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер, куда будет помещены сформированные временные таблицы,
////		содержит вр. таблицу ВТФизЛицаОрганизаций с полями
////			ФизическоеЛицо, должно быть непустым
////			ГоловнаяОрганизация, должно быть непустым.
////  ТолькоРазрешенные - булево - флажок, определяющий, надо ли оставлять в запросе только разрешенные при РЛС записи.
////  ДляПервичнойОтчетностиПФР - булево - флажок, определяющий порядок чтения данных из регистров сведений, если Истина,
////                                       не учитываются строки регистров содержащие опоздавшие до следующего отчетного
////                                       периода данные.
////  ИсключатьДоходыРегистратора - булево - 
////  Регистратор - ДокументСсылка - 
////  УчитыватьОпоздавшиеИзмененияПрименяемыхТарифов - булево - флажок, определяющий будут ли прочитаны изменения применяемых
////													тарифов, внесенные задним числом
////  ОставлятьМесяцыБезДоходов - булево - флажок, определяющий оставлять ли в возвращаемой таблице строки с нулевыми доходами.
////
////
//Процедура ВИЛС_СформироватьВТРасширенныхСведенийОДоходах(НачалоПериода, ОкончаниеПериода, ДатаАктуальности, МенеджерВременныхТаблиц, ТолькоРазрешенные, ДляПервичнойОтчетностиПФР = Ложь, ИсключатьДоходыРегистратора = Ложь, Регистратор = Неопределено, УчитыватьОпоздавшиеИзмененияПрименяемыхТарифов = Истина, ОставлятьМесяцыБезДоходов = Ложь) Экспорт 
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Запрос.УстановитьПараметр("НачалоПериода",		НачалоГода(НачалоПериода));
//	Запрос.УстановитьПараметр("ОкончаниеПериода",	ОкончаниеПериода);
//	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
//	Запрос.УстановитьПараметр("НачалоПредшествующегоГода", ДобавитьМесяц(НачалоГода(Мин(НачалоПериода, ДатаАктуальности)), -12));
//	Запрос.УстановитьПараметр("ДатаСтрахованияВременноПребывающих",	ДатаСтрахованияВременноПребывающих());
//	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
//	
//	Если НачалоГода(НачалоПериода) >= ДатаВводаЛьготногоТарифаПоНС_ПЗдляИП() Тогда
//		Запрос.Текст =
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//		|	ИСТИНА КАК ПредоставлятьЛьготуПоИнвалидам
//		|ПОМЕСТИТЬ ВТЛьготыПоФСС_НСДляОрганизаций
//		|ИЗ
//		|	ВТФизЛицаОрганизаций КАК СписокСотрудников";
//	Иначе
//		Запрос.Текст =
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//		|	ИСТИНА КАК ПредоставлятьЛьготуПоИнвалидам
//		|ИЗ
//		|	ВТФизЛицаОрганизаций КАК СписокСотрудников";
//		ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
//		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
//			СтрокаТЗ.ПредоставлятьЛьготуПоИнвалидам = ЗарплатаКадры.ЭтоЮридическоеЛицо(СтрокаТЗ.ГоловнаяОрганизация)
//		КонецЦикла;
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	СписокОрганизаций.ГоловнаяОрганизация,
//		|	СписокОрганизаций.ПредоставлятьЛьготуПоИнвалидам
//		|ПОМЕСТИТЬ ВТЛьготыПоФСС_НСДляОрганизаций
//		|ИЗ
//		|	&ВременнаяТаблица КАК СписокОрганизаций";
//		Запрос.УстановитьПараметр("ВременнаяТаблица", ВременнаяТаблица)
//	КонецЕсли;
//	Запрос.Выполнить();
//	
//	// Формируем список месяцев, в разрезе которых собираем данные.
//	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, КонецМесяца(НачалоГода(НачалоПериода)), КонецМесяца(ОкончаниеПериода),,, "ВТПериодыРасширенныхСведенийОДоходах", Истина);
//	
//	// Получаем временные таблицы, используя общие алгоритмы.
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Периоды.Период КАК Период,
//	|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
//	|ПОМЕСТИТЬ ВТПериодыФизЛицОрганизаций
//	|ИЗ
//	|	ВТФизЛицаОрганизаций КАК СписокСотрудников
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРасширенныхСведенийОДоходах КАК Периоды
//	|		ПО (ИСТИНА)";
//	Запрос.Выполнить();
//	
//	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
//	ПараметрыПостроения.ВсеЗаписи = Истина;
//	ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, ДатаАктуальности, ДляПервичнойОтчетностиПФР И УчитыватьОпоздавшиеИзмененияПрименяемыхТарифов);
//		
//	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
//		"ПрименяемыеТарифыСтраховыхВзносов",
//		Запрос.МенеджерВременныхТаблиц,
//		ТолькоРазрешенные,
//		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
//			"ВТПериодыФизЛицОрганизаций",
//			"ГоловнаяОрганизация"),
//		ПараметрыПостроения);
//		
//	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
//	ПараметрыПостроения.ВсеЗаписи = Истина;
//	ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, ДатаАктуальности, ДляПервичнойОтчетностиПФР);
//		
//	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
//		"СведенияОбИнвалидностиФизическихЛиц",
//		Запрос.МенеджерВременныхТаблиц,
//		ТолькоРазрешенные,
//		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
//			"ВТПериодыФизЛицОрганизаций",
//			"ФизическоеЛицо"),
//		ПараметрыПостроения);
//	
//	СформироватьВТДанныеОПравахНаСтрахование(Запрос.МенеджерВременныхТаблиц, "ВТПериодыФизЛицОрганизаций", ТолькоРазрешенные, ДатаАктуальности, ДляПервичнойОтчетностиПФР);
//	СформироватьВТОписаниеТарифов(НачалоПериода, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц);

//	МассивВидовДохода = Новый Массив;
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеСодержаниеПрокуроров);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.МатпомощьПрокуроров);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.КомпенсацииОблагаемыеВзносамиПрокуроров);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликомНеОблагаемыеФСС_НС);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.КомпенсацииОблагаемыеВзносами);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.МатпомощьПриРожденииРебенка);
//	МассивВидовДохода.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.Матпомощь);
//	Запрос.УстановитьПараметр("ВидыДохода", МассивВидовДохода);
//	
//	ЗарплатаКадры.СоздатьПустуюВТ(МенеджерВременныхТаблиц, "РегистрНакопления.СведенияОДоходахСтраховыеВзносы");
//	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТДанныеОбИнвалидности", Истина);
//	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТИспользуемыеТарифы", Истина);
//	
//	ТекстЗапроса =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	СведенияОДоходахСтраховыеВзносы.Период КАК Период,
//	|	СведенияОДоходахСтраховыеВзносы.Регистратор КАК Регистратор,
//	|	СведенияОДоходахСтраховыеВзносы.НомерСтроки КАК НомерСтроки,
//	|	СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	СведенияОДоходахСтраховыеВзносы.Организация КАК Организация,
//	|	СведенияОДоходахСтраховыеВзносы.ВидДохода КАК ВидДохода,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
//	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
//	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
//	|	СведенияОДоходахСтраховыеВзносы.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
//	|	&КлассУсловийТруда,//СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда КАК КлассУсловийТруда,
//	|	СведенияОДоходахСтраховыеВзносы.Сумма КАК Сумма,
//	|	СведенияОДоходахСтраховыеВзносы.Скидка КАК Скидка,
//	|	СведенияОДоходахСтраховыеВзносы.Сотрудник КАК Сотрудник,
//	|	СведенияОДоходахСтраховыеВзносы.Начисление КАК Начисление,
//	|	СведенияОДоходахСтраховыеВзносы.Подразделение КАК Подразделение,
//	|	СведенияОДоходахСтраховыеВзносы.ДатаНачала КАК ДатаНачала,
//	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода КАК ДатаПолученияДохода,
//	|	СведенияОДоходахСтраховыеВзносы.ПоАктуПроверки КАК ПоАктуПроверки
//	|ПОМЕСТИТЬ ВТДанныеУчета
//	|ИЗ
//	|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
//	|ГДЕ
//	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
//	|	И СведенияОДоходахСтраховыеВзносы.Период МЕЖДУ &НачалоПредшествующегоГода И &ДатаАктуальности
//	|	И СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо В
//	|			(ВЫБРАТЬ
//	|				ФизЛицаОрганизаций.ФизическоеЛицо
//	|			ИЗ
//	|				ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)
//	|	И СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация В
//	|			(ВЫБРАТЬ
//	|				ФизЛицаОрганизаций.ГоловнаяОрганизация
//	|			ИЗ
//	|				ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	СведенияОДоходахСтраховыеВзносы.Период,
//	|	СведенияОДоходахСтраховыеВзносы.Регистратор,
//	|	СведенияОДоходахСтраховыеВзносы.НомерСтроки,
//	|	СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация,
//	|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
//	|	СведенияОДоходахСтраховыеВзносы.Организация,
//	|	СведенияОДоходахСтраховыеВзносы.ВидДохода,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяЕНВД,
//	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомФармацевта,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуЛетчикам,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуШахтерам,
//	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
//	|	СведенияОДоходахСтраховыеВзносы.ЛьготныйТерриториальныйТариф,
//	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
//	|	&КлассУсловийТруда,//СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда,
//	|	СведенияОДоходахСтраховыеВзносы.Сумма,
//	|	СведенияОДоходахСтраховыеВзносы.Скидка,
//	|	СведенияОДоходахСтраховыеВзносы.Сотрудник,
//	|	СведенияОДоходахСтраховыеВзносы.Начисление,
//	|	СведенияОДоходахСтраховыеВзносы.Подразделение,
//	|	СведенияОДоходахСтраховыеВзносы.ДатаНачала,
//	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода,
//	|	СведенияОДоходахСтраховыеВзносы.ПоАктуПроверки
//	|ИЗ
//	|	ВТРегистрНакопления_СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
//	|ГДЕ
//	|	СведенияОДоходахСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
//	|	И СведенияОДоходахСтраховыеВзносы.Период МЕЖДУ &НачалоПредшествующегоГода И &ДатаАктуальности
//	|	И (СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо, СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация) В
//	|			(ВЫБРАТЬ
//	|				ФизЛицаОрганизаций.ФизическоеЛицо,
//	|				ФизЛицаОрганизаций.ГоловнаяОрганизация
//	|			ИЗ
//	|				ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СписокСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	СписокСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
//	|ПОМЕСТИТЬ ВТРазныеФизЛицаОрганизаций
//	|ИЗ
//	|	ВТФизЛицаОрганизаций КАК СписокСотрудников
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	СведенияОДоходах.Организация КАК Организация,
//	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
//	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
//	|	СведенияОДоходах.ВидДохода КАК ВидДохода,
//	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
//	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
//	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
//	|	СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
//	|	СведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
//	|	СведенияОДоходах.Сумма КАК Сумма,
//	|	СведенияОДоходах.Скидка КАК Скидка,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ДатаПолученияДохода < &ДатаСтрахованияВременноПребывающих
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
//	|	КОНЕЦ КАК ЯвляетсяДоходомФармацевта,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ДатаПолученияДохода < &ДатаСтрахованияВременноПребывающих
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
//	|	КОНЕЦ КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ДатаПолученияДохода < &ДатаСтрахованияВременноПребывающих
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
//	|		ИНАЧЕ СведенияОДоходах.ЛьготныйТерриториальныйТариф
//	|	КОНЕЦ КАК ЛьготныйТерриториальныйТариф,
//	|	СведенияОДоходах.Сотрудник КАК Сотрудник,
//	|	СведенияОДоходах.Начисление КАК Начисление,
//	|	СведенияОДоходах.Регистратор КАК Регистратор,
//	|	СведенияОДоходах.НомерСтроки КАК НомерСтроки,
//	|	СведенияОДоходах.Подразделение КАК Подразделение,
//	|	СведенияОДоходах.ДатаНачала КАК ДатаНачала,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПодземныеИВредныеРаботы,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ТяжелыеИПрочиеРаботы,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПустаяСсылка,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК Опасный,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК Вредный1,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК Вредный2,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК Вредный3,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК Вредный4,
//	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуПФР, ЛОЖЬ) КАК ВидДоходаВходитВБазуПФР,
//	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуФСС, ЛОЖЬ) КАК ВидДоходаВходитВБазуФСС,
//	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС, ЛОЖЬ) КАК ВидДоходаВходитВБазуФСС_НС,
//	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.ВходитВБазуФОМС, ЛОЖЬ) КАК ВидДоходаВходитВБазуФОМС,
//	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода.АвторскиеВознаграждения, ЛОЖЬ) КАК ВидДоходаАвторскиеВознаграждения,
//	|	ВЫБОР
//	|		КОГДА НЕ СведенияОДоходах.ПоАктуПроверки
//	|				И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, КВАРТАЛ)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ВключатьВПервичнуюОтчетностьПФР
//	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
//	|ИЗ
//	|	ВТРазныеФизЛицаОрганизаций КАК ФизЛицаОрганизаций
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеУчета КАК СведенияОДоходах
//	|		ПО ФизЛицаОрганизаций.ФизическоеЛицо = СведенияОДоходах.ФизическоеЛицо
//	|			И ФизЛицаОрганизаций.ГоловнаяОрганизация = СведенияОДоходах.ГоловнаяОрганизация
//	|ГДЕ
//	|	СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
//	|	И СведенияОДоходах.Регистратор <> &ИсключаемыйРегистратор
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	НАЧАЛОПЕРИОДА(СведенияОбИнвалидностиФизическихЛиц.Период, МЕСЯЦ) КАК Период,
//	|	СведенияОбИнвалидностиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	ЕСТЬNULL(СведенияОбИнвалидностиФизическихЛиц.Инвалидность, ЛОЖЬ) КАК Инвалид,
//	|	СведенияОбИнвалидностиФизическихЛиц.ДатаВыдачи КАК СправкаОбИнвалидностиДатаВыдачи,
//	|	СведенияОбИнвалидностиФизическихЛиц.СрокДействияСправки КАК СправкаОбИнвалидностиСрокДействия
//	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
//	|ИЗ
//	|	ВТСведенияОбИнвалидностиФизическихЛицСрезПоследних КАК СведенияОбИнвалидностиФизическихЛиц
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносов.Период, МЕСЯЦ) КАК Период,
//	|	ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
//	|		ИНАЧЕ ЕСТЬNULL(ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим))
//	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
//	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
//	|ИЗ
//	|	ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносов
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
//	|		ПО ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа = ОписаниеТарифов.ВидТарифа
//	|			И (ГОД(ПрименяемыеТарифыСтраховыхВзносов.Период) = ОписаниеТарифов.РасчетныйПериод)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) КАК Период,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ПериодРегистрации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПериодРегистрации,
//	|	СписокФизЛиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|	СписокФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	ВЫБОР
//	|		КОГДА ГОД(СписокФизЛиц.ФизическоеЛицо.ДатаРождения) < 1967
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами)
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК НачислятьНакопительнуюЧасть,
//	|	СписокФизЛиц.ФизическоеЛицо.ФИО КАК ФизическоеЛицоНаименование,
//	|	ДанныеОбИнвалидности.Инвалид КАК Инвалид,
//	|	ВЫБОР
//	|		КОГДА НЕ ЛьготыПоФСС_НСДляОрганизаций.ПредоставлятьЛьготуПоИнвалидам
//	|			ТОГДА ЛОЖЬ
//	|		КОГДА ДанныеОбИнвалидности.Инвалид
//	|			ТОГДА ИСТИНА
//	|		КОГДА ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
//	|	ДанныеОПравеНаСтрахование.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
//	|	ДанныеОПравеНаСтрахование.ЗастрахованПФР КАК ЗастрахованПФР,
//	|	ДанныеОПравеНаСтрахование.ЗастрахованФОМС КАК ЗастрахованФОМС,
//	|	ДанныеОПравеНаСтрахование.ЗастрахованФСС КАК ЗастрахованФСС,
//	|	ДанныеОПравеНаСтрахование.ЗастрахованФССкакИностранец КАК ЗастрахованФССкакИностранец,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
//	|	ВЫБОР
//	|		КОГДА ДанныеОбИнвалидности.Инвалид
//	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
//	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
//	|				И ДоходыПоФизлицам.ОблагаетсяЕНВД
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ЕНВД)
//	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим)
//	|		КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомФармацевта
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
//	|		КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
//	|		КОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
//	|			ТОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф
//	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
//	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяЕНВД, ЛОЖЬ) КАК ОблагаетсяЕНВД,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)) КАК ВидДохода,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Начисление, ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)) КАК Начисление,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР, ЛОЖЬ) КАК ВходитВБазуПФР,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС, ЛОЖЬ) КАК ВходитВБазуФСС,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС_НС, ЛОЖЬ) КАК ВходитВБазуФСС_НС,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФОМС, ЛОЖЬ) КАК ВходитВБазуФОМС,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяВзносамиНаДоплатуШахтерам, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией, ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) КАК КлассУсловийТруда,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ОблагаетсяВзносамиНаДоплатуЛетчикам, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
//	|	ЕСТЬNULL(ВЫБОР
//	|			КОГДА ДоходыПоФизлицам.ВидДохода В (&ВидыДохода)
//	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.Трудовой)
//	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.ГражданскоПравовой)
//	|		КОНЕЦ, ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСЗВ63.ПустаяСсылка)) КАК ТипДоговора,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Сумма, 0) КАК Сумма,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Скидка, 0) КАК Скидка,
//	|	ВЫБОР
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР, ЛОЖЬ)
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПФР,
//	|	ВЫБОР
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованФОМС
//	|				И ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФОМС, ЛОЖЬ)
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаФОМС,
//	|	ВЫБОР
//	|		КОГДА (ДанныеОПравеНаСтрахование.ЗастрахованФСС
//	|				ИЛИ ДанныеОПравеНаСтрахование.ЗастрахованФССкакИностранец)
//	|				И ЕСТЬNULL(ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС, ЛОЖЬ)
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаФСС,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДоходыПоФизлицам.ВидДоходаВходитВБазуФСС_НС
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ВЫБОР
//	|					КОГДА ДоходыПоФизлицам.ВидДоходаАвторскиеВознаграждения
//	|						ТОГДА 0
//	|					ИНАЧЕ ДоходыПоФизлицам.Скидка
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаФСС_НС,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
//	|				И ДоходыПоФизлицам.ПустаяСсылка
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботы,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
//	|				И ДоходыПоФизлицам.ПустаяСсылка
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботы,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
//	|				И ДоходыПоФизлицам.Опасный
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыОпасный,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
//	|				И ДоходыПоФизлицам.Опасный
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыОпасный,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
//	|				И ДоходыПоФизлицам.Вредный1
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный1,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
//	|				И ДоходыПоФизлицам.Вредный1
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный1,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
//	|				И ДоходыПоФизлицам.Вредный2
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный2,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
//	|				И ДоходыПоФизлицам.Вредный2
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный2,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
//	|				И ДоходыПоФизлицам.Вредный3
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный3,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
//	|				И ДоходыПоФизлицам.Вредный3
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный3,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ПодземныеИВредныеРаботы
//	|				И ДоходыПоФизлицам.Вредный4
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаПодземныеИВредныеРаботыВредный4,
//	|	ВЫБОР
//	|		КОГДА ДоходыПоФизлицам.ФизическоеЛицо ЕСТЬ NULL
//	|			ТОГДА 0
//	|		КОГДА ДанныеОПравеНаСтрахование.ЗастрахованПФР
//	|				И ДоходыПоФизлицам.ВидДоходаВходитВБазуПФР
//	|				И ДоходыПоФизлицам.ТяжелыеИПрочиеРаботы
//	|				И ДоходыПоФизлицам.Вредный4
//	|			ТОГДА ДоходыПоФизлицам.Сумма - ДоходыПоФизлицам.Скидка
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК БазаТяжелыеИПрочиеРаботыВредный4,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.НомерСтроки, 0) КАК НомерСтроки,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Подразделение,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачала,
//	|	ЕСТЬNULL(ДоходыПоФизлицам.ВключатьВПервичнуюОтчетностьПФР, ИСТИНА) КАК ВключатьВПервичнуюОтчетностьПФР
//	|ПОМЕСТИТЬ ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС
//	|ИЗ
//	|	ВТПериодыФизЛицОрганизаций КАК СписокФизЛиц
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоФизлицамМесяцам КАК ДоходыПоФизлицам
//	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ДоходыПоФизлицам.ГоловнаяОрганизация
//	|			И СписокФизЛиц.ФизическоеЛицо = ДоходыПоФизлицам.ФизическоеЛицо
//	|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ДоходыПоФизлицам.Период)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
//	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ИспользуемыеТарифы.ГоловнаяОрганизация
//	|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ИспользуемыеТарифы.Период)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносовСрезПоследних
//	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.ГоловнаяОрганизация
//	|			И (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносовСрезПоследних.Период, МЕСЯЦ))
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛьготыПоФСС_НСДляОрганизаций КАК ЛьготыПоФСС_НСДляОрганизаций
//	|		ПО СписокФизЛиц.ГоловнаяОрганизация = ЛьготыПоФСС_НСДляОрганизаций.ГоловнаяОрганизация
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
//	|		ПО (ВЫБОР
//	|				КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомФармацевта
//	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляФармацевтовАптек)
//	|				КОГДА ДоходыПоФизлицам.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
//	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
//	|				КОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
//	|					ТОГДА ДоходыПоФизлицам.ЛьготныйТерриториальныйТариф
//	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
//	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
//	|			И (ГОД(СписокФизЛиц.Период) = ОписаниеТарифов.РасчетныйПериод)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК ДанныеОбИнвалидности
//	|		ПО (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ДанныеОбИнвалидности.Период)
//	|			И СписокФизЛиц.ФизическоеЛицо = ДанныеОбИнвалидности.ФизическоеЛицо
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравахНаСтрахование КАК ДанныеОПравеНаСтрахование
//	|		ПО (НАЧАЛОПЕРИОДА(СписокФизЛиц.Период, МЕСЯЦ) = ДанныеОПравеНаСтрахование.Период)
//	|			И СписокФизЛиц.ФизическоеЛицо = ДанныеОПравеНаСтрахование.ФизическоеЛицо
//	|			И СписокФизЛиц.ГоловнаяОрганизация = ДанныеОПравеНаСтрахование.ГоловнаяОрганизация
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТДоходыПоФизлицамМесяцам
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТРазныеФизЛицаОрганизаций
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТДанныеУчета
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТТарифыСтраховыхВзносовСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТСведенияОбИнвалидностиФизическихЛицСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТДанныеОПравахНаСтрахование
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТПериодыФизЛицОрганизаций
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТЛьготыПоФСС_НСДляОрганизаций
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТПериодыРасширенныхСведенийОДоходах
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СведенияОДоходах.Период КАК Период,
//	|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации,
//	|	СведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	СведенияОДоходах.Организация КАК Организация,
//	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	СведенияОДоходах.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть,
//	|	СведенияОДоходах.ФизическоеЛицоНаименование КАК ФизическоеЛицоНаименование,
//	|	СведенияОДоходах.Инвалид КАК Инвалид,
//	|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС КАК ИспользоватьЛьготуИнвалидамПоФСС_НС,
//	|	СведенияОДоходах.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
//	|	СведенияОДоходах.ЗастрахованПФР КАК ЗастрахованПФР,
//	|	СведенияОДоходах.ЗастрахованФОМС КАК ЗастрахованФОМС,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ЗастрахованФСС
//	|			ТОГДА ИСТИНА
//	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
//	|				И НЕ ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЗастрахованФСС,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
//	|				И ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЗастрахованФССкакИностранец,
//	|	СведенияОДоходах.Сотрудник КАК Сотрудник,
//	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
//	|	СведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
//	|	СведенияОДоходах.ВидДохода КАК ВидДохода,
//	|	СведенияОДоходах.Начисление КАК Начисление,
//	|	СведенияОДоходах.ВходитВБазуПФР КАК ВходитВБазуПФР,
//	|	СведенияОДоходах.ВходитВБазуФСС КАК ВходитВБазуФСС,
//	|	СведенияОДоходах.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
//	|	СведенияОДоходах.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
//	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
//	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
//	|	СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
//	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
//	|	СведенияОДоходах.ТипДоговора КАК ТипДоговора,
//	|	СУММА(СведенияОДоходах.Сумма) КАК Сумма,
//	|	СУММА(СведенияОДоходах.Скидка) КАК Скидка,
//	|	СУММА(СведенияОДоходах.БазаПФР) КАК БазаПФР,
//	|	СУММА(СведенияОДоходах.БазаФОМС) КАК БазаФОМС,
//	|	СУММА(СведенияОДоходах.БазаФСС) КАК БазаФСС,
//	|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаФСС_НС,
//	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботы) КАК БазаПодземныеИВредныеРаботы,
//	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботы) КАК БазаТяжелыеИПрочиеРаботы,
//	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыОпасный) КАК БазаПодземныеИВредныеРаботыОпасный,
//	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыОпасный) КАК БазаТяжелыеИПрочиеРаботыОпасный,
//	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный1) КАК БазаПодземныеИВредныеРаботыВредный1,
//	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный1) КАК БазаТяжелыеИПрочиеРаботыВредный1,
//	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный2) КАК БазаПодземныеИВредныеРаботыВредный2,
//	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный2) КАК БазаТяжелыеИПрочиеРаботыВредный2,
//	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный3) КАК БазаПодземныеИВредныеРаботыВредный3,
//	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный3) КАК БазаТяжелыеИПрочиеРаботыВредный3,
//	|	СУММА(СведенияОДоходах.БазаПодземныеИВредныеРаботыВредный4) КАК БазаПодземныеИВредныеРаботыВредный4,
//	|	СУММА(СведенияОДоходах.БазаТяжелыеИПрочиеРаботыВредный4) КАК БазаТяжелыеИПрочиеРаботыВредный4,
//	|	0 КАК СуммаПревысившаяПределПФР,
//	|	0 КАК СуммаПревысившаяПределФСС,
//	|	0 КАК СуммаПревысившаяПределФОМС,
//	|	СведенияОДоходах.Регистратор КАК Регистратор,
//	|	СведенияОДоходах.НомерСтроки КАК НомерСтроки,
//	|	СведенияОДоходах.Подразделение КАК Подразделение,
//	|	СведенияОДоходах.ДатаНачала КАК ДатаНачала,
//	|	СведенияОДоходах.ВключатьВПервичнуюОтчетностьПФР КАК ВключатьВПервичнуюОтчетностьПФР
//	|ПОМЕСТИТЬ ВТСведенияОДоходах
//	|ИЗ
//	|	ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС КАК СведенияОДоходах
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
//	|		ПО СведенияОДоходах.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
//	|			И (ГОД(СведенияОДоходах.Период) = ОписаниеТарифов.РасчетныйПериод)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СведенияОДоходах.Период,
//	|	СведенияОДоходах.ПериодРегистрации,
//	|	СведенияОДоходах.ГоловнаяОрганизация,
//	|	СведенияОДоходах.Организация,
//	|	СведенияОДоходах.ФизическоеЛицо,
//	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
//	|	СведенияОДоходах.ФизическоеЛицоНаименование,
//	|	СведенияОДоходах.Инвалид,
//	|	СведенияОДоходах.ИспользоватьЛьготуИнвалидамПоФСС_НС,
//	|	СведенияОДоходах.ВидЗастрахованногоЛица,
//	|	СведенияОДоходах.ЗастрахованПФР,
//	|	СведенияОДоходах.ЗастрахованФОМС,
//	|	СведенияОДоходах.Сотрудник,
//	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
//	|	СведенияОДоходах.ОблагаетсяЕНВД,
//	|	СведенияОДоходах.ВидДохода,
//	|	СведенияОДоходах.Начисление,
//	|	СведенияОДоходах.ВходитВБазуПФР,
//	|	СведенияОДоходах.ВходитВБазуФСС,
//	|	СведенияОДоходах.ВходитВБазуФОМС,
//	|	СведенияОДоходах.ВходитВБазуФСС_НС,
//	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
//	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
//	|	СведенияОДоходах.КлассУсловийТруда,
//	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
//	|	СведенияОДоходах.ТипДоговора,
//	|	СведенияОДоходах.Регистратор,
//	|	СведенияОДоходах.Подразделение,
//	|	СведенияОДоходах.ДатаНачала,
//	|	СведенияОДоходах.ВключатьВПервичнуюОтчетностьПФР,
//	|	СведенияОДоходах.НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ЗастрахованФСС
//	|			ТОГДА ИСТИНА
//	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
//	|				И НЕ ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА СведенияОДоходах.ЗастрахованФССкакИностранец
//	|				И ОписаниеТарифов.ВыделятьДоходыИностранцевДляФСС
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ
//	|
//	|ИМЕЮЩИЕ
//	|	(СУММА(СведенияОДоходах.Сумма) <> 0
//	|		ИЛИ СУММА(СведенияОДоходах.Скидка) <> 0)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТСведенияБезУточненияЗастрахованностиИностранцевВФСС";
//	
//	//begin fix Клещ А.Н. 12.09.2019 &КлассУсловийТруда,//СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда КАК КлассУсловийТруда, 
//	ТекстЗапроса = ?(НачалоПериода <Дата('20250101'),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка) КАК КлассУсловийТруда"),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","СведенияОДоходахСтраховыеВзносы.КлассУсловийТруда КАК КлассУсловийТруда"));
//	//end fix Клещ А.Н. 12.09.2019
//		
//	Если Не ТолькоРазрешенные Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
//	КонецЕсли;
//	Если ОставлятьМесяцыБезДоходов Тогда
//		НачальнаяПозиция = СтрНайти(ТекстЗапроса, "ИМЕЮЩИЕ");
//		ПоследняяПозиция = СтрНайти(ТекстЗапроса, ";", , НачальнаяПозиция) - 1;
//		ТекстЗапроса = Лев(ТекстЗапроса, НачальнаяПозиция - 1) + Прав(ТекстЗапроса, СтрДлина(ТекстЗапроса) - ПоследняяПозиция);
//	КонецЕсли;   
//	
//	Запрос.Текст = ТекстЗапроса;
//	Запрос.Выполнить();
//	
//КонецПроцедуры

//&Вместо("РасчетПоказателей_4ФСС_2017Кв1")  Теперь  в УчетСтраховыхВзносовЗаполнениеОтчетности

//Процедура ВИЛС_РасчетПоказателей_4ФСС_2017Кв1(НачалоПериода, ОкончаниеПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
//	
//	НачалоТекущегоКвартала = НачалоКвартала(ОкончаниеПериода);
//	ЭтоЮридическоеЛицо = ЗарплатаКадры.ЭтоЮридическоеЛицо(Организация);
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Организация",				Организация);
//	Запрос.УстановитьПараметр("НачалоОтчетногоПериода",		НачалоПериода);
//	Запрос.УстановитьПараметр("КонецОтчетногоПериода",		ОкончаниеПериода);
//	Запрос.УстановитьПараметр("Месяц1",						Месяц(НачалоТекущегоКвартала));
//	Запрос.УстановитьПараметр("Месяц2",						Месяц(НачалоТекущегоКвартала) + 1);
//	Запрос.УстановитьПараметр("Месяц3",						Месяц(НачалоТекущегоКвартала) + 2);
//	
//	НеОбъект = Новый Массив;
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.НеЯвляетсяОбъектом);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДоговорыГПХ);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеОткрытия);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеЛитературныеПроизведения);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеНаучныеТруды);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеСкульптуры);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеГрафическиеПроизведения);
//	НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеИсполнениеПроизведений);
//	Если НачалоПериода >= '20190101' Тогда
//		НеОбъект.Добавить(Справочники.ВидыДоходовПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих);
//	КонецЕсли;
//	Запрос.УстановитьПараметр("НеЯвляетсяОбъектом", НеОбъект);
//	
//	// ----------------------------------------------------------------------------------
//	// ФОРМИРОВАНИЕ ВРЕМЕННЫХ ТАБЛИЦ
//	
//	// Таблица 1 
//	Если ОписаниеТаблиц.Свойство("Доходы2017") Тогда
//		
//		// Получаем временные таблицы, используя общие алгоритмы.
//		Запрос.МенеджерВременныхТаблиц = СформироватьВТРасширенныеСведенияОДоходахИВзносах(НачалоПериода, ОкончаниеПериода, Организация);
//		
//		Запрос.Текст =
//		//begin fix зимин 21.04.2020
//		"ВЫБРАТЬ первые 0
//		//end fix зимин 21.04.2020
//		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
//		|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
//		|ИЗ
//		|	ВТСведенияОДоходах КАК СведенияОДоходах
//		|ГДЕ
//		|	СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СведенияОДоходах.ФизическоеЛицо
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(СведенияОДоходах.БазаФСС_НС) < 0
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	ФизическоеЛицо";
//		Запрос.Выполнить();
//	
//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	СведенияОДоходах.ПериодРегистрации КАК Период,
//		|	СведенияОДоходах.ФизическоеЛицо,
//		|	СведенияОДоходах.Начисление,
//		|	СведенияОДоходах.Регистратор,
//		|	СУММА(ВЫБОР
//		|			КОГДА СведенияОДоходах.ВидДохода В (&НеЯвляетсяОбъектом)
//		|				ТОГДА 0
//		|			КОГДА НЕ СведенияОДоходах.ВходитВБазуФСС_НС
//		|				ТОГДА СведенияОДоходах.Сумма
//		|			ИНАЧЕ СведенияОДоходах.Скидка
//		|		КОНЕЦ) КАК НеОблагаетсяНС_ПЗ,
//		|	СУММА(СведенияОДоходах.БазаФСС_НС) КАК БазаНС_ПЗ,
//		|	СУММА(ВЫБОР
//		|			КОГДА СведенияОДоходах.Инвалид
//		|					ИЛИ СведенияОДоходах.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ОрганизацияИнвалидов)
//		|				ТОГДА СведенияОДоходах.БазаФСС_НС
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК БазаИнвалидаНС_ПЗ
//		|ПОМЕСТИТЬ ВТОблагаемыеБазыПоМесяцам
//		|ИЗ
//		|	ВТСведенияОДоходах КАК СведенияОДоходах
//		|ГДЕ
//		|	СведенияОДоходах.Организация = &Организация
//		|	И СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода
//		|	И НЕ СведенияОДоходах.ФизическоеЛицо В
//		|				(ВЫБРАТЬ
//		|					ФизлицаБезБазы.ФизическоеЛицо
//		|				ИЗ
//		|					ВТФизлицаБезОблагаемойБазы КАК ФизлицаБезБазы)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СведенияОДоходах.Регистратор,
//		|	СведенияОДоходах.ПериодРегистрации,
//		|	СведенияОДоходах.ФизическоеЛицо,
//		|	СведенияОДоходах.Начисление
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000010000103,
//		|	ЕСТЬNULL(СУММА(СведенияОДоходах.БазаИнвалидаНС_ПЗ), 0) КАК П000010000403,
//		|	ЕСТЬNULL(СУММА(СведенияОДоходах.НеОблагаетсяНС_ПЗ), 0) КАК П000010000203,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
//		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000104,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
//		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000105,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
//		|					ТОГДА СведенияОДоходах.БазаНС_ПЗ + СведенияОДоходах.НеОблагаетсяНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000106,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
//		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000404,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
//		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000405,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
//		|					ТОГДА СведенияОДоходах.БазаИнвалидаНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000406,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц1
//		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000204,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц2
//		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000205,
//		|	ЕСТЬNULL(СУММА(ВЫБОР
//		|				КОГДА МЕСЯЦ(СведенияОДоходах.Период) = &Месяц3
//		|					ТОГДА СведенияОДоходах.НеОблагаетсяНС_ПЗ
//		|				ИНАЧЕ 0
//		|			КОНЕЦ), 0) КАК П000010000206,
//		|	СведенияОДоходах.ФизическоеЛицо,
//		|	СведенияОДоходах.Начисление,
//		|	СведенияОДоходах.Регистратор
//		|ИЗ
//		|	ВТОблагаемыеБазыПоМесяцам КАК СведенияОДоходах
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СведенияОДоходах.ФизическоеЛицо,
//		|	СведенияОДоходах.Начисление,
//		|	СведенияОДоходах.Регистратор";
//		
//		МассивПолей = Новый Массив;
//		Если Не ПодробныеДанные Тогда
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СведенияОДоходах.ФизическоеЛицо,", "");
//			МассивПолей.Добавить("Начисление");
//			МассивПолей.Добавить("Регистратор");
//		КонецЕсли;
//		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
//		ОписаниеТаблиц.Доходы2017 = Запрос.Выполнить().Выгрузить()
//	КонецЕсли;
//	
//КонецПроцедуры
