
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ДобавленныеРеквизиты = Новый Массив();
	ДобавленныеРеквизиты.Добавить(Новый РеквизитФормы("НаправленияДеятельностиКэшированныеЗначения", Новый ОписаниеТипов("")));
	ДобавленныеРеквизиты.Добавить(Новый РеквизитФормы("МетаданныеФормы", Новый ОписаниеТипов("")));
	ИзменитьРеквизиты(ДобавленныеРеквизиты);
	//ЭтотОбъект.НаправленияДеятельностиКэшированныеЗначения = НаправленияДеятельностиКэшированныеЗначения();
	ЭтотОбъект.МетаданныеФормы = ОписаниеФормыДокументаДляЗаполненияРеквизитовСвязанныхСНаправлениемДеятельности();
	НаправленияДеятельностиСервер.ПриЧтенииСозданииНаСервере(ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ОписаниеФормыДокументаДляЗаполненияРеквизитовСвязанныхСНаправлениемДеятельности()
	
	СтруктураОбъекта = НаправленияДеятельностиСервер.СтруктураОбъекта();
	СтруктураОбъекта.ОформляетсяПоЗаказу 	= Ложь;
	СтруктураОбъекта.ЕстьНазначениеВТЧ 		= Ложь;
	Возврат СтруктураОбъекта;
	
КонецФункции

//&НаСервере
//Функция НаправленияДеятельностиКэшированныеЗначения()
//	
//	КэшированныеЗначения = Новый Структура();
//	КэшированныеЗначения.Вставить("ИспользоватьНаправленияДеятельности");
//	КэшированныеЗначения.Вставить("ИспользоватьОбособленноеОбеспечениеЗаказов");
//	КэшированныеЗначения.Вставить("НазначениеПоУмолчанию");
//	Возврат КэшированныеЗначения;
//	
//КонецФункции
