&ИзменениеИКонтроль("СформироватьВТНачисленияСДаннымиУчета")
// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТНачисленияСДаннымиУчета, которая содержит следующие поля:
//		Сотрудник - СправочникСсылка.Сотрудники
//		ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//		ДатаНачала - дата
//		ДатаПолученияДохода - дата.
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		ВидДохода - СправочникСсылка.ВидыДоходовПоСтраховымВзносам -
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		ЯвляетсяДоходомФармацевта - булево.
//		ЛьготныйТерриториальныйТариф - СправочникСсылка.ВидыТарифовСтраховыхВзносов.
//		ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//		КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//		ОблагаетсяВзносамиНаДоплатуЛетчикам - булево.
//		ОблагаетсяВзносамиНаДоплатуШахтерам - булево.
//		Сумма - число 
//		Скидка - число 
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит 
//			вр. таблицу ВТНачисления с полями:
//				Сотрудник -
//				ДатаНачала - дата -
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления -
//				Подразделение - 
//				СуммаДохода - 
//				СуммаВычетаВзносы -
//      	        и, возможно, другими
//			вр. таблицу ВТСДаннымиУчета, с полями:
//				Сотрудник - СправочникСсылка.Сотрудники
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ДатаНачала - дата
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//				ВидДохода - СправочникСсылка.ВидыДоходовПоСтраховымВзносам -
//				Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//				ЯвляетсяДоходомФармацевта - булево.
//				ЛьготныйТерриториальныйТариф - СправочникСсылка.ВидыТарифовСтраховыхВзносов.
//				ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//				КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//				ОблагаетсяВзносамиНаДоплатуЛетчикам - булево.
//				ОблагаетсяВзносамиНаДоплатуШахтерам - булево.
//				КоэффициентУчетаСтроки - число от 0 до 1.
//
Процедура ВИЛС_СформироватьВТНачисленияСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИспользоватьОсобыеУсловияТруда = Ложь) Экспорт 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаПолученияДохода", УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(ПериодРегистрации));
	Запрос.УстановитьПараметр("ИспользоватьОсобыеУсловияТруда", ИспользоватьОсобыеУсловияТруда);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	ВременнаяТаблица.Сотрудник,
	|	ВременнаяТаблица.Начисление,
	|	ВременнаяТаблица.ПодразделениеОрганизации КАК Подразделение,
	|	ВременнаяТаблица.ДатаНачала,
	|	ДанныеУчета.ВидДохода,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ДанныеУчета.ЯвляетсяДоходомФармацевта,
	|	ДанныеУчета.ЛьготныйТерриториальныйТариф,
	|	ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
	|	ДанныеУчета.КлассУсловийТруда,
#КонецУдаления
#Вставка
		// Не будем соединять.  // fix Suetin 07.04.2021 11:26:29
	|   &КлассУсловийТруда	КАК КлассУсловийТруда,
#КонецВставки
	|	ВЫРАЗИТЬ(СУММА(ВременнаяТаблица.СуммаДохода * ЕСТЬNULL(ДанныеУчета.КоэффициентУчетаСтроки, 1)) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДанныеУчета.ВидДохода.ОблагаетсяВзносамиЧастично
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ВременнаяТаблица.СуммаВычетаВзносы * ЕСТЬNULL(ДанныеУчета.КоэффициентУчетаСтроки, 1)) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Скидка,
	|	ДанныеУчета.ФизическоеЛицо,
	|	ИСТИНА КАК РаспределятьЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТНачисленияСДаннымиУчета
	|ИЗ
	|	ВТНачисления КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСДаннымиУчета КАК ДанныеУчета
	|		ПО ВременнаяТаблица.Сотрудник = ДанныеУчета.Сотрудник
	|			И ВременнаяТаблица.Начисление = ДанныеУчета.Начисление
	|			И ВременнаяТаблица.ПодразделениеОрганизации = ДанныеУчета.Подразделение
	|			И ВременнаяТаблица.ДатаНачала = ДанныеУчета.ДатаНачала
	|			И &ИспользоватьОсобыеУсловияТруда
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Сотрудник,
	|	ВременнаяТаблица.Начисление,
	|	ВременнаяТаблица.ПодразделениеОрганизации,
	|	ВременнаяТаблица.ДатаНачала,
	|	ДанныеУчета.ВидДохода,
	|	ДанныеУчета.ВидДохода.ОблагаетсяВзносамиЧастично,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ДанныеУчета.ЯвляетсяДоходомФармацевта,
	|	ДанныеУчета.ЛьготныйТерриториальныйТариф,
	|	ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
#Удаление
	|	ДанныеУчета.КлассУсловийТруда,
#КонецУдаления
#Вставка
		// Не будем соединять.  // fix Suetin 07.04.2021 11:26:29
	|   &КлассУсловийТруда,
#КонецВставки
	|	ДанныеУчета.ФизическоеЛицо";
#Вставка
	//begin fix Клещ А.Н. 12.09.2019  
	ТекстЗапроса = ?(ПериодРегистрации<Дата('20250101'),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)"),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","ДанныеУчета.КлассУсловийТруда"));
	//end fix Клещ А.Н. 12.09.2019
#КонецВставки
	
	Если ИспользоватьОсобыеУсловияТруда Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИспользоватьОсобыеУсловияТруда", "ВременнаяТаблица.УсловияТруда = ДанныеУчета.УсловияТруда")
	Иначе
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИспользоватьОсобыеУсловияТруда", "ИСТИНА")
	КонецЕсли;
	Запрос.Выполнить();
	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьВТСДаннымиУчета")
Процедура ВИЛС_СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Если ПериодРегистрации < УчетСтраховыхВзносовКлиентСервер.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка) КАК КлассУсловийТруда,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
		|ПОМЕСТИТЬ ВТКлассыУсловийТрудаПоДолжностямСрезПоследних";
		Запрос.Выполнить();
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеОСотруднике.Должность,
		|	ДанныеОСотруднике.ДатаНачала КАК Период
		|ПОМЕСТИТЬ ВТДолжности
		|ИЗ
		|	ВТКадровыхДанных КАК ДанныеОСотруднике";
		Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		Запрос.Выполнить();

		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
		УчетСтраховыхВзносов.ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, КонецМесяца(ПериодРегистрации), Ложь);

		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"КлассыУсловийТрудаПоДолжностям",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		"ВТДолжности",
		"Должность"),
		ПараметрыПостроения);

		Запрос.Текст = 
		"УНИЧТОЖИТЬ ВТДолжности";
		Запрос.Выполнить();

	КонецЕсли;

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Начисление,
	|	ДанныеОСотруднике.ЯвляетсяПрокурором,
	|	ДанныеОСотруднике.ЯвляетсяВоеннослужащим,
	|	ДанныеОСотруднике.РаботаетВСтуденческомОтряде
	|ПОМЕСТИТЬ ВТСписокНачислений
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыхДанных КАК ДанныеОСотруднике
	|		ПО СписокНачислений.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И СписокНачислений.ДатаНачала = ДанныеОСотруднике.ДатаНачала
	|			И СписокНачислений.Начисление = ДанныеОСотруднике.Начисление
	|			И СписокНачислений.ПодразделениеОрганизации = ДанныеОСотруднике.Подразделение";
	Запрос.Выполнить();

	УчетСтраховыхВзносов.СформироватьВТСоответствиеВидовДоходаНачислениям(МенеджерВременныхТаблиц, ПериодРегистрации);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации
	|ПОМЕСТИТЬ ВТДляОпределенияДанныхУчета
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ДатаНачала КАК ДатаНачала,
	|	СписокНачислений.ПодразделениеОрганизации КАК Подразделение,
	|	ЕСТЬNULL(ВидыДоходаПоНачислениям.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)) КАК ВидДохода,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяЧленомЛетногоЭкипажа, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяШахтером, ЛОЖЬ) КАК ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяФармацевтом, ЛОЖЬ) КАК ЯвляетсяДоходомФармацевта,
	|	ЕСТЬNULL(ДанныеОСотруднике.ПрименяемыйЛьготныйТерриториальныйТариф, ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)) КАК ЛьготныйТерриториальныйТариф,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяРаботникомСДосрочнойПенсией, ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) КАК КлассУсловийТруда,
	|	ЕСТЬNULL(СУММА(ДанныеОСотруднике.КоэффициентУчетаСтроки), 1) КАК КоэффициентУчетаСтроки
	|ПОМЕСТИТЬ ВТСДаннымиУчета
	|ИЗ
	|	ВТДляОпределенияДанныхУчета КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыхДанных КАК ДанныеОСотруднике
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКлассыУсловийТрудаПоДолжностямСрезПоследних КАК КлассыУсловийТрудаПоДолжностям
	|			ПО ДанныеОСотруднике.Должность = КлассыУсловийТрудаПоДолжностям.Должность
	|				И ДанныеОСотруднике.ДатаНачала = КлассыУсловийТрудаПоДолжностям.Период
#Вставка
					// Не будем соединять.  // fix Suetin 07.04.2021 11:26:29
	|				И ЛОЖЬ
#КонецВставки
	|		ПО СписокНачислений.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И СписокНачислений.ДатаНачала = ДанныеОСотруднике.ДатаНачала
	|			И СписокНачислений.Начисление = ДанныеОСотруднике.Начисление
	|			И СписокНачислений.ПодразделениеОрганизации = ДанныеОСотруднике.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДоходаПоНачислениям КАК ВидыДоходаПоНачислениям
	|		ПО СписокНачислений.Начисление = ВидыДоходаПоНачислениям.Начисление
	|			И (ДанныеОСотруднике.ЯвляетсяВоеннослужащим = ВидыДоходаПоНачислениям.ЯвляетсяВоеннослужащим)
	|			И (ДанныеОСотруднике.ЯвляетсяПрокурором = ВидыДоходаПоНачислениям.ЯвляетсяПрокурором)
	|			И (ДанныеОСотруднике.РаботаетВСтуденческомОтряде = ВидыДоходаПоНачислениям.РаботаетВСтуденческомОтряде)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СписокНачислений.Сотрудник = Сотрудники.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОСотруднике.ЯвляетсяЧленомЛетногоЭкипажа,
	|	ДанныеОСотруднике.ЯвляетсяШахтером,
	|	ДанныеОСотруднике.ПрименяемыйЛьготныйТерриториальныйТариф,
	|	ДанныеОСотруднике.ЯвляетсяРаботникомСДосрочнойПенсией,
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации,
	|	СписокНачислений.ДатаНачала,
	|	Сотрудники.ФизическоеЛицо,
	|	ЕСТЬNULL(ДанныеОСотруднике.ЯвляетсяФармацевтом, ЛОЖЬ),
	|	ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)),
	|	ЕСТЬNULL(ВидыДоходаПоНачислениям.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСписокНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыДоходаПоНачислениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДляОпределенияДанныхУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКлассыУсловийТрудаПоДолжностямСрезПоследних";

	Запрос.Выполнить();

КонецПроцедуры
