&Вместо("СформироватьВТНачисленияСДаннымиУчета")
// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТНачисленияСДаннымиУчета, которая содержит следующие поля:
//		Сотрудник - СправочникСсылка.Сотрудники
//		ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//		ДатаНачала - дата
//		ДатаПолученияДохода - дата.
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		ВидДохода - СправочникСсылка.ВидыДоходовПоСтраховымВзносам -
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		ЯвляетсяДоходомФармацевта - булево.
//		ЛьготныйТерриториальныйТариф - СправочникСсылка.ВидыТарифовСтраховыхВзносов.
//		ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//		КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//		ОблагаетсяВзносамиНаДоплатуЛетчикам - булево.
//		ОблагаетсяВзносамиНаДоплатуШахтерам - булево.
//		Сумма - число 
//		Скидка - число 
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит 
//			вр. таблицу ВТНачисления с полями:
//				Сотрудник -
//				ДатаНачала - дата -
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления -
//				Подразделение - 
//				СуммаДохода - 
//				СуммаВычетаВзносы -
//      	        и, возможно, другими
//			вр. таблицу ВТСДаннымиУчета, с полями:
//				Сотрудник - СправочникСсылка.Сотрудники
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ДатаНачала - дата
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//				ВидДохода - СправочникСсылка.ВидыДоходовПоСтраховымВзносам -
//				Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//				ЯвляетсяДоходомФармацевта - булево.
//				ЛьготныйТерриториальныйТариф - СправочникСсылка.ВидыТарифовСтраховыхВзносов.
//				ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//				КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//				ОблагаетсяВзносамиНаДоплатуЛетчикам - булево.
//				ОблагаетсяВзносамиНаДоплатуШахтерам - булево.
//				КоэффициентУчетаСтроки - число от 0 до 1.
//
Процедура ВИЛС_СформироватьВТНачисленияСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИспользоватьОсобыеУсловияТруда = Ложь) Экспорт 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаПолученияДохода", УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(ПериодРегистрации));
	Запрос.УстановитьПараметр("ИспользоватьОсобыеУсловияТруда", ИспользоватьОсобыеУсловияТруда);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	ВременнаяТаблица.Сотрудник,
	|	ВременнаяТаблица.Начисление,
	|	ВременнаяТаблица.ПодразделениеОрганизации КАК Подразделение,
	|	ВременнаяТаблица.ДатаНачала,
	|	ДанныеУчета.ВидДохода,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ДанныеУчета.ЯвляетсяДоходомФармацевта,
	|	ДанныеУчета.ЛьготныйТерриториальныйТариф,
	|	ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|   &КлассУсловийТруда,//|	ДанныеУчета.КлассУсловийТруда,
	|	ВЫРАЗИТЬ(СУММА(ВременнаяТаблица.СуммаДохода * ЕСТЬNULL(ДанныеУчета.КоэффициентУчетаСтроки, 1)) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДанныеУчета.ВидДохода.ОблагаетсяВзносамиЧастично
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ВременнаяТаблица.СуммаВычетаВзносы * ЕСТЬNULL(ДанныеУчета.КоэффициентУчетаСтроки, 1)) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Скидка,
	|	ДанныеУчета.ФизическоеЛицо,
	|	ИСТИНА КАК РаспределятьЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТНачисленияСДаннымиУчета
	|ИЗ
	|	ВТНачисления КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСДаннымиУчета КАК ДанныеУчета
	|		ПО ВременнаяТаблица.Сотрудник = ДанныеУчета.Сотрудник
	|			И ВременнаяТаблица.Начисление = ДанныеУчета.Начисление
	|			И ВременнаяТаблица.ПодразделениеОрганизации = ДанныеУчета.Подразделение
	|			И ВременнаяТаблица.ДатаНачала = ДанныеУчета.ДатаНачала
	|			И &ИспользоватьОсобыеУсловияТруда
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Сотрудник,
	|	ВременнаяТаблица.Начисление,
	|	ВременнаяТаблица.ПодразделениеОрганизации,
	|	ВременнаяТаблица.ДатаНачала,
	|	ДанныеУчета.ВидДохода,
	|	ДанныеУчета.ВидДохода.ОблагаетсяВзносамиЧастично,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ДанныеУчета.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ДанныеУчета.ЯвляетсяДоходомФармацевта,
	|	ДанныеУчета.ЛьготныйТерриториальныйТариф,
	|	ДанныеУчета.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДанныеУчета.КлассУсловийТруда,
	|	ДанныеУчета.ФизическоеЛицо";
	
	
	//begin fix Клещ А.Н. 12.09.2019  
	ТекстЗапроса = ?(ПериодРегистрации<Дата('20250101'),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","Значение(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка) КАК КлассУсловийТруда"),СтрЗаменить(ТекстЗапроса,"&КлассУсловийТруда","ДанныеУчета.КлассУсловийТруда"));
	//end fix Клещ А.Н. 12.09.2019
	
	
	Если ИспользоватьОсобыеУсловияТруда Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИспользоватьОсобыеУсловияТруда", "ВременнаяТаблица.УсловияТруда = ДанныеУчета.УсловияТруда")
	Иначе
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИспользоватьОсобыеУсловияТруда", "ИСТИНА")
	КонецЕсли;
	Запрос.Выполнить();
	
КонецПроцедуры