&НаСервере
Процедура УстановитьВидимостьФлаговВИЛС(Список,ТипДокумента)
	Если  ТипДокумента = "ЗаказКлиента" 
		или ТипДокумента = "ЗаказНаПеремещение"
		Тогда 
		
		Если Параметры.СписокВыбора <> Неопределено Тогда
			
			Элементы.ГруппаОтгрузить.Видимость =
			Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.Отгрузить) <> Неопределено
			Или Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно) <> Неопределено;
			
			Если не ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Добавление изменение складских актов") или РольДоступна("ПолныеПрава") Тогда
				Элементы.ГруппаРезервировать.Видимость =
				Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.СоСклада) <> Неопределено;
			Иначе
				Элементы.ГруппаРезервировать.Видимость = Ложь;	
			КонецЕсли;
			
			Если не ВИЛС_Служебный.ДоступныПоля(ПараметрыСеанса.ТекущийПользователь,"Добавление изменение складских актов") или РольДоступна("ПолныеПрава") Тогда
				Элементы.ГруппаРезервироватьКСроку.Видимость =
				Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.ИзЗаказов) <> Неопределено;
			Иначе
				Элементы.ГруппаРезервироватьКСроку.Видимость = Ложь;
			КонецЕсли;
			
			Элементы.ГруппаОбособленно.Видимость =
			Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.Обособленно) <> Неопределено;
			
			Элементы.ГруппаТребуется.Видимость =
			Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.Требуется) <> Неопределено;
			
			Элементы.ГруппаНеТребуется.Видимость =
			Список.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.НеТребуется) <> Неопределено;
			
		КонецЕсли;
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
			
			Элементы.ГруппаОбособленно.Видимость = Ложь;
			
		Иначе
			
			Элементы.Отгрузить.Заголовок = НСтр("ru = 'Отгрузить (при необходимости обособленно)';
			|en = 'Ship (on pegging basis if needed)'");
			
		КонецЕсли;
	Иначе
		УстановитьВидимостьФлагов(Список);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВИЛС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПриСозданииНастроитьЭлементыФормы();
	
	ВосстановитьНастройки();
	
	УстановитьВидимостьФлаговВИЛС(Параметры.СписокВыбора,Параметры.Тип);//begin fix Клещ А.Н. 16.10.2019 УстановитьВидимостьФлагов(Параметры.СписокВыбора);
	УстановитьПорядок(ЭтаФорма);
	УстановитьПредставлениеФлагов(Параметры.СписокВыбора);
	
КонецПроцедуры
