
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма,
		Новый Структура("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты"));
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВИЛС_ПереопределитьРеквизиты();          // begin fix Suetin 22.08.2019 12:26:29
		Если Параметры.Свойство("ОписаниеКоманды")
			и Параметры.ОписаниеКоманды.Вид = "СозданиеНаОсновании" 
			и Параметры.ОписаниеКоманды.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику") Тогда
			МассивДанныеЗаполнения = Новый Массив();
			МассивДанныеЗаполнения.Добавить(Параметры.Основание);
			ДанныеОснований = Документы.ПоручениеЭкспедитору.ДанныеОснований(МассивДанныеЗаполнения);
			ТаблицаТоварыКДоставке = ВИЛС_ОбработкаЗаполненияПоЗаказПоставщикуПродолжение(Объект, Параметры.Основание, ДанныеОснований);
			Если ТипЗнч(ТаблицаТоварыКДоставке) = Тип("ТаблицаЗначений") Тогда
				ТоварыКДоставке.Загрузить(ТаблицаТоварыКДоставке);
			КонецЕсли;
		КонецЕсли;
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяПо);
	ДоставкаТоваров.УстановитьДоступностьАдресовДоставки(ЭтаФорма.Элементы);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры	

&НаСервере
Процедура ВИЛС_ПереопределитьРеквизиты()
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	КвалификаторЧисла = Новый КвалификаторыЧисла(15,3);
	ДопустимыеТипыЧ = Новый ОписаниеТипов(МассивТипов, КвалификаторЧисла);
	МассивРеквизитов = Новый Массив;
	РеквизитФормы = Новый РеквизитФормы("Вес", ДопустимыеТипыЧ, "ТоварыКДоставке", "Вес");
	МассивРеквизитов.Добавить(РеквизитФормы);
	РеквизитФормы = Новый РеквизитФормы("Объем", ДопустимыеТипыЧ, "ТоварыКДоставке", "Объем");
	МассивРеквизитов.Добавить(РеквизитФормы);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	КвалификаторСтроки = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
	ДопустимыеТипыС = Новый ОписаниеТипов(МассивТипов, КвалификаторСтроки);
	РеквизитФормы = Новый РеквизитФормы("ВИЛС_КонтактныеЛица", ДопустимыеТипыС, "Объект.Маршрут", "Контактные лица", Истина);
	МассивРеквизитов.Добавить(РеквизитФормы);  
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная);
	ДопустимыеТипыС = Новый ОписаниеТипов(МассивТипов, КвалификаторСтроки);
	РеквизитФормы = Новый РеквизитФормы("ВИЛС_ГабаритыГруза", ДопустимыеТипыС,, "Габариты груза", Истина);
	МассивРеквизитов.Добавить(РеквизитФормы);
	РеквизитФормы = Новый РеквизитФормы("ВИЛС_ТребуемыйТипПодсостава", ДопустимыеТипыС,, "Требуемый тип подсостава", Истина);
	МассивРеквизитов.Добавить(РеквизитФормы);
	РеквизитФормы = Новый РеквизитФормы("ВИЛС_ПогрузкаРазгрузка", ДопустимыеТипыС,, "Погрузка (разгрузка)", Истина);
	МассивРеквизитов.Добавить(РеквизитФормы);
	//РеквизитФормы = Новый РеквизитФормы("ТЗАдресовКонтрагентов", ДопустимыеТипыС,, "ТЗ адресов контрагентов", Ложь);
	//МассивРеквизитов.Добавить(РеквизитФормы);
	
	ИзменитьРеквизиты(МассивРеквизитов);
	Элементы.Маршрут.ПодчиненныеЭлементы.МаршрутДополнительнаяИнформация.Заголовок = "Наименование груза";
	
	Элементы.Водитель.Видимость 		= Ложь;
	Элементы.КурьерЭкспедитор.Видимость = Ложь;
	Если Элементы.Найти("ВИЛС_Водитель") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_Водитель", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ГруппаЛево.ПодчиненныеЭлементы.КурьерЭкспедитор);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_Водитель";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
		ДобавляемыйЭлемент.Заголовок				= "Водитель";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		ДобавляемыйЭлемент.УстановитьДействие("ПриИзменении", "ВИЛС_ВодительПриИзменении");
	КонецЕсли;
	Если Элементы.Найти("ВИЛС_КурьерЭкспедитор") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_КурьерЭкспедитор", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ГруппаЛево.ПодчиненныеЭлементы.КурьерЭкспедитор);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_КурьерЭкспедитор";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
		ДобавляемыйЭлемент.Заголовок				= "Курьер экспедитор";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	КонецЕсли;
	
	//Если Элементы.Найти("ВИЛС_ДоговорПеревозчика") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДоговорПеревозчика", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ТранспортноеСредство);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДоговорПеревозчика";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
		ДобавляемыйЭлемент.Заголовок				= "Договор";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		Если Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба Тогда
			ДобавляемыйЭлемент.Видимость = Ложь;
		КонецЕсли;	
	//КонецЕсли;
	
	ДобавляемыйЭлементГрСВ = Элементы.Вставить("ГруппаРеквизитыЗаявки", Тип("ГруппаФормы"), Элементы.ГруппаПраво, Элементы.ГруппаСклад);
	ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;// .Вертикальная;
	
	//Если Элементы.Найти("ВИЛС_НомерЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_НомерЗаявки", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_НомерЗаявки";
		ДобавляемыйЭлемент.Заголовок				= "Заявка";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 30;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	//КонецЕсли;
	//Если Элементы.Найти("ВИЛС_ДатаЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДатаЗаявки", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//, Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДатаЗаявки";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.Заголовок				= "от";
		ДобавляемыйЭлемент.Ширина					= 8;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	//КонецЕсли;
	
	ДобавляемыйЭлементГрСВ = Элементы.Вставить("ГруппаРеквизитыДоверенности", Тип("ГруппаФормы"), Элементы.ГруппаПраво, Элементы.ГруппаСклад);
	ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;// .Вертикальная;
	
	//Если Элементы.Найти("ВИЛС_НомерЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДоверенностьНомер", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДоверенностьНомер";
		ДобавляемыйЭлемент.Заголовок				= "Доверенность";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 15;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	//КонецЕсли;
	//Если Элементы.Найти("ВИЛС_ДатаЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДоверенностьДата", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//, Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДоверенностьДата";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.Заголовок				= "от";
		ДобавляемыйЭлемент.Ширина					= 8;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	//КонецЕсли;
	
	ДобавляемыйЭлементГрСВ = Элементы.Вставить("МаршрутГруппаПолучателиОтправителиКонтактноеЛицо", Тип("ГруппаФормы"), Элементы.МаршрутГруппаАдресЗонаПолучатели);
	ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ГруппаКолонок;
	//ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	//ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаКолонок.Горизонтальная;
	
	Элементы.Переместить(Элементы.МаршрутПолучателиОтправители, ДобавляемыйЭлементГрСВ);
	
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_КонтактныеЛица", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//, Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеНадписи; 
	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.Маршрут.ВИЛС_КонтактныеЛица";
	ДобавляемыйЭлемент.ГиперссылкаЯчейки 		= Истина;
	ДобавляемыйЭлемент.Видимость				= Истина;
	ДобавляемыйЭлемент.Заголовок				= "Контактные лица";
	//ДобавляемыйЭлемент.Ширина					= 8;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	//ДобавляемыйЭлемент.УстановитьДействие("Нажатие", "ВИЛС_Подключаемый_Нажатие_ВИЛС_КонтактныеЛица");
	
	ДобавляемыйЭлемент = Элементы.Вставить("Организация", Тип("ПолеФормы"), Элементы.ГруппаПраво, Элементы.Приоритет);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.Организация";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Организация";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_Руководитель", Тип("ПолеФормы"), Элементы.ГруппаПраво, Элементы.Ответственный);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_Руководитель";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Руководитель";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;	
	
			
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ГлавныйБухгалтер", Тип("ПолеФормы"), Элементы.ГруппаПраво, Элементы.Ответственный);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ГлавныйБухгалтер";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Главный бухгалтер";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;	

	Элементы.Переместить(Элементы.Склад, Элементы.ГруппаЛево);
	Элементы.Переместить(Элементы.Ответственный, Элементы.ГруппаЛево);
	
	ДобавляемыйЭлементГрСВ1 = Элементы.Вставить("ГруппаХарактеристикиГруза", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.ГруппаДополнительныеРеквизиты);
	ДобавляемыйЭлементГрСВ1.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	ДобавляемыйЭлементГрСВ1.Отображение			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ1.ОтображатьЗаголовок = Ложь;

	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ГабаритыГруза", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ1);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ГабаритыГруза";
	ДобавляемыйЭлемент.Заголовок				= "Габариты";  
	ДобавляемыйЭлемент.Подсказка				= "Габариты(кол-во мест, вес 1 места, размеры)";

	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ТребуемыйТипПодсостава", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ1);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ТребуемыйТипПодсостава";
	ДобавляемыйЭлемент.Заголовок				= "Подсостав";  
	ДобавляемыйЭлемент.Подсказка				= "Требуемый тип подсостава";

	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ПогрузкаРазгрузка", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ1);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ПогрузкаРазгрузка";
	ДобавляемыйЭлемент.Заголовок				= "Погрузка";   
	ДобавляемыйЭлемент.Подсказка                = "Погрузка (разгрузка)";
	
	Элементы.МаршрутАдрес.КнопкаВыпадающегоСписка = Истина;
	Элементы.МаршрутАдрес.РежимРедактирования	= РежимРедактированияКолонки.Непосредственно;
	
	Для Каждого ЭлементКоманд Из Элементы.ФормаГлобальныеКоманды.ПодчиненныеЭлементы Цикл
		Если ЭлементКоманд.Имя = "ФормаДокументТранспортнаяНакладнаяОформитьТранспортныеНакладныеПоЗаданиямНаПеревозку" Тогда
			ЭлементКоманд.Видимость = Ложь;
			
			ИмяКоманды 		= "ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные";
			Команда = Команды.Добавить(ИмяКоманды);
		    Команда.Действие = "ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные";
		
			НоваяКнопка = Элементы.Вставить("ВИЛС_ФормаДокументТранспортнаяНакладнаяОформитьТранспортныеНакладныеПоЗаданиямНаПеревозку", Тип("КнопкаФормы"), Элементы.ФормаГлобальныеКоманды, Элементы.ФормаГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании);
			НоваяКнопка.Вид 			= ВидКнопкиФормы.КнопкаКоманднойПанели;
			НоваяКнопка.Заголовок 		= "Оформить ТТН";
			НоваяКнопка.ИмяКоманды 		= "ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные";
			НоваяКнопка.Отображение 	= ОтображениеКнопки.Картинка;
			НоваяКнопка.Картинка		= БиблиотекаКартинок.ТранспортнаяНакладная;
		Иначе	
			ЭлементКоманд.Видимость = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	//ЗаполнитьТЗАдресовКонтрагентов();
КонецПроцедуры	

//&НаСервере
//Процедура ЗаполнитьТЗАдресовКонтрагентов()
//	ТекстЗапроса = "
//	|ВЫБРАТЬ
//	|	ТЗ.КлючСвязи 			КАК КлючСвязи,
//	|   ТЗ.Адрес 				КАК Адрес,
//	|   ТЗ.АдресЗначенияПолей 	КАК АдресЗначенияПолей
//	|ИЗ
//	|   &ТЗАдресовКонтрагентов КАК ТЗ
//	|;
//	|ВЫБРАТЬ
//	|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи 		КАК КлючСвязи,
//	|	КонтрагентыКонтактнаяИнформация.Представление 	КАК Адрес,
//	|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей 	КАК АдресЗначенияПолей
//	|ИЗ
//	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
//	|		ПО ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
//	|			И КонтрагентыКонтактнаяИнформация.Тип = Значение(Перечисление.ТипыКонтактнойИнформации.Адрес)
//	|ГДЕ
//	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &Ссылка";
//КонецПроцедуры

&НаСервере
Процедура ВИЛС_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	Если Не Параметры.Ключ.Пустая() Тогда
		ВИЛС_ПереопределитьРеквизиты();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВИЛС_ОбработкаЗаполненияПоЗаказПоставщикуПродолжение(Объект, ДанныеЗаполнения, ДанныеОснований)
	Если ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки") Тогда
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
		Объект.Операция 		= Перечисления.ВидыДоставки.НаСклад;
		Объект.Перевозчик		= ДанныеЗаполнения.ПеревозчикПартнер;
		Адрес 					= ДанныеЗаполнения.АдресДоставкиПеревозчика;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиПеревозчикаЗначенияПолей;
	ИначеЕсли ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада") Тогда
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
		Объект.Операция 		= Перечисления.ВидыДоставки.НаСклад;
		Объект.Перевозчик		= ДанныеЗаполнения.Контрагент.Партнер;
		Адрес 					= ДанныеЗаполнения.АдресДоставки;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
	ИначеЕсли ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя") 
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба;
		Объект.Операция 		= Перечисления.ВидыДоставки.НаСклад;
		Объект.Контрагент 		= ДанныеЗаполнения.Контрагент;
		Адрес 					= ДанныеЗаполнения.АдресДоставки;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
	Иначе
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба;
		Объект.Операция 		= Перечисления.ВидыДоставки.СоСклада;   
		Объект.Контрагент 		= ДанныеЗаполнения.Контрагент;
		Адрес 					= ДанныеЗаполнения.АдресДоставки;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
	КонецЕсли;
	Зона 						= ДанныеЗаполнения.ЗонаДоставки;
	ВремяС 						= ДанныеЗаполнения.ВремяДоставкиС;
	ВремяПо 					= ДанныеЗаполнения.ВремяДоставкиПо;
	ДополнительнаяИнформация	= ДанныеЗаполнения.ДополнительнаяИнформацияПоДоставке;

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка)															КАК ЗаданиеНаПеревозку,
	|   ТоварыЗаказа.Ссылка 																						КАК Распоряжение,
	|   ТоварыЗаказа.Ссылка.Склад																					КАК Склад,
	|   ТоварыЗаказа.Номенклатура																					КАК Номенклатура,
	|   ТоварыЗаказа.Характеристика																					КАК Характеристика,
	|   ТоварыЗаказа.Назначение																						КАК Назначение,
	|   СУММА(ТоварыЗаказа.Количество)																				КАК Количество,
	|	ИСТИНА 																										КАК ВсеТовары,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыЗаказа.Ссылка.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА ТоварыЗаказа.Ссылка.Контрагент.Партнер
	|		ИНАЧЕ ТоварыЗаказа.Ссылка.Партнер
	|	КОНЕЦ 																										КАК ПолучательОтправитель,
	|   ТоварыЗаказа.Ссылка.КонтактноеЛицо 																			КАК ВИЛС_КонтактноеЛицо,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения.Код = ""166 ""
	//|				ТОГДА ТоварыЗаказа.Количество
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) 																									КАК КоличествоКГ,
	|	СУММА(&ТекстЗапросаВесНоменклатуры * ТоварыЗаказа.Количество)												КАК Вес,
	|	СУММА(&ТекстЗапросаОбъемНоменклатуры * ТоварыЗаказа.Количество)												КАК Объем
	|ПОМЕСТИТЬ ТоварыЗаказа
	|ИЗ Документ.ЗаказПоставщику.Товары КАК ТоварыЗаказа
	|	
	|ГДЕ ТоварыЗаказа.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.Ссылка,
	|	ТоварыЗаказа.Ссылка.Склад,
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыЗаказа.Ссылка.ПеревозчикПартнер, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА ТоварыЗаказа.Ссылка.Партнер
	|		ИНАЧЕ ТоварыЗаказа.Ссылка.ПеревозчикПартнер
	|	КОНЕЦ,
	|   ТоварыЗаказа.Ссылка.КонтактноеЛицо
	|
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаданиеНаПеревозку,
	|	Распоряжение,
	|	Склад,
	|	Номенклатура,
	|	Характеристика,
	|	Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыЗаказа.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение КАК Распоряжение,
	|	ТоварыЗаказа.Склад КАК Склад,
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Назначение КАК Назначение,
	|	СУММА(ТоварыКДоставке.Количество) КАК Количество,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения.Код = ""166 ""
	//|				ТОГДА ТоварыКДоставке.Количество
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК КоличествоКГ,
	|	СУММА(ТоварыКДоставке.Вес) КАК Вес,
	|	СУММА(ТоварыКДоставке.Объем) КАК Объем
	|ПОМЕСТИТЬ ТоварыКДоставке
	|ИЗ
	|	ТоварыЗаказа КАК ТоварыЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО (ТоварыЗаказа.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыЗаказа.Склад = ТоварыКДоставке.Склад
	|				И ТоварыЗаказа.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыЗаказа.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыЗаказа.Назначение = ТоварыКДоставке.Назначение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение,
	|	ТоварыЗаказа.Склад,
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Назначение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаданиеНаПеревозку,
	|	Распоряжение,
	|	Склад,
	|	Номенклатура,
	|	Характеристика,
	|	Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыЗаказа.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение КАК Распоряжение,
	|	ТоварыЗаказа.Склад КАК Склад,
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Назначение КАК Назначение,
	|	СУММА(ТоварыЗаказа.Количество) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) КАК Количество,
	|	ВЫБОР
	|		КОГДА Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Склады.ДатаНачалаОрдернойСхемыПриОтгрузке < &ДатаДокумента
	|				И СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) > 0
	|			ТОГДА ЛОЖЬ
	|       КОГДА СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) > 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ КАК ВсеТовары,
	|	ТоварыЗаказа.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТоварыЗаказа.ВИЛС_КонтактноеЛицо КАК ВИЛС_КонтактноеЛицо,
	//|	СУММА(ТоварыЗаказа.КоличествоКГ) - СУММА(ЕСТЬNULL(ТоварыКДоставке.КоличествоКГ, 0)) КАК КоличествоКГ,
	//|	ВЫБОР
	//|		КОГДА СУММА(ТоварыЗаказа.Вес) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Вес, 0)) = 0
	//|			ТОГДА СУММА(ТоварыЗаказа.КоличествоКГ) - СУММА(ЕСТЬNULL(ТоварыКДоставке.КоличествоКГ, 0))
	//|		ИНАЧЕ СУММА(ТоварыЗаказа.Вес) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Вес, 0))
	//|	КОНЕЦ КАК Вес,
	|	СУММА(ТоварыЗаказа.Вес) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Вес, 0)) КАК Вес,
	|	СУММА(ТоварыЗаказа.Объем) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Объем, 0)) КАК Объем
	|ИЗ
	|	ТоварыЗаказа КАК ТоварыЗаказа
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|	ПО ТоварыЗаказа.Склад = Склады.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО (ТоварыЗаказа.ЗаданиеНаПеревозку = ТоварыКДоставке.ЗаданиеНаПеревозку
	|				И ТоварыЗаказа.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыЗаказа.Склад = ТоварыКДоставке.Склад
	|				И ТоварыЗаказа.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыЗаказа.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыЗаказа.Назначение = ТоварыКДоставке.Назначение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение,
	|	ТоварыЗаказа.Склад,
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Назначение,
	|	ТоварыЗаказа.ВсеТовары,
	|	ТоварыЗаказа.ПолучательОтправитель,
	|	ТоварыЗаказа.ВИЛС_КонтактноеЛицо,
	|	Склады.ИспользоватьОрдернуюСхемуПриОтгрузке,
	|	Склады.ДатаНачалаОрдернойСхемыПриОтгрузке
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыЗаказа.Количество) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Распоряжение,
	|	Склад,
	|	Номенклатура,
	|	Характеристика,
	|	Назначение,
	|	ПолучательОтправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКДоставке
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
		"ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения",
		"ТоварыЗаказа.Номенклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаОбъемНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
		"ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения",
		"ТоварыЗаказа.Номенклатура"));
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Заказ"			, ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ДатаДокумента"	, Объект.Дата);
	ТаблицаТоварыКДоставке = Запрос.Выполнить().Выгрузить();
	
	НоваяСтрокаР = Объект.Распоряжения.Добавить();
	НоваяСтрокаР.КлючСвязи 					= Строка(Новый УникальныйИдентификатор);
	НоваяСтрокаР.Распоряжение 				= ДанныеЗаполнения;
	НоваяСтрокаР.Вес 						= ТаблицаТоварыКДоставке.Итог("Вес");
	НоваяСтрокаР.Объем 						= ТаблицаТоварыКДоставке.Итог("Объем");
	НоваяСтрокаР.Перевозчик 				= ДанныеЗаполнения.ПеревозчикПартнер;
	НоваяСтрокаР.ПолучательОтправитель 		= ДанныеЗаполнения.Партнер;
	НоваяСтрокаР.ВИЛС_КонтактноеЛицо		= ДанныеЗаполнения.КонтактноеЛицо;
	НоваяСтрокаР.ВремяС						= ДанныеЗаполнения.ВремяДоставкиС;
	НоваяСтрокаР.ВремяПо					= ДанныеЗаполнения.ВремяДоставкиПо;
	НоваяСтрокаР.ДополнительнаяИнформация 	= ДанныеЗаполнения.ДополнительнаяИнформация;
	Если ДанныеОснований.Склады.Количество() > 0 Тогда
		НоваяСтрокаР.Склад = ДанныеОснований.Склады[0];
	Иначе
		НоваяСтрокаР.Склад = Справочники.Склады.СкладПоУмолчанию();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Склад = НоваяСтрокаР.Склад;
	КонецЕсли;	
	НоваяСтрокаР.ДоставляетсяПолностью 		= ПолучитьМинимум(ТаблицаТоварыКДоставке);//?(ТаблицаТоварыКДоставке.Количество(), ТаблицаТоварыКДоставке[0].ВсеТовары, Ложь);
	
	НоваяСтрокаМ = Объект.Маршрут.Добавить();
	НоваяСтрокаМ.Адрес						= Адрес;
	НоваяСтрокаМ.Зона						= Зона;
	НоваяСтрокаМ.ВремяС						= ВремяС;
	НоваяСтрокаМ.ВремяПо					= ВремяПо;     
	НоваяСтрокаМ.Вес 						= НоваяСтрокаР.Вес;
	НоваяСтрокаМ.Объем 						= НоваяСтрокаР.Объем;
	НоваяСтрокаМ.КлючСвязи 					= НоваяСтрокаР.КлючСвязи;
	НоваяСтрокаМ.ДополнительнаяИнформация 	= ДополнительнаяИнформация;
	НоваяСтрокаМ.АдресЗначенияПолей 		= АдресЗначенияПолей;
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(Строка(НоваяСтрокаР.ПолучательОтправитель));
	МассивСтрок.Добавить(Строка(НоваяСтрокаР.Склад));
	НоваяСтрокаМ.ПолучателиОтправители 		= СтрСоединить(МассивСтрок, ", ");
	
	Возврат(ТаблицаТоварыКДоставке);
КонецФункции	

&НаСервере
Функция ПолучитьМинимум(ТаблицаТоварыКДоставке)
	Перем МинимумВсеТовары;
	МинимумВсеТовары = Истина;
	Для Каждого СтрокаТЗ Из ТаблицаТоварыКДоставке Цикл
		МинимумВсеТовары = МинимумВсеТовары и СтрокаТЗ.ВсеТовары;
	КонецЦикла;	
	Возврат(МинимумВсеТовары);
КонецФункции

&НаСервере
&Вместо("НастроитьПоТипуИсполнителя")
Процедура ВИЛС_НастроитьПоТипуИсполнителя()
	
	ВыполняетПеревозчик = Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
	
	Элементы.Перевозчик.Видимость       		= ВыполняетПеревозчик;
	//Элементы.Водитель.Видимость         		= Не ВыполняетПеревозчик;     // fix Suetin 02.08.2019 17:05:35
	Элементы.ВИЛС_КурьерЭкспедитор.Видимость 	= Не ВыполняетПеревозчик;
	Элементы.РеквизитыТТН.Видимость     		= //ВыполняетПеревозчик         // begin fix Suetin 02.08.2019 17:05:45
													//И Объект.Операция = Перечисления.ВидыДоставки.СоСклада
													//И                         // end fix Suetin 02.08.2019 17:05:49
													ПолучитьФункциональнуюОпцию("ИспользоватьТТН");
	Элементы.ВИЛС_ДоговорПеревозчика.Видимость 	= ВыполняетПеревозчик;   // fix Suetin 03.09.2019 10:52:01
	
	Если ВыполняетПеревозчик
		И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ЗаполнитьКонтрагентаИБанковскийСчетПеревозчика();
		КонецЕсли;
		
	Иначе
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		
		Перевозчик = Объект.Перевозчик;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ВодительПриИзменении()
	ВИЛС_ВодительПриИзмененииНаСервере();
КонецПроцедуры	

&НаСервере
Процедура ВИЛС_ВодительПриИзмененииНаСервере()
	
	ПараметрыТТН = Новый Структура;
	ПараметрыТТН.Вставить("ВодительФИО");
	ПараметрыТТН.Вставить("УдостоверениеСерия");
	ПараметрыТТН.Вставить("УдостоверениеНомер");
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Наименование КАК ВодительФИО,
		|	ДокументыФизическихЛиц.Серия КАК УдостоверениеСерия,
		|	ДокументыФизическихЛиц.Номер КАК УдостоверениеНомер
		|ИЗ
		|	Справочник.Контрагенты КАК ФизическиеЛица           // fix Suetin 02.08.2019 17:09:20   ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
		|		ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛиц.Физлицо
		|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.ВИЛС_Водитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыТТН, Выборка);
		КонецЕсли;			
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыТТН);

КонецПроцедуры

&НаКлиенте
&Вместо("РеквизитыТТН")
Процедура ВИЛС_РеквизитыТТН(Команда)
	
	ПараметрыТТН = Новый Структура;
	ПараметрыТТН.Вставить("ЗаданиеНаПеревозку");
	ПараметрыТТН.Вставить("ТранспортноеСредство");
	ПараметрыТТН.Вставить("БанковскийСчетПеревозчика");
	ПараметрыТТН.Вставить("ВодительФИО");
	ПараметрыТТН.Вставить("УдостоверениеСерия");
	ПараметрыТТН.Вставить("УдостоверениеНомер");
	ПараметрыТТН.Вставить("АвтомобильГосударственныйНомер");
	ПараметрыТТН.Вставить("АвтомобильМарка");
	ПараметрыТТН.Вставить("ВидПеревозки");
	ПараметрыТТН.Вставить("АвтомобильТип");
	ПараметрыТТН.Вставить("АвтомобильВместимостьВКубическихМетрах");
	ПараметрыТТН.Вставить("АвтомобильГрузоподъемностьВТоннах");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаСерия");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаНомер");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаВид");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаРегистрационныйНомер");
	ПараметрыТТН.Вставить("Прицеп");
	ПараметрыТТН.Вставить("ГосударственныйНомерПрицепа");
	ПараметрыТТН.Вставить("Партнер");                // fix Suetin 13.08.2019 18:56:52
	ЗаполнитьЗначенияСвойств(ПараметрыТТН, Объект);
	
	Если Объект.ЗаданиеВыполняет = ПредопределенноеЗначение("Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик") Тогда
		
		ПараметрыТТН.Вставить("Партнер",    Объект.Перевозчик);
		ПараметрыТТН.Вставить("Перевозчик", Объект.Контрагент);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РеквизитыТТНЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаданиеНаПеревозку.Форма.РеквизитыТТН", ПараметрыТТН, ЭтаФорма, , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
&Вместо("ПослеРедактированияРаспоряженийСервер")
Процедура ВИЛС_ПослеРедактированияРаспоряженийСервер(Результат)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.Вес,       // begin fix Suetin 23.08.2019 11:27:27
	|	ТоварыКДоставке.Объем,     // end fix Suetin 23.08.2019 11:27:31
	|	ТоварыКДоставке.ВсеТовары
	|ПОМЕСТИТЬ ТоварыКДоставке
	|ИЗ
	|	&ТоварыКДоставке КАК ТоварыКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.Вес,       // begin fix Suetin 23.08.2019 11:27:27
	|	ТоварыКДоставке.Объем,     // end fix Suetin 23.08.2019 11:27:31
	|	ТоварыКДоставке.ВсеТовары
	|ПОМЕСТИТЬ ТоварыКДоставкеОтредактированные
	|ИЗ
	|	&ТоварыКДоставкеОтредактированные КАК ТоварыКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Вес,
	|	Распоряжения.Объем,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,  
	|	Распоряжения.ВИЛС_КонтактноеЛицо,
	|	Распоряжения.ВремяС,
	|	Распоряжения.ВремяПо,
	|	Распоряжения.ДополнительнаяИнформация,
	|	Распоряжения.Доставлено,
	|	Распоряжения.Склад,
	|	Распоряжения.ДоставляетсяПолностью
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	&Распоряжения КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Вес,
	|	Распоряжения.Объем,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.ВремяС,
	|	Распоряжения.ВремяПо,
	|	Распоряжения.ДополнительнаяИнформация,
	|	Распоряжения.Доставлено,
	|	Распоряжения.Склад,
	|	Распоряжения.ДоставляетсяПолностью
	|ПОМЕСТИТЬ РаспоряженияОтредактированные
	|ИЗ
	|	&РаспоряженияОтредактированные КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияОтредактированные.КлючСвязи,
	|	РаспоряженияОтредактированные.Распоряжение,
	|	РаспоряженияОтредактированные.Перевозчик,
	|	РаспоряженияОтредактированные.ПолучательОтправитель,
	|	РаспоряженияОтредактированные.Распоряжение.КонтактноеЛицо КАК ВИЛС_КонтактноеЛицо,         // fix Suetin 30.08.2019 15:01:08
	|	РаспоряженияОтредактированные.ВремяС,
	|	РаспоряженияОтредактированные.ВремяПо,
	|	РаспоряженияОтредактированные.ДополнительнаяИнформация,
	|	РаспоряженияОтредактированные.Склад,
	|	РаспоряженияОтредактированные.Вес КАК Вес,
	|	РаспоряженияОтредактированные.Объем КАК Объем,
	|	РаспоряженияОтредактированные.Доставлено КАК Доставлено,
	|	РаспоряженияОтредактированные.ДоставляетсяПолностью КАК ДоставляетсяПолностью
	|ПОМЕСТИТЬ РаспоряженияРезультат
	|ИЗ
	|	РаспоряженияОтредактированные КАК РаспоряженияОтредактированные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.ВИЛС_КонтактноеЛицо,         														// fix Suetin 30.08.2019 15:01:35
	|	Распоряжения.ВремяС,
	|	Распоряжения.ВремяПо,
	|	Распоряжения.ДополнительнаяИнформация,
	|	Распоряжения.Склад,
	|	Распоряжения.Вес,
	|	Распоряжения.Объем,
	|	Распоряжения.Доставлено,
	|	Распоряжения.ДоставляетсяПолностью
	|ИЗ
	|	Распоряжения КАК Распоряжения
	|ГДЕ
	|	Распоряжения.КлючСвязи <> &КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УдаленныеРаспоряжения.Распоряжение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Распоряжения.Распоряжение КАК Распоряжение,
	|		1 КАК ПолеСворачивания
	|	ИЗ
	|		Распоряжения КАК Распоряжения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РаспоряженияРезультат.Распоряжение,
	|		-1
	|	ИЗ
	|		РаспоряженияРезультат КАК РаспоряженияРезультат) КАК УдаленныеРаспоряжения
	|
	|СГРУППИРОВАТЬ ПО
	|	УдаленныеРаспоряжения.Распоряжение
	|
	|ИМЕЮЩИЕ
	|	СУММА(УдаленныеРаспоряжения.ПолеСворачивания) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияРезультат.КлючСвязи,
	|	РаспоряженияРезультат.Распоряжение,
	|	РаспоряженияРезультат.Перевозчик,
	|	РаспоряженияРезультат.ПолучательОтправитель,
	|	РаспоряженияРезультат.ВИЛС_КонтактноеЛицо,    // fix Suetin 30.08.2019 15:00:16
	|	РаспоряженияРезультат.ВремяС,
	|	РаспоряженияРезультат.ВремяПо,
	|	РаспоряженияРезультат.ДополнительнаяИнформация,
	|	РаспоряженияРезультат.Склад,
	|	РаспоряженияРезультат.Вес,
	|	РаспоряженияРезультат.Объем,
	|	РаспоряженияРезультат.Доставлено,
	|	РаспоряженияРезультат.ДоставляетсяПолностью
	|ИЗ
	|	РаспоряженияРезультат КАК РаспоряженияРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РаспоряженияОтредактированные.Вес) КАК Вес,
	|	СУММА(РаспоряженияОтредактированные.Объем) КАК Объем,
	|	МИНИМУМ(РаспоряженияОтредактированные.Доставлено) КАК Доставлено,
	|	КОЛИЧЕСТВО(*) КАК КоличествоРаспоряжений
	|ИЗ
	|	РаспоряженияОтредактированные КАК РаспоряженияОтредактированные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.Вес,      					// begin fix Suetin 23.08.2019 11:28:00
	|	ТоварыКДоставке.Объем,    					// end fix Suetin 23.08.2019 11:28:04
	|	ТоварыКДоставке.ВсеТовары
	|ИЗ
	|	ТоварыКДоставке КАК ТоварыКДоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распоряжения КАК Распоряжения
	|		ПО (Распоряжения.Распоряжение = ТоварыКДоставке.Распоряжение)
	|			И (Распоряжения.Склад = ТоварыКДоставке.Склад)
	|ГДЕ
	|	Распоряжения.КлючСвязи <> &КлючСвязи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКДоставкеОтредактированные.Распоряжение,
	|	ТоварыКДоставкеОтредактированные.Склад,
	|	ТоварыКДоставкеОтредактированные.ПолучательОтправитель,
	|	ТоварыКДоставкеОтредактированные.Номенклатура,
	|	ТоварыКДоставкеОтредактированные.Характеристика,
	|	ТоварыКДоставкеОтредактированные.Назначение,
	|	ТоварыКДоставкеОтредактированные.Серия,
	|	ТоварыКДоставкеОтредактированные.Количество,
	|	ТоварыКДоставкеОтредактированные.Вес,      	// begin fix Suetin 23.08.2019 11:28:00
	|	ТоварыКДоставкеОтредактированные.Объем,    	// end fix Suetin 23.08.2019 11:28:04
	|	ТоварыКДоставкеОтредактированные.ВсеТовары
	|ИЗ
	|	ТоварыКДоставкеОтредактированные КАК ТоварыКДоставкеОтредактированные";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	СтрокаПункт = Объект.Маршрут.НайтиПоИдентификатору(Элементы.Маршрут.ТекущаяСтрока);
	
	Запрос.УстановитьПараметр("РаспоряженияОтредактированные", ПолучитьИзВременногоХранилища(Результат.АдресРаспоряжений));
	Запрос.УстановитьПараметр("ТоварыКДоставкеОтредактированные", ПолучитьИзВременногоХранилища(Результат.АдресТоваровКДоставке));
	Запрос.УстановитьПараметр("ТоварыКДоставке", ТоварыКДоставке.Выгрузить());
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());
	Запрос.УстановитьПараметр("КлючСвязи", СтрокаПункт.КлючСвязи);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВГраница = РезультатЗапроса.ВГраница();
	
	Выборка = РезультатЗапроса[ВГраница-1].Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоРаспоряжений = 0 Тогда
		Объект.Маршрут.Удалить(СтрокаПункт);
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокаПункт,Выборка);
	КонецЕсли;
	
	Объект.Распоряжения.Загрузить(РезультатЗапроса[ВГраница-2].Выгрузить());
	
	УдаленныеРаспоряжения = РезультатЗапроса[ВГраница-3].Выгрузить().ВыгрузитьКолонку("Распоряжение");
	Если УдаленныеРаспоряжения.Количество() > 0 Тогда
		Документы.ТранспортнаяНакладная.АктуализироватьТранспортныеНакладныеИзЗаданияНаПеревозку(
			УдаленныеРаспоряжения, Объект.Ссылка, СтрокаПункт.НомерСтроки);
	КонецЕсли;
	
	ТоварыКДоставке.Загрузить(РезультатЗапроса[ВГраница].Выгрузить());
	ДоставкаТоваров.ЗаполнитьПризнакДоставляетсяПолностью(ТоварыКДоставке.Выгрузить(), Объект.Распоряжения);
	
	ЗаполнитьСлужебныеРеквизитыМаршрута();
	ОбновитьИтоговыйВесОбъемЗаполненность(ЭтаФорма);
	ОбновитьСкладыПогрузки();
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьСлужебныеРеквизитыМаршрута")
Процедура ВИЛС_ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки)
	
	Результат = Неопределено;
	РассчитатьНаличиеТТН = ПолучитьФункциональнуюОпцию("ИспользоватьТТН") 
		И ПравоДоступа("Чтение", Метаданные.Документы.ТранспортнаяНакладная);
		
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.ВИЛС_КонтактноеЛицо,               	// end fix Suetin 30.08.2019 16:09:43
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.НомерСтроки
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	&Распоряжения КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Маршрут.НомерСтроки,
	|	Маршрут.КлючСвязи
	|ПОМЕСТИТЬ Маршрут
	|ИЗ
	|	&Маршрут КАК Маршрут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,      
	|	Распоряжения.ВИЛС_КонтактноеЛицо,                 																			// begin fix Suetin 26.09.2019 11:56:11
	|   КонтактныеЛицаТелефон.Представление КАК Телефон,
	|   КонтактныеЛицаМобильныйТелефон.Представление КАК МобильныйТелефон,   														// end fix Suetin 26.09.2019 11:57:07
	|	Маршрут.НомерСтроки КАК НомерСтрокиМаршрута,
	|	Распоряжения.НомерСтроки КАК НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ РаспоряженияПоМаршрутам
	|ИЗ
	|	Маршрут КАК Маршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распоряжения КАК Распоряжения
	|		ПО Маршрут.КлючСвязи = Распоряжения.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаТелефон      				// begin fix Suetin 26.09.2019 11:55:54
	|		ПО (Распоряжения.ВИЛС_КонтактноеЛицо = КонтактныеЛицаТелефон.Ссылка)
	|			И (КонтактныеЛицаТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактныеЛицаТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаМобильныйТелефон
	|		ПО (Распоряжения.ВИЛС_КонтактноеЛицо = КонтактныеЛицаМобильныйТелефон.Ссылка)
	|			И (КонтактныеЛицаМобильныйТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактныеЛицаМобильныйТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица))    // end fix Suetin 26.09.2019 11:56:03
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка КАК Накладная,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ НакладныеПоЗаданиямНаПеревозку
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказНаПеремещение
	|			И Распоряжения.Склад = ДокументТовары.Ссылка.СкладОтправитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//++ НЕ УТКА
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДавальцу.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказДавальца
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказПереработчику
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|ГДЕ
	|	(Распоряжения.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
	//++ НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаСырьяПереработчику
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаТоваровХранителю
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ВозвратТоваровПоставщику)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений КАК НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.НомерСтрокиМаршрута) КАК НомерСтрокиМаршрута,
	|	МАКСИМУМ(НЕ ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка ЕСТЬ NULL ) КАК ТранспортнаяНакладнаяОформлена,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик) КАК Перевозчик,      
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ВИЛС_КонтактноеЛицо) КАК ВИЛС_КонтактноеЛицо,                 	// begin fix Suetin 26.09.2019 11:57:48
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Телефон) КАК Телефон,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.МобильныйТелефон) КАК МобильныйТелефон,                 		// end fix Suetin 26.09.2019 11:57:48
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель) КАК ПолучательОтправитель
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК РаспоряженияПоМаршрутам
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
	|		ПО РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений = НакладныеПоЗаданиямНаПеревозку.НомерСтрокиРаспоряжений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснованияОснования
	|		ПО (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.АдресДоставки = НакладныеПоЗаданиямНаПеревозку.Адрес)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование = НакладныеПоЗаданиямНаПеревозку.Накладная)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиМаршрута,
	|	НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик),
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель)";
	
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());
	Если ОбновляемыеСтроки = Неопределено Тогда
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить(ОбновляемыеСтроки));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",	Объект.Ссылка);
		
	Результат = Запрос.Выполнить().Выбрать();
	ШаблонСПеревозчиком = НСтр("ru = '%Перевозчик% (для %ПолучателиОтправители%)';
								|en = '%Перевозчик% (for %ПолучателиОтправители%)'");
	Пока Результат.СледующийПоЗначениюПоля("НомерСтрокиМаршрута") Цикл
		
		СтрокаМаршрута = Объект.Маршрут[Результат.НомерСтрокиМаршрута - 1];
		ПолучателиОтправителиПоПункту = "";
		КонтактныеЛицаПоПункту = "";        																				// fix Suetin 30.08.2019 16:37:58
		ТранспортнаяНакладнаяОформлена = Ложь;
		КоличествоРаспоряжений = 0;
		
		Пока Результат.СледующийПоЗначениюПоля("Перевозчик") Цикл
			
			ПолучателиОтправителиПоПеревозчику = "";	
			КонтактныеЛицаПоПеревозчику = "";      																			// fix Suetin 30.08.2019 15:59:18
			Пока Результат.СледующийПоЗначениюПоля("ПолучательОтправитель") Цикл
				
				Пока Результат.Следующий() Цикл
					КоличествоРаспоряжений = КоличествоРаспоряжений + 1;
					ТранспортнаяНакладнаяОформлена = Макс(ТранспортнаяНакладнаяОформлена, Результат.ТранспортнаяНакладнаяОформлена);
				КонецЦикла;
				
				ПолучателиОтправителиПоПеревозчику = ПолучателиОтправителиПоПеревозчику + Результат.ПолучательОтправитель + "," + " ";
				КонтактныеЛицаПоПеревозчику = КонтактныеЛицаПоПеревозчику + Результат.ВИЛС_КонтактноеЛицо + ", "                // begin fix Suetin 26.09.2019 12:14:42
					+ ?(ЗначениеЗаполнено(Результат.Телефон), "(т." + Результат.Телефон + "), ", "")
					+ ?(ЗначениеЗаполнено(Результат.МобильныйТелефон), "(т.моб." + Результат.МобильныйТелефон + "), ", "");    	// end fix Suetin 26.09.2019 12:14:49
			КонецЦикла;
			ПолучателиОтправителиПоПеревозчику = Лев(ПолучателиОтправителиПоПеревозчику, СтрДлина(ПолучателиОтправителиПоПеревозчику)-2);   
			КонтактныеЛицаПоПеревозчику = Лев(КонтактныеЛицаПоПеревозчику, СтрДлина(КонтактныеЛицаПоПеревозчику)-2);   		// fix Suetin 30.08.2019 16:37:08
			Если ЗначениеЗаполнено(Результат.Перевозчик) Тогда
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ШаблонСПеревозчиком, "%ПолучателиОтправители%", ПолучателиОтправителиПоПеревозчику);
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ПолучателиОтправителиПоПеревозчику, "%Перевозчик%", Результат.Перевозчик);
			КонецЕсли;
			ПолучателиОтправителиПоПункту = ПолучателиОтправителиПоПункту + ПолучателиОтправителиПоПеревозчику + "," + " ";   
			КонтактныеЛицаПоПункту = КонтактныеЛицаПоПункту + КонтактныеЛицаПоПеревозчику + "," + " ";           			// fix Suetin 30.08.2019 16:36:47
		КонецЦикла;
		
		СтрокаМаршрута.ПолучателиОтправители = ПолучателиОтправителиПоПункту
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоРаспоряжений, НСтр("ru = 'распоряжение, распоряжения, распоряжений';
																												|en = 'reference, reference, references'"))
			+ НСтр("ru = '...';
					|en = '...'");
																															// begin fix Suetin 30.08.2019 16:36:53	
		СтрокаМаршрута.ВИЛС_КонтактныеЛица = КонтактныеЛицаПоПункту
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоРаспоряжений, НСтр("ru = 'распоряжение, распоряжения, распоряжений';
																												|en = 'reference, reference, references'"))
			+ НСтр("ru = '...';
					|en = '...'");
																															// fix Suetin 30.08.2019 16:36:58
		Если РассчитатьНаличиеТТН Тогда
			СтрокаМаршрута.ТранспортнаяНакладнаяОформлена = ТранспортнаяНакладнаяОформлена;
		КонецЕсли;
		
		СтрокаМаршрута.ВремяСБезДаты   = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяС);
		СтрокаМаршрута.ВремяПоБезДаты  = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяПо);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_МаршрутВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Поле.Имя = "ВИЛС_КонтактныеЛица" Тогда
		СтандартнаяОбработка = Ложь; 
		ПараметрыОтбора = Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи);
		МассивСтрокРаспоряжений = Объект.Распоряжения.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрокРаспоряжений.Количество() Тогда
			ТекущаяСтрокаРаспоряжений = МассивСтрокРаспоряжений[0];
			Если ТипЗнч(ТекущаяСтрокаРаспоряжений.ПолучательОтправитель) = Тип("СправочникСсылка.Партнеры") Тогда 
				ПараметрОтбор = Новый Структура;
				ПараметрОтбор.Вставить("Владелец", ТекущаяСтрокаРаспоряжений.ПолучательОтправитель);
				ПараметрыФормы = Новый Структура("Отбор", ПараметрОтбор);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактирования_ВИЛС_КонтактныеЛица",ЭтотОбъект, ПараметрыОтбора);
				ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", 
					ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеРедактирования_ВИЛС_КонтактныеЛица(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	//ПослеРедактированияРаспоряженийСервер(Результат);
	ПараметрыОтбора = Новый Структура("КлючСвязи", ДополнительныеПараметры.КлючСвязи);
	МассивСтрокРаспоряжений = Объект.Распоряжения.НайтиСтроки(ПараметрыОтбора);       
	Если МассивСтрокРаспоряжений.Количество() Тогда
		МассивСтрокРаспоряжений[0].ВИЛС_КонтактноеЛицо = Результат;
	КонецЕсли;	
	ПослеРедактирования_ВИЛС_КонтактныеЛицаНаСервере(ПараметрыОтбора);
КонецПроцедуры

&НаСервере
Процедура ПослеРедактирования_ВИЛС_КонтактныеЛицаНаСервере(Знач ПараметрыОтбора)
	ОбновляемыеСтроки = Объект.Маршрут.НайтиСтроки(ПараметрыОтбора);       
	Если ОбновляемыеСтроки.Количество() Тогда
		ВИЛС_ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки)	
	КонецЕсли;	
КонецПроцедуры	

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();	
	ВыделенныеСтрокиИдентификаторы = Элементы.Маршрут.ВыделенныеСтроки;
	
	Если ВыделенныеСтрокиИдентификаторы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно создать транспортные накладные. Не выделено ни одного адреса доставки.';
								|en = 'Cannot create consignment notes. No delivery address is selected.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Маршрут");
		Возврат;
	КонецЕсли;

	СозданныеТраспортныеНакладные = ВИЛССоздатьТранспортныеНакладныеНаСервере(ВыделенныеСтрокиИдентификаторы);
						
	Если СозданныеТраспортныеНакладные.Количество() = 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СозданныеТраспортныеНакладные[0]);
		
		ОткрытьФорму(
				"Документ.ТранспортнаяНакладная.ФормаОбъекта", 
				ПараметрыФормы);
				
	ИначеЕсли СозданныеТраспортныеНакладные.Количество() > 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТранспортныеНакладные", СозданныеТраспортныеНакладные);
		
		ОткрытьФорму(
				"Документ.ТранспортнаяНакладная.Форма.СозданныеТранспортныеНакладные", 
				ПараметрыФормы);
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВИЛССоздатьТранспортныеНакладныеНаСервере(ВыделенныеСтрокиИдентификаторы)
	
	ВыделенныеСтроки = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтрокиИдентификаторы Цикл
		ИсходныйНомерСтроки = Объект.Маршрут.НайтиПоИдентификатору(ИдентификаторСтроки).ИсходныйНомерСтроки;
		ВыделенныеСтроки.Добавить(ИсходныйНомерСтроки);
	КонецЦикла;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	ЗаданияНаПеревозкуДляОформленияТН = Документы.ТранспортнаяНакладная.ПроверитьЗаданияНаПеревозкуДляОформленияТранспортныхНакладных(
		МассивОбъектов, ВыделенныеСтроки);
	
	СозданныеТранспортныеНакладные = Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладныеДляЗаданийНаПеревозку(
			ЗаданияНаПеревозкуДляОформленияТН, 
			ВыделенныеСтроки);
			
	ЗаполнитьСлужебныеРеквизитыМаршрута();
			
	Возврат СозданныеТранспортныеНакладные;
	
КонецФункции

&НаКлиенте
Процедура ВИЛС_МаршрутПередНачаломИзмененияПеред(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "МаршрутАдрес"
		и Не Элементы.МаршрутАдрес.СписокВыбора.Количество() Тогда
		ТекущиеДанные = Элементы.Маршрут.ТекущиеДанные;
		ПараметрыОтбора = Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи);
		ВИЛС_МаршрутАдресНачалоВыбораИзСпискаПередНаСервере(ПараметрыОтбора);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_МаршрутАдресОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.Маршрут.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
	ВИЛС_МаршрутПередНачаломИзмененияПеред_Окончание(ВыбранноеЗначение, ДополнительныеПараметры);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_МаршрутПередНачаломИзмененияПеред_Окончание(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда	
		ИмяРеквизитаАдресаДоставки = "Адрес";
		
		ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
		    Элементы.МаршрутАдрес,
			ДополнительныеПараметры.ТекущиеДанные,
			ИмяРеквизитаАдресаДоставки,
			Истина);	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда
		ДополнительныеПараметры.ТекущиеДанные.Адрес 				= ВыбранноеЗначение.Значение.АдресДоставки;
		ДополнительныеПараметры.ТекущиеДанные.АдресЗначенияПолей 	= ВыбранноеЗначение.Значение.АдресДоставкиЗначенияПолей;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") тогда
		ДополнительныеПараметры.ТекущиеДанные.Адрес 				= ВыбранноеЗначение.АдресДоставки;
		ДополнительныеПараметры.ТекущиеДанные.АдресЗначенияПолей 	= ВыбранноеЗначение.АдресДоставкиЗначенияПолей;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВИЛС_МаршрутАдресНачалоВыбораИзСпискаПередНаСервере(Знач ПараметрыОтбора)
	МассивСтрокРаспоряжений = Объект.Распоряжения.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрокРаспоряжений.Количество() Тогда
		ТекущаяСтрокаРаспоряжений = МассивСтрокРаспоряжений[0];
		Если ТипЗнч(ТекущаяСтрокаРаспоряжений.ПолучательОтправитель) = Тип("СправочникСсылка.Партнеры") 
			и ЗначениеЗаполнено(ТекущаяСтрокаРаспоряжений.ПолучательОтправитель) Тогда 
			ДоставкаТоваров.ВИЛС_ЗаполнитьСписокВыбораАдресовКонтрагентаПоКонтрагенту(Элементы, ТекущаяСтрокаРаспоряжений.ПолучательОтправитель, "МаршрутАдрес");
		КонецЕсли;
		Если ТипЗнч(ТекущаяСтрокаРаспоряжений.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику")
			и ЗначениеЗаполнено(ТекущаяСтрокаРаспоряжений.Распоряжение) 
			и ЗначениеЗаполнено(ТекущаяСтрокаРаспоряжений.Распоряжение.Контрагент) Тогда
			ДоставкаТоваров.ВИЛС_ЗаполнитьСписокВыбораАдресовКонтрагентаПоКонтрагенту(Элементы, ТекущаяСтрокаРаспоряжений.Распоряжение.Контрагент, "МаршрутАдрес", Ложь);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти