
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма,
		Новый Структура("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты"));
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВИЛС_ПереопределитьРеквизиты();          // begin fix Suetin 22.08.2019 12:26:29
		Если Параметры.Свойство("ОписаниеКоманды")
			и Параметры.ОписаниеКоманды.Вид = "СозданиеНаОсновании" 
			и Параметры.ОписаниеКоманды.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику") Тогда
			МассивДанныеЗаполнения = Новый Массив();
			МассивДанныеЗаполнения.Добавить(Параметры.Основание);
			ДанныеОснований = Документы.ПоручениеЭкспедитору.ДанныеОснований(МассивДанныеЗаполнения);
			ТаблицаТоварыКДоставке = ВИЛС_ОбработкаЗаполненияПоЗаказПоставщикуПродолжение(Объект, Параметры.Основание, ДанныеОснований);
			Если ТипЗнч(ТаблицаТоварыКДоставке) = Тип("ТаблицаЗначений") Тогда
				ТоварыКДоставке.Загрузить(ТаблицаТоварыКДоставке);
			КонецЕсли;
		КонецЕсли;
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяПо);
	ДоставкаТоваров.УстановитьДоступностьАдресовДоставки(ЭтаФорма.Элементы);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры	

&НаСервере
Процедура ВИЛС_ПереопределитьРеквизиты()
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	КвалификаторЧисла = Новый КвалификаторыЧисла(15,3);
	ДопустимыеТипыЧ = Новый ОписаниеТипов(МассивТипов, КвалификаторЧисла);
	МассивРеквизитов = Новый Массив;
	РеквизитФормы = Новый РеквизитФормы("Вес", ДопустимыеТипыЧ, "ТоварыКДоставке", "Вес");
	МассивРеквизитов.Добавить(РеквизитФормы);
	РеквизитФормы = Новый РеквизитФормы("Объем", ДопустимыеТипыЧ, "ТоварыКДоставке", "Объем");
	МассивРеквизитов.Добавить(РеквизитФормы);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	КвалификаторСтроки = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
	ДопустимыеТипыС = Новый ОписаниеТипов(МассивТипов, КвалификаторСтроки);
	РеквизитФормы = Новый РеквизитФормы("ВИЛС_КонтактныеЛица", ДопустимыеТипыС, "Объект.Маршрут", "Контактные лица", Ложь);
	МассивРеквизитов.Добавить(РеквизитФормы);  
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////МассивТипов = Новый Массив;
	////////////////////////////////МассивТипов.Добавить(Тип("ФорматированнаяСтрока"));
	//////////////////////////////////КвалификаторСтроки = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
	////////////////////////////////ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);//, КвалификаторСтроки);
	//////////////////////////////////РеквизитФормы = Новый РеквизитФормы("ТекстТТН", ДопустимыеТипыС, "", " ", Ложь);
	//////////////////////////////////МассивРеквизитов.Добавить(РеквизитФормы);   
	//////////////////////////////////РеквизитФормы = Новый РеквизитФормы("ТекстДокументыНаОсновании", ДопустимыеТипыС, "", " ", Ложь);
	//////////////////////////////////МассивРеквизитов.Добавить(РеквизитФормы);
	////////////////////////////////РеквизитФормы = Новый РеквизитФормы("КоличествоТранспортныхНакладных", ДопустимыеТипыЧ, "", "Количество транспортных накладных", Ложь);
	////////////////////////////////МассивРеквизитов.Добавить(РеквизитФормы); 
	////////////////////////////////МассивТипов = Новый Массив;
	////////////////////////////////МассивТипов.Добавить(Тип("ДокументСсылка.ТранспортнаяНакладная"));
	////////////////////////////////ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
	////////////////////////////////РеквизитФормы = Новый РеквизитФормы("ТранспортнаяНакладная", ДопустимыеТипы, "", "Транспортная накладная", Ложь);
	////////////////////////////////МассивРеквизитов.Добавить(РеквизитФормы);
	////////////////////////////////РеквизитФормы = Новый РеквизитФормы("ТранспортнаяНакладнаяТекст", ДопустимыеТипыС, "", "Транспортная накладная текст", Ложь);
	////////////////////////////////МассивРеквизитов.Добавить(РеквизитФормы);
	////////////////////////////////
	//////////////////////////////////МассивТипов = Новый Массив;
	//////////////////////////////////МассивТипов.Добавить(Тип("ДеревоЗначений"));
	//////////////////////////////////ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
	//////////////////////////////////РеквизитФормы = Новый РеквизитФормы("Дер", ДопустимыеТипы, "", "Дер", Ложь);
	//////////////////////////////////МассивРеквизитов.Добавить(РеквизитФормы);
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Элементы.Водитель.Видимость 		= Ложь;
	Элементы.КурьерЭкспедитор.Видимость = Ложь;
	Если Элементы.Найти("ВИЛС_Водитель") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_Водитель", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ГруппаЛево.ПодчиненныеЭлементы.КурьерЭкспедитор);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_Водитель";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
		ДобавляемыйЭлемент.Заголовок				= "Водитель";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		ДобавляемыйЭлемент.УстановитьДействие("ПриИзменении", "ВИЛС_ВодительПриИзменении");
	КонецЕсли;
	Если Элементы.Найти("ВИЛС_КурьерЭкспедитор") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_КурьерЭкспедитор", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ГруппаЛево.ПодчиненныеЭлементы.КурьерЭкспедитор);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_КурьерЭкспедитор";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
		ДобавляемыйЭлемент.Заголовок				= "Курьер экспедитор";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	КонецЕсли;
	
	//Если Элементы.Найти("ВИЛС_ДоговорПеревозчика") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДоговорПеревозчика", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ТранспортноеСредство);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДоговорПеревозчика";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
		ДобавляемыйЭлемент.Заголовок				= "Договор";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		Если Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба Тогда
			ДобавляемыйЭлемент.Видимость = Ложь;
		КонецЕсли;	
	//КонецЕсли;
	
	ДобавляемыйЭлементГрСВ = Элементы.Вставить("ГруппаРеквизитыЗаявки", Тип("ГруппаФормы"), Элементы.ГруппаПраво, Элементы.ГруппаСклад);
	ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;// .Вертикальная;
	
	//Если Элементы.Найти("ВИЛС_НомерЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_НомерЗаявки", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_НомерЗаявки";
		ДобавляемыйЭлемент.Заголовок				= "Заявка";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 30;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	//КонецЕсли;
	//Если Элементы.Найти("ВИЛС_ДатаЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДатаЗаявки", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//, Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДатаЗаявки";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.Заголовок				= "от";
		ДобавляемыйЭлемент.Ширина					= 8;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	//КонецЕсли;
	
	ДобавляемыйЭлементГрСВ = Элементы.Вставить("ГруппаРеквизитыДоверенности", Тип("ГруппаФормы"), Элементы.ГруппаПраво, Элементы.ГруппаСклад);
	ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;// .Вертикальная;
	
	//Если Элементы.Найти("ВИЛС_НомерЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДоверенностьНомер", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДоверенностьНомер";
		ДобавляемыйЭлемент.Заголовок				= "Доверенность";
		ДобавляемыйЭлемент.МаксимальнаяШирина 		= 15;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
	//КонецЕсли;
	//Если Элементы.Найти("ВИЛС_ДатаЗаявки") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ДоверенностьДата", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//, Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
		ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
	   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ДоверенностьДата";
		ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
		ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ДобавляемыйЭлемент.Заголовок				= "от";
		ДобавляемыйЭлемент.Ширина					= 8;
		ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	//КонецЕсли;
	
	ДобавляемыйЭлементГрСВ = Элементы.Вставить("МаршрутГруппаПолучателиОтправителиКонтактноеЛицо", Тип("ГруппаФормы"), Элементы.МаршрутГруппаАдресЗонаПолучатели);
	ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ГруппаКолонок;
	//ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	//ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаКолонок.Горизонтальная;
	
	Элементы.Переместить(Элементы.МаршрутПолучателиОтправители, ДобавляемыйЭлементГрСВ);
	
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_КонтактныеЛица", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);//, Элементы.ГруппаПраво.ПодчиненныеЭлементы.Ответственный);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеНадписи; 
	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.Маршрут.ВИЛС_КонтактныеЛица";
	ДобавляемыйЭлемент.ГиперссылкаЯчейки 		= Истина;
	ДобавляемыйЭлемент.Видимость				= Истина;
	ДобавляемыйЭлемент.Заголовок				= "Контактные лица";
	//ДобавляемыйЭлемент.Ширина					= 8;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	//ДобавляемыйЭлемент.УстановитьДействие("Нажатие", "ВИЛС_Подключаемый_Нажатие_ВИЛС_КонтактныеЛица");
	
	ДобавляемыйЭлемент = Элементы.Вставить("Организация", Тип("ПолеФормы"), Элементы.ГруппаПраво, Элементы.Приоритет);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.Организация";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Организация";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_Руководитель", Тип("ПолеФормы"), Элементы.ГруппаПраво, Элементы.Ответственный);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_Руководитель";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Руководитель";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;	
	
			
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ГлавныйБухгалтер", Тип("ПолеФормы"), Элементы.ГруппаПраво, Элементы.Ответственный);
	ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 				= "Объект.ВИЛС_ГлавныйБухгалтер";
	ДобавляемыйЭлемент.КнопкаВыбора				= Истина;
	ДобавляемыйЭлемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ДобавляемыйЭлемент.КнопкаОткрытия			= Истина;
	ДобавляемыйЭлемент.КнопкаВыпадающегоСписка	= Ложь;
	ДобавляемыйЭлемент.Заголовок				= "Главный бухгалтер";
	ДобавляемыйЭлемент.МаксимальнаяШирина 		= 28;
	ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;	

	Элементы.Переместить(Элементы.Склад, Элементы.ГруппаЛево);
	Элементы.Переместить(Элементы.Ответственный, Элементы.ГруппаЛево);
	
	////////////////////ДобавляемыйЭлементГрСВ = Элементы.Вставить("Группа_ВИЛС_ТекстТТН", Тип("ГруппаФормы"), Элементы.ГруппаВремяФакт, Элементы.ДатаВремяРейсаФактС);	
	////////////////////ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	////////////////////ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	////////////////////ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	//////////////////////ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	////////////////////ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;//.ГоризонтальнаяЕслиВозможно;
	////////////////////
	////////////////////Элементы.Переместить(Элементы.ДатаВремяРейсаФактС, ДобавляемыйЭлементГрСВ);    
	////////////////////Элементы.ДатаВремяРейсаФактС.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	////ДобавляемыйЭлемент = Элементы.Вставить("ТекстДокументыНаОсновании", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ);
	////ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеНадписи; 
	////ДобавляемыйЭлемент.ПутьКДанным				= "ТекстДокументыНаОсновании";
	////ДобавляемыйЭлемент.Гиперссылка		 		= Истина;
	////ДобавляемыйЭлемент.Видимость				= Истина;
	////ДобавляемыйЭлемент.Заголовок				= " ";
	////ДобавляемыйЭлемент.АвтоМаксимальнаяШирина 	= Истина;
	////ДобавляемыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "ТекстДокументыНаОснованииОбработкаНавигационнойСсылки");
	////ДобавляемыйЭлемент.УстановитьДействие("Нажатие", "ТекстДокументыНаОснованииНажатие");
	//
	//ДобавляемыйЭлементГрСВ = Элементы.Вставить("ГруппаТранспортныеНакладные", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.ДополнительнаяИнформация);
	//ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	//ДобавляемыйЭлементГрСВ.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	//ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	////ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Авто;
	//ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;//.ГоризонтальнаяЕслиВозможно;
	//
	//ДобавляемыйЭлементГрСВ = Элементы.Вставить("ГруппаТранспортныеНакладныеСтраницы", Тип("ГруппаФормы"), ДобавляемыйЭлементГрСВ);
	//ДобавляемыйЭлементГрСВ.Вид 					= ВидГруппыФормы.Страницы;
	//ДобавляемыйЭлементГрСВ.ОтображениеСтраниц	= ОтображениеСтраницФормы.Нет;
	////ДобавляемыйЭлементГрСВ.ОтображатьЗаголовок  = Ложь;
	////ДобавляемыйЭлементГрСВ.СквозноеВыравнивание = СквозноеВыравнивание.Авто;
	////ДобавляемыйЭлементГрСВ.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	//
	//ДобавляемыйЭлементГрСВ1 = Элементы.Вставить("ГруппаНетТранспортныхНакладных", Тип("ГруппаФормы"), ДобавляемыйЭлементГрСВ);
	//ДобавляемыйЭлементГрСВ1.Вид 				= ВидГруппыФормы.Страница;
	////ДобавляемыйЭлементГрСВ1.Отображение			= ОтображениеСтраницФормы.Нет;
	//ДобавляемыйЭлементГрСВ1.ОтображатьЗаголовок = Ложь;
	//
	////Команды
	//НоваяКоманда = Команды.Добавить("СоздатьТранспортнуюНакладную");
	//НоваяКоманда.Заголовок 						= "Оформить ТТН";
	//НоваяКоманда.Действие 						= "СоздатьТранспортнуюНакладную";

	//НоваяКнопка = Элементы.Вставить("СоздатьТН", Тип("КнопкаФормы"), ДобавляемыйЭлементГрСВ1);
	//НоваяКнопка.Вид 							= ВидКнопкиФормы.Гиперссылка;
	//НоваяКнопка.Заголовок 						= "Оформить ТТН";
	//НоваяКнопка.ИмяКоманды 						= "СоздатьТранспортнуюНакладную";
	//НоваяКнопка.ГоризонтальноеПоложениеВГруппе	= ГоризонтальноеПоложениеЭлемента.Право;
	//
	//ДобавляемыйЭлементГрСВ1 = Элементы.Вставить("ГруппаОднаТранспортнаяНакладная", Тип("ГруппаФормы"), ДобавляемыйЭлементГрСВ);
	//ДобавляемыйЭлементГрСВ1.Вид 				= ВидГруппыФормы.Страница;
	////ДобавляемыйЭлементГрСВ1.Отображение			= ОтображениеСтраницФормы.Нет;
	//ДобавляемыйЭлементГрСВ1.ОтображатьЗаголовок = Ложь;
	//
	//ДобавляемыйЭлемент = Элементы.Вставить("ТранспортнаяНакладнаяТекст", Тип("ПолеФормы"), ДобавляемыйЭлементГрСВ1);
	//ДобавляемыйЭлемент.Вид 						= ВидПоляФормы.ПолеНадписи;
	//ДобавляемыйЭлемент.ПутьКДанным 				= "ТранспортнаяНакладнаяТекст";
	//ДобавляемыйЭлемент.Гиперссылка				= Истина;
	//ДобавляемыйЭлемент.УстановитьДействие("Нажатие", "ТранспортнаяНакладнаяТекстНажатие");
	//ДобавляемыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;

	//НоваяКнопка = Элементы.Вставить("СоздатьТНОднаНакладная", Тип("КнопкаФормы"), ДобавляемыйЭлементГрСВ1);
	//НоваяКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	//НоваяКнопка.Заголовок 						= "Оформить ТТН";
	//НоваяКнопка.ИмяКоманды 						= "СоздатьТранспортнуюНакладную";
	//НоваяКнопка.ГоризонтальноеПоложениеВГруппе	= ГоризонтальноеПоложениеЭлемента.Право;
	//
	//ДобавляемыйЭлементГрСВ1 = Элементы.Вставить("ГруппаНесколькоТранспортныхНакладных", Тип("ГруппаФормы"), ДобавляемыйЭлементГрСВ);
	//ДобавляемыйЭлементГрСВ1.Вид = ВидГруппыФормы.Страница;
	////ДобавляемыйЭлементГрСВ1.Отображение			= ОтображениеСтраницФормы.Нет;
	//ДобавляемыйЭлементГрСВ1.ОтображатьЗаголовок = Ложь;
	//
	////Команды
	//НоваяКоманда = Команды.Добавить("ОткрытьСписокТранспортныхНакладных");
	//НоваяКоманда.Заголовок 						= "ТТН";
	//НоваяКоманда.Действие 						= "ОткрытьСписокТранспортныхНакладных";

	//НоваяКнопка = Элементы.Вставить("ОткрытьСписокТН", Тип("КнопкаФормы"), ДобавляемыйЭлементГрСВ1);
	//НоваяКнопка.Вид 							= ВидКнопкиФормы.Гиперссылка;
	//НоваяКнопка.Заголовок 						= "ТТН";
	//НоваяКнопка.ИмяКоманды 						= "ОткрытьСписокТранспортныхНакладных";
	//НоваяКнопка.ГоризонтальноеПоложениеВГруппе	= ГоризонтальноеПоложениеЭлемента.Право;
	//
	//НоваяКнопка = Элементы.Вставить("СоздатьТННесколькоНакладных", Тип("КнопкаФормы"), ДобавляемыйЭлементГрСВ1);
	//НоваяКнопка.Вид 							= ВидКнопкиФормы.Гиперссылка;
	//НоваяКнопка.Заголовок 						= "Оформить ТТН";
	//НоваяКнопка.ИмяКоманды 						= "СоздатьТранспортнуюНакладную";
	//НоваяКнопка.ГоризонтальноеПоложениеВГруппе	= ГоризонтальноеПоложениеЭлемента.Право;
	//
	////ДобавляемыйЭлемент = Элементы.Вставить("Дер", Тип("ТаблицаФормы"));
	////ДобавляемыйЭлемент.Отображение = ОтображениеТаблицы.Дерево;
	////ЗначениеВРеквизитФормы(ПостроитьДеревоЭлементов(), "Дер");
	Для Каждого ЭлементКоманд Из Элементы.ФормаГлобальныеКоманды.ПодчиненныеЭлементы Цикл
		Если ЭлементКоманд.Имя = "ФормаДокументТранспортнаяНакладнаяОформитьТранспортныеНакладныеПоЗаданиямНаПеревозку" Тогда
			ЭлементКоманд.Видимость = Ложь;
			
			ИмяКоманды 		= "ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные";
			Команда = Команды.Добавить(ИмяКоманды);
		    Команда.Действие = "ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные";
		
			НоваяКнопка = Элементы.Вставить("ВИЛС_ФормаДокументТранспортнаяНакладнаяОформитьТранспортныеНакладныеПоЗаданиямНаПеревозку", Тип("КнопкаФормы"), Элементы.ФормаГлобальныеКоманды, Элементы.ФормаГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании);
			НоваяКнопка.Вид 			= ВидКнопкиФормы.КнопкаКоманднойПанели;
			НоваяКнопка.Заголовок 		= "Оформить ТТН";
			НоваяКнопка.ИмяКоманды 		= "ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные";
			НоваяКнопка.Отображение 	= ОтображениеКнопки.Картинка;
			НоваяКнопка.Картинка		= БиблиотекаКартинок.ТранспортнаяНакладная;
		Иначе	
			ЭлементКоманд.Видимость = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ВИЛС_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	Если Не Параметры.Ключ.Пустая() Тогда
		ВИЛС_ПереопределитьРеквизиты();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВИЛС_ОбработкаЗаполненияПоЗаказПоставщикуПродолжение(Объект, ДанныеЗаполнения, ДанныеОснований)
	Если ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу")
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки") Тогда
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
		Объект.Операция 		= Перечисления.ВидыДоставки.НаСклад;
		Объект.Перевозчик		= ДанныеЗаполнения.ПеревозчикПартнер;
		Адрес 					= ДанныеЗаполнения.АдресДоставкиПеревозчика;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиПеревозчикаЗначенияПолей;
	ИначеЕсли ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада") Тогда
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
		Объект.Операция 		= Перечисления.ВидыДоставки.НаСклад;
		Объект.Перевозчик		= ДанныеЗаполнения.Контрагент.Партнер;
		Адрес 					= ДанныеЗаполнения.АдресДоставки;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
	ИначеЕсли ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя") 
			или ДанныеЗаполнения.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба;
		Объект.Операция 		= Перечисления.ВидыДоставки.НаСклад;
		Объект.Контрагент 		= ДанныеЗаполнения.Контрагент;
		Адрес 					= ДанныеЗаполнения.АдресДоставки;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
	Иначе
		Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба;
		Объект.Операция 		= Перечисления.ВидыДоставки.СоСклада;   
		Объект.Контрагент 		= ДанныеЗаполнения.Контрагент;
		Адрес 					= ДанныеЗаполнения.АдресДоставки;
		АдресЗначенияПолей 		= ДанныеЗаполнения.АдресДоставкиЗначенияПолей;
	КонецЕсли;
	Зона 						= ДанныеЗаполнения.ЗонаДоставки;
	ВремяС 						= ДанныеЗаполнения.ВремяДоставкиС;
	ВремяПо 					= ДанныеЗаполнения.ВремяДоставкиПо;
	ДополнительнаяИнформация	= ДанныеЗаполнения.ДополнительнаяИнформацияПоДоставке;

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка)															КАК ЗаданиеНаПеревозку,
	|   ТоварыЗаказа.Ссылка 																						КАК Распоряжение,
	|   ТоварыЗаказа.Ссылка.Склад																					КАК Склад,
	|   ТоварыЗаказа.Номенклатура																					КАК Номенклатура,
	|   ТоварыЗаказа.Характеристика																					КАК Характеристика,
	|   ТоварыЗаказа.Назначение																						КАК Назначение,
	|   СУММА(ТоварыЗаказа.Количество)																				КАК Количество,
	|	ИСТИНА 																										КАК ВсеТовары,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыЗаказа.Ссылка.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА ТоварыЗаказа.Ссылка.Контрагент.Партнер
	|		ИНАЧЕ ТоварыЗаказа.Ссылка.Партнер
	|	КОНЕЦ 																										КАК ПолучательОтправитель,
	|   ТоварыЗаказа.Ссылка.КонтактноеЛицо 																			КАК ВИЛС_КонтактноеЛицо,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения.Код = ""166 ""
	//|				ТОГДА ТоварыЗаказа.Количество
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) 																									КАК КоличествоКГ,
	|	СУММА(&ТекстЗапросаВесНоменклатуры * ТоварыЗаказа.Количество)												КАК Вес,
	|	СУММА(&ТекстЗапросаОбъемНоменклатуры * ТоварыЗаказа.Количество)												КАК Объем
	|ПОМЕСТИТЬ ТоварыЗаказа
	|ИЗ Документ.ЗаказПоставщику.Товары КАК ТоварыЗаказа
	|	
	|ГДЕ ТоварыЗаказа.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.Ссылка,
	|	ТоварыЗаказа.Ссылка.Склад,
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыЗаказа.Ссылка.ПеревозчикПартнер, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА ТоварыЗаказа.Ссылка.Партнер
	|		ИНАЧЕ ТоварыЗаказа.Ссылка.ПеревозчикПартнер
	|	КОНЕЦ,
	|   ТоварыЗаказа.Ссылка.КонтактноеЛицо
	|
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаданиеНаПеревозку,
	|	Распоряжение,
	|	Склад,
	|	Номенклатура,
	|	Характеристика,
	|	Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыЗаказа.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение КАК Распоряжение,
	|	ТоварыЗаказа.Склад КАК Склад,
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Назначение КАК Назначение,
	|	СУММА(ТоварыКДоставке.Количество) КАК Количество,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения.Код = ""166 ""
	//|				ТОГДА ТоварыКДоставке.Количество
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК КоличествоКГ,
	|	СУММА(ТоварыКДоставке.Вес) КАК Вес,
	|	СУММА(ТоварыКДоставке.Объем) КАК Объем
	|ПОМЕСТИТЬ ТоварыКДоставке
	|ИЗ
	|	ТоварыЗаказа КАК ТоварыЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО (ТоварыЗаказа.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыЗаказа.Склад = ТоварыКДоставке.Склад
	|				И ТоварыЗаказа.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыЗаказа.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыЗаказа.Назначение = ТоварыКДоставке.Назначение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение,
	|	ТоварыЗаказа.Склад,
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Назначение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаданиеНаПеревозку,
	|	Распоряжение,
	|	Склад,
	|	Номенклатура,
	|	Характеристика,
	|	Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыЗаказа.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение КАК Распоряжение,
	|	ТоварыЗаказа.Склад КАК Склад,
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Назначение КАК Назначение,
	|	СУММА(ТоварыЗаказа.Количество) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) КАК Количество,
	|	ВЫБОР
	|		КОГДА Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Склады.ДатаНачалаОрдернойСхемыПриОтгрузке < &ДатаДокумента
	|				И СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) > 0
	|			ТОГДА ЛОЖЬ
	|       КОГДА СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) > 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ КАК ВсеТовары,
	|	ТоварыЗаказа.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТоварыЗаказа.ВИЛС_КонтактноеЛицо КАК ВИЛС_КонтактноеЛицо,
	//|	СУММА(ТоварыЗаказа.КоличествоКГ) - СУММА(ЕСТЬNULL(ТоварыКДоставке.КоличествоКГ, 0)) КАК КоличествоКГ,
	//|	ВЫБОР
	//|		КОГДА СУММА(ТоварыЗаказа.Вес) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Вес, 0)) = 0
	//|			ТОГДА СУММА(ТоварыЗаказа.КоличествоКГ) - СУММА(ЕСТЬNULL(ТоварыКДоставке.КоличествоКГ, 0))
	//|		ИНАЧЕ СУММА(ТоварыЗаказа.Вес) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Вес, 0))
	//|	КОНЕЦ КАК Вес,
	|	СУММА(ТоварыЗаказа.Вес) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Вес, 0)) КАК Вес,
	|	СУММА(ТоварыЗаказа.Объем) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Объем, 0)) КАК Объем
	|ИЗ
	|	ТоварыЗаказа КАК ТоварыЗаказа
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|	ПО ТоварыЗаказа.Склад = Склады.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО (ТоварыЗаказа.ЗаданиеНаПеревозку = ТоварыКДоставке.ЗаданиеНаПеревозку
	|				И ТоварыЗаказа.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыЗаказа.Склад = ТоварыКДоставке.Склад
	|				И ТоварыЗаказа.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыЗаказа.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыЗаказа.Назначение = ТоварыКДоставке.Назначение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.ЗаданиеНаПеревозку,
	|	ТоварыЗаказа.Распоряжение,
	|	ТоварыЗаказа.Склад,
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Назначение,
	|	ТоварыЗаказа.ВсеТовары,
	|	ТоварыЗаказа.ПолучательОтправитель,
	|	ТоварыЗаказа.ВИЛС_КонтактноеЛицо,
	|	Склады.ИспользоватьОрдернуюСхемуПриОтгрузке,
	|	Склады.ДатаНачалаОрдернойСхемыПриОтгрузке
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыЗаказа.Количество) - СУММА(ЕСТЬNULL(ТоварыКДоставке.Количество, 0)) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Распоряжение,
	|	Склад,
	|	Номенклатура,
	|	Характеристика,
	|	Назначение,
	|	ПолучательОтправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКДоставке
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
		"ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения",
		"ТоварыЗаказа.Номенклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаОбъемНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
		"ТоварыЗаказа.Номенклатура.ЕдиницаИзмерения",
		"ТоварыЗаказа.Номенклатура"));
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Заказ"			, ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ДатаДокумента"	, Объект.Дата);
	ТаблицаТоварыКДоставке = Запрос.Выполнить().Выгрузить();
	
	НоваяСтрокаР = Объект.Распоряжения.Добавить();
	НоваяСтрокаР.КлючСвязи 					= Строка(Новый УникальныйИдентификатор);
	НоваяСтрокаР.Распоряжение 				= ДанныеЗаполнения;
	НоваяСтрокаР.Вес 						= ТаблицаТоварыКДоставке.Итог("Вес");
	НоваяСтрокаР.Объем 						= ТаблицаТоварыКДоставке.Итог("Объем");
	НоваяСтрокаР.Перевозчик 				= ДанныеЗаполнения.ПеревозчикПартнер;
	НоваяСтрокаР.ПолучательОтправитель 		= ДанныеЗаполнения.Партнер;
	НоваяСтрокаР.ВИЛС_КонтактноеЛицо		= ДанныеЗаполнения.КонтактноеЛицо;
	НоваяСтрокаР.ВремяС						= ДанныеЗаполнения.ВремяДоставкиС;
	НоваяСтрокаР.ВремяПо					= ДанныеЗаполнения.ВремяДоставкиПо;
	НоваяСтрокаР.ДополнительнаяИнформация 	= ДанныеЗаполнения.ДополнительнаяИнформация;
	Если ДанныеОснований.Склады.Количество() > 0 Тогда
		НоваяСтрокаР.Склад = ДанныеОснований.Склады[0];
	Иначе
		НоваяСтрокаР.Склад = Справочники.Склады.СкладПоУмолчанию();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Склад = НоваяСтрокаР.Склад;
	КонецЕсли;	
	НоваяСтрокаР.ДоставляетсяПолностью 		= ПолучитьМинимум(ТаблицаТоварыКДоставке);//?(ТаблицаТоварыКДоставке.Количество(), ТаблицаТоварыКДоставке[0].ВсеТовары, Ложь);
	
	НоваяСтрокаМ = Объект.Маршрут.Добавить();
	НоваяСтрокаМ.Адрес						= Адрес;
	НоваяСтрокаМ.Зона						= Зона;
	НоваяСтрокаМ.ВремяС						= ВремяС;
	НоваяСтрокаМ.ВремяПо					= ВремяПо;     
	НоваяСтрокаМ.Вес 						= НоваяСтрокаР.Вес;
	НоваяСтрокаМ.Объем 						= НоваяСтрокаР.Объем;
	НоваяСтрокаМ.КлючСвязи 					= НоваяСтрокаР.КлючСвязи;
	НоваяСтрокаМ.ДополнительнаяИнформация 	= ДополнительнаяИнформация;
	НоваяСтрокаМ.АдресЗначенияПолей 		= АдресЗначенияПолей;
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(Строка(НоваяСтрокаР.ПолучательОтправитель));
	МассивСтрок.Добавить(Строка(НоваяСтрокаР.Склад));
	НоваяСтрокаМ.ПолучателиОтправители 		= СтрСоединить(МассивСтрок, ", ");
	
	Возврат(ТаблицаТоварыКДоставке);
КонецФункции	

&НаСервере
Функция ПолучитьМинимум(ТаблицаТоварыКДоставке)
	Перем МинимумВсеТовары;
	МинимумВсеТовары = Истина;
	Для Каждого СтрокаТЗ Из ТаблицаТоварыКДоставке Цикл
		МинимумВсеТовары = МинимумВсеТовары и СтрокаТЗ.ВсеТовары;
	КонецЦикла;	
	Возврат(МинимумВсеТовары);
КонецФункции

&НаСервере
&Вместо("НастроитьПоТипуИсполнителя")
Процедура ВИЛС_НастроитьПоТипуИсполнителя()
	
	ВыполняетПеревозчик = Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
	
	Элементы.Перевозчик.Видимость       		= ВыполняетПеревозчик;
	//Элементы.Водитель.Видимость         		= Не ВыполняетПеревозчик;     // fix Suetin 02.08.2019 17:05:35
	Элементы.ВИЛС_КурьерЭкспедитор.Видимость 	= Не ВыполняетПеревозчик;
	Элементы.РеквизитыТТН.Видимость     		= //ВыполняетПеревозчик         // begin fix Suetin 02.08.2019 17:05:45
													//И Объект.Операция = Перечисления.ВидыДоставки.СоСклада
													//И                         // end fix Suetin 02.08.2019 17:05:49
													ПолучитьФункциональнуюОпцию("ИспользоватьТТН");
	Элементы.ВИЛС_ДоговорПеревозчика.Видимость 	= ВыполняетПеревозчик;   // fix Suetin 03.09.2019 10:52:01
	
	Если ВыполняетПеревозчик
		И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ЗаполнитьКонтрагентаИБанковскийСчетПеревозчика();
		КонецЕсли;
		
	Иначе
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		
		Перевозчик = Объект.Перевозчик;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ВодительПриИзменении()
	ВИЛС_ВодительПриИзмененииНаСервере();
КонецПроцедуры	

&НаСервере
Процедура ВИЛС_ВодительПриИзмененииНаСервере()
	
	ПараметрыТТН = Новый Структура;
	ПараметрыТТН.Вставить("ВодительФИО");
	ПараметрыТТН.Вставить("УдостоверениеСерия");
	ПараметрыТТН.Вставить("УдостоверениеНомер");
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Наименование КАК ВодительФИО,
		|	ДокументыФизическихЛиц.Серия КАК УдостоверениеСерия,
		|	ДокументыФизическихЛиц.Номер КАК УдостоверениеНомер
		|ИЗ
		|	Справочник.Контрагенты КАК ФизическиеЛица           // fix Suetin 02.08.2019 17:09:20   ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
		|		ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛиц.Физлицо
		|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.ВИЛС_Водитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыТТН, Выборка);
		КонецЕсли;			
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыТТН);

КонецПроцедуры

&НаКлиенте
&Вместо("РеквизитыТТН")
Процедура ВИЛС_РеквизитыТТН(Команда)
	
	ПараметрыТТН = Новый Структура;
	ПараметрыТТН.Вставить("ЗаданиеНаПеревозку");
	ПараметрыТТН.Вставить("ТранспортноеСредство");
	ПараметрыТТН.Вставить("БанковскийСчетПеревозчика");
	ПараметрыТТН.Вставить("ВодительФИО");
	ПараметрыТТН.Вставить("УдостоверениеСерия");
	ПараметрыТТН.Вставить("УдостоверениеНомер");
	ПараметрыТТН.Вставить("АвтомобильГосударственныйНомер");
	ПараметрыТТН.Вставить("АвтомобильМарка");
	ПараметрыТТН.Вставить("ВидПеревозки");
	ПараметрыТТН.Вставить("АвтомобильТип");
	ПараметрыТТН.Вставить("АвтомобильВместимостьВКубическихМетрах");
	ПараметрыТТН.Вставить("АвтомобильГрузоподъемностьВТоннах");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаСерия");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаНомер");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаВид");
	ПараметрыТТН.Вставить("ЛицензионнаяКарточкаРегистрационныйНомер");
	ПараметрыТТН.Вставить("Прицеп");
	ПараметрыТТН.Вставить("ГосударственныйНомерПрицепа");
	ПараметрыТТН.Вставить("Партнер");                // fix Suetin 13.08.2019 18:56:52
	ЗаполнитьЗначенияСвойств(ПараметрыТТН, Объект);
	
	Если Объект.ЗаданиеВыполняет = ПредопределенноеЗначение("Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик") Тогда
		
		ПараметрыТТН.Вставить("Партнер",    Объект.Перевозчик);
		ПараметрыТТН.Вставить("Перевозчик", Объект.Контрагент);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РеквизитыТТНЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаданиеНаПеревозку.Форма.РеквизитыТТН", ПараметрыТТН, ЭтаФорма, , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
&Вместо("ПослеРедактированияРаспоряженийСервер")
Процедура ВИЛС_ПослеРедактированияРаспоряженийСервер(Результат)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.Вес,       // begin fix Suetin 23.08.2019 11:27:27
	|	ТоварыКДоставке.Объем,     // end fix Suetin 23.08.2019 11:27:31
	|	ТоварыКДоставке.ВсеТовары
	|ПОМЕСТИТЬ ТоварыКДоставке
	|ИЗ
	|	&ТоварыКДоставке КАК ТоварыКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.Вес,       // begin fix Suetin 23.08.2019 11:27:27
	|	ТоварыКДоставке.Объем,     // end fix Suetin 23.08.2019 11:27:31
	|	ТоварыКДоставке.ВсеТовары
	|ПОМЕСТИТЬ ТоварыКДоставкеОтредактированные
	|ИЗ
	|	&ТоварыКДоставкеОтредактированные КАК ТоварыКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Вес,
	|	Распоряжения.Объем,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,  
	|	Распоряжения.ВИЛС_КонтактноеЛицо,
	|	Распоряжения.ВремяС,
	|	Распоряжения.ВремяПо,
	|	Распоряжения.ДополнительнаяИнформация,
	|	Распоряжения.Доставлено,
	|	Распоряжения.Склад,
	|	Распоряжения.ДоставляетсяПолностью
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	&Распоряжения КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Вес,
	|	Распоряжения.Объем,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.ВремяС,
	|	Распоряжения.ВремяПо,
	|	Распоряжения.ДополнительнаяИнформация,
	|	Распоряжения.Доставлено,
	|	Распоряжения.Склад,
	|	Распоряжения.ДоставляетсяПолностью
	|ПОМЕСТИТЬ РаспоряженияОтредактированные
	|ИЗ
	|	&РаспоряженияОтредактированные КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияОтредактированные.КлючСвязи,
	|	РаспоряженияОтредактированные.Распоряжение,
	|	РаспоряженияОтредактированные.Перевозчик,
	|	РаспоряженияОтредактированные.ПолучательОтправитель,
	|	РаспоряженияОтредактированные.Распоряжение.КонтактноеЛицо КАК ВИЛС_КонтактноеЛицо,         // fix Suetin 30.08.2019 15:01:08
	|	РаспоряженияОтредактированные.ВремяС,
	|	РаспоряженияОтредактированные.ВремяПо,
	|	РаспоряженияОтредактированные.ДополнительнаяИнформация,
	|	РаспоряженияОтредактированные.Склад,
	|	РаспоряженияОтредактированные.Вес КАК Вес,
	|	РаспоряженияОтредактированные.Объем КАК Объем,
	|	РаспоряженияОтредактированные.Доставлено КАК Доставлено,
	|	РаспоряженияОтредактированные.ДоставляетсяПолностью КАК ДоставляетсяПолностью
	|ПОМЕСТИТЬ РаспоряженияРезультат
	|ИЗ
	|	РаспоряженияОтредактированные КАК РаспоряженияОтредактированные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.ВИЛС_КонтактноеЛицо,         														// fix Suetin 30.08.2019 15:01:35
	|	Распоряжения.ВремяС,
	|	Распоряжения.ВремяПо,
	|	Распоряжения.ДополнительнаяИнформация,
	|	Распоряжения.Склад,
	|	Распоряжения.Вес,
	|	Распоряжения.Объем,
	|	Распоряжения.Доставлено,
	|	Распоряжения.ДоставляетсяПолностью
	|ИЗ
	|	Распоряжения КАК Распоряжения
	|ГДЕ
	|	Распоряжения.КлючСвязи <> &КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УдаленныеРаспоряжения.Распоряжение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Распоряжения.Распоряжение КАК Распоряжение,
	|		1 КАК ПолеСворачивания
	|	ИЗ
	|		Распоряжения КАК Распоряжения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РаспоряженияРезультат.Распоряжение,
	|		-1
	|	ИЗ
	|		РаспоряженияРезультат КАК РаспоряженияРезультат) КАК УдаленныеРаспоряжения
	|
	|СГРУППИРОВАТЬ ПО
	|	УдаленныеРаспоряжения.Распоряжение
	|
	|ИМЕЮЩИЕ
	|	СУММА(УдаленныеРаспоряжения.ПолеСворачивания) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияРезультат.КлючСвязи,
	|	РаспоряженияРезультат.Распоряжение,
	|	РаспоряженияРезультат.Перевозчик,
	|	РаспоряженияРезультат.ПолучательОтправитель,
	|	РаспоряженияРезультат.ВИЛС_КонтактноеЛицо,    // fix Suetin 30.08.2019 15:00:16
	|	РаспоряженияРезультат.ВремяС,
	|	РаспоряженияРезультат.ВремяПо,
	|	РаспоряженияРезультат.ДополнительнаяИнформация,
	|	РаспоряженияРезультат.Склад,
	|	РаспоряженияРезультат.Вес,
	|	РаспоряженияРезультат.Объем,
	|	РаспоряженияРезультат.Доставлено,
	|	РаспоряженияРезультат.ДоставляетсяПолностью
	|ИЗ
	|	РаспоряженияРезультат КАК РаспоряженияРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РаспоряженияОтредактированные.Вес) КАК Вес,
	|	СУММА(РаспоряженияОтредактированные.Объем) КАК Объем,
	|	МИНИМУМ(РаспоряженияОтредактированные.Доставлено) КАК Доставлено,
	|	КОЛИЧЕСТВО(*) КАК КоличествоРаспоряжений
	|ИЗ
	|	РаспоряженияОтредактированные КАК РаспоряженияОтредактированные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.Вес,      					// begin fix Suetin 23.08.2019 11:28:00
	|	ТоварыКДоставке.Объем,    					// end fix Suetin 23.08.2019 11:28:04
	|	ТоварыКДоставке.ВсеТовары
	|ИЗ
	|	ТоварыКДоставке КАК ТоварыКДоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распоряжения КАК Распоряжения
	|		ПО (Распоряжения.Распоряжение = ТоварыКДоставке.Распоряжение)
	|			И (Распоряжения.Склад = ТоварыКДоставке.Склад)
	|ГДЕ
	|	Распоряжения.КлючСвязи <> &КлючСвязи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКДоставкеОтредактированные.Распоряжение,
	|	ТоварыКДоставкеОтредактированные.Склад,
	|	ТоварыКДоставкеОтредактированные.ПолучательОтправитель,
	|	ТоварыКДоставкеОтредактированные.Номенклатура,
	|	ТоварыКДоставкеОтредактированные.Характеристика,
	|	ТоварыКДоставкеОтредактированные.Назначение,
	|	ТоварыКДоставкеОтредактированные.Серия,
	|	ТоварыКДоставкеОтредактированные.Количество,
	|	ТоварыКДоставкеОтредактированные.Вес,      	// begin fix Suetin 23.08.2019 11:28:00
	|	ТоварыКДоставкеОтредактированные.Объем,    	// end fix Suetin 23.08.2019 11:28:04
	|	ТоварыКДоставкеОтредактированные.ВсеТовары
	|ИЗ
	|	ТоварыКДоставкеОтредактированные КАК ТоварыКДоставкеОтредактированные";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	СтрокаПункт = Объект.Маршрут.НайтиПоИдентификатору(Элементы.Маршрут.ТекущаяСтрока);
	
	Запрос.УстановитьПараметр("РаспоряженияОтредактированные", ПолучитьИзВременногоХранилища(Результат.АдресРаспоряжений));
	Запрос.УстановитьПараметр("ТоварыКДоставкеОтредактированные", ПолучитьИзВременногоХранилища(Результат.АдресТоваровКДоставке));
	Запрос.УстановитьПараметр("ТоварыКДоставке", ТоварыКДоставке.Выгрузить());
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());
	Запрос.УстановитьПараметр("КлючСвязи", СтрокаПункт.КлючСвязи);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВГраница = РезультатЗапроса.ВГраница();
	
	Выборка = РезультатЗапроса[ВГраница-1].Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоРаспоряжений = 0 Тогда
		Объект.Маршрут.Удалить(СтрокаПункт);
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокаПункт,Выборка);
	КонецЕсли;
	
	Объект.Распоряжения.Загрузить(РезультатЗапроса[ВГраница-2].Выгрузить());
	
	УдаленныеРаспоряжения = РезультатЗапроса[ВГраница-3].Выгрузить().ВыгрузитьКолонку("Распоряжение");
	Если УдаленныеРаспоряжения.Количество() > 0 Тогда
		Документы.ТранспортнаяНакладная.АктуализироватьТранспортныеНакладныеИзЗаданияНаПеревозку(
			УдаленныеРаспоряжения, Объект.Ссылка, СтрокаПункт.НомерСтроки);
	КонецЕсли;
	
	ТоварыКДоставке.Загрузить(РезультатЗапроса[ВГраница].Выгрузить());
	ДоставкаТоваров.ЗаполнитьПризнакДоставляетсяПолностью(ТоварыКДоставке.Выгрузить(), Объект.Распоряжения);
	
	ЗаполнитьСлужебныеРеквизитыМаршрута();
	ОбновитьИтоговыйВесОбъемЗаполненность(ЭтаФорма);
	ОбновитьСкладыПогрузки();
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьСлужебныеРеквизитыМаршрута")
Процедура ВИЛС_ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки)
	
	Результат = Неопределено;
	РассчитатьНаличиеТТН = ПолучитьФункциональнуюОпцию("ИспользоватьТТН") 
		И ПравоДоступа("Чтение", Метаданные.Документы.ТранспортнаяНакладная);
		
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.ВИЛС_КонтактноеЛицо,               	// end fix Suetin 30.08.2019 16:09:43
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.НомерСтроки
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	&Распоряжения КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Маршрут.НомерСтроки,
	|	Маршрут.КлючСвязи
	|ПОМЕСТИТЬ Маршрут
	|ИЗ
	|	&Маршрут КАК Маршрут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,      
	|	Распоряжения.ВИЛС_КонтактноеЛицо,                 																			// begin fix Suetin 26.09.2019 11:56:11
	|   КонтактныеЛицаТелефон.Представление КАК Телефон,
	|   КонтактныеЛицаМобильныйТелефон.Представление КАК МобильныйТелефон,   														// end fix Suetin 26.09.2019 11:57:07
	|	Маршрут.НомерСтроки КАК НомерСтрокиМаршрута,
	|	Распоряжения.НомерСтроки КАК НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ РаспоряженияПоМаршрутам
	|ИЗ
	|	Маршрут КАК Маршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распоряжения КАК Распоряжения
	|		ПО Маршрут.КлючСвязи = Распоряжения.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаТелефон      				// begin fix Suetin 26.09.2019 11:55:54
	|		ПО (Распоряжения.ВИЛС_КонтактноеЛицо = КонтактныеЛицаТелефон.Ссылка)
	|			И (КонтактныеЛицаТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактныеЛицаТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаМобильныйТелефон
	|		ПО (Распоряжения.ВИЛС_КонтактноеЛицо = КонтактныеЛицаМобильныйТелефон.Ссылка)
	|			И (КонтактныеЛицаМобильныйТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактныеЛицаМобильныйТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица))    // end fix Suetin 26.09.2019 11:56:03
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка КАК Накладная,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ НакладныеПоЗаданиямНаПеревозку
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказНаПеремещение
	|			И Распоряжения.Склад = ДокументТовары.Ссылка.СкладОтправитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//++ НЕ УТКА
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДавальцу.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказДавальца
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТКА
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказПереработчику
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|ГДЕ
	|	(Распоряжения.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
	//++ НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаСырьяПереработчику
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаТоваровХранителю
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ВозвратТоваровПоставщику)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений КАК НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.НомерСтрокиМаршрута) КАК НомерСтрокиМаршрута,
	|	МАКСИМУМ(НЕ ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка ЕСТЬ NULL ) КАК ТранспортнаяНакладнаяОформлена,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик) КАК Перевозчик,      
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ВИЛС_КонтактноеЛицо) КАК ВИЛС_КонтактноеЛицо,                 	// begin fix Suetin 26.09.2019 11:57:48
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Телефон) КАК Телефон,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.МобильныйТелефон) КАК МобильныйТелефон,                 		// end fix Suetin 26.09.2019 11:57:48
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель) КАК ПолучательОтправитель
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК РаспоряженияПоМаршрутам
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
	|		ПО РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений = НакладныеПоЗаданиямНаПеревозку.НомерСтрокиРаспоряжений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснованияОснования
	|		ПО (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.АдресДоставки = НакладныеПоЗаданиямНаПеревозку.Адрес)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование = НакладныеПоЗаданиямНаПеревозку.Накладная)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиМаршрута,
	|	НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик),
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель)";
	
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());
	Если ОбновляемыеСтроки = Неопределено Тогда
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить(ОбновляемыеСтроки));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",	Объект.Ссылка);
		
	Результат = Запрос.Выполнить().Выбрать();
	ШаблонСПеревозчиком = НСтр("ru = '%Перевозчик% (для %ПолучателиОтправители%)';
								|en = '%Перевозчик% (for %ПолучателиОтправители%)'");
	Пока Результат.СледующийПоЗначениюПоля("НомерСтрокиМаршрута") Цикл
		
		СтрокаМаршрута = Объект.Маршрут[Результат.НомерСтрокиМаршрута - 1];
		ПолучателиОтправителиПоПункту = "";
		КонтактныеЛицаПоПункту = "";        																				// fix Suetin 30.08.2019 16:37:58
		ТранспортнаяНакладнаяОформлена = Ложь;
		КоличествоРаспоряжений = 0;
		
		Пока Результат.СледующийПоЗначениюПоля("Перевозчик") Цикл
			
			ПолучателиОтправителиПоПеревозчику = "";	
			КонтактныеЛицаПоПеревозчику = "";      																			// fix Suetin 30.08.2019 15:59:18
			Пока Результат.СледующийПоЗначениюПоля("ПолучательОтправитель") Цикл
				
				Пока Результат.Следующий() Цикл
					КоличествоРаспоряжений = КоличествоРаспоряжений + 1;
					ТранспортнаяНакладнаяОформлена = Макс(ТранспортнаяНакладнаяОформлена, Результат.ТранспортнаяНакладнаяОформлена);
				КонецЦикла;
				
				ПолучателиОтправителиПоПеревозчику = ПолучателиОтправителиПоПеревозчику + Результат.ПолучательОтправитель + "," + " ";
				КонтактныеЛицаПоПеревозчику = КонтактныеЛицаПоПеревозчику + Результат.ВИЛС_КонтактноеЛицо + ", "                // begin fix Suetin 26.09.2019 12:14:42
					+ ?(ЗначениеЗаполнено(Результат.Телефон), "(т." + Результат.Телефон + "), ", "")
					+ ?(ЗначениеЗаполнено(Результат.МобильныйТелефон), "(т.моб." + Результат.МобильныйТелефон + "), ", "");    	// end fix Suetin 26.09.2019 12:14:49
			КонецЦикла;
			ПолучателиОтправителиПоПеревозчику = Лев(ПолучателиОтправителиПоПеревозчику, СтрДлина(ПолучателиОтправителиПоПеревозчику)-2);   
			КонтактныеЛицаПоПеревозчику = Лев(КонтактныеЛицаПоПеревозчику, СтрДлина(КонтактныеЛицаПоПеревозчику)-2);   		// fix Suetin 30.08.2019 16:37:08
			Если ЗначениеЗаполнено(Результат.Перевозчик) Тогда
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ШаблонСПеревозчиком, "%ПолучателиОтправители%", ПолучателиОтправителиПоПеревозчику);
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ПолучателиОтправителиПоПеревозчику, "%Перевозчик%", Результат.Перевозчик);
			КонецЕсли;
			ПолучателиОтправителиПоПункту = ПолучателиОтправителиПоПункту + ПолучателиОтправителиПоПеревозчику + "," + " ";   
			КонтактныеЛицаПоПункту = КонтактныеЛицаПоПункту + КонтактныеЛицаПоПеревозчику + "," + " ";           			// fix Suetin 30.08.2019 16:36:47
		КонецЦикла;
		
		СтрокаМаршрута.ПолучателиОтправители = ПолучателиОтправителиПоПункту
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоРаспоряжений, НСтр("ru = 'распоряжение, распоряжения, распоряжений';
																												|en = 'reference, reference, references'"))
			+ НСтр("ru = '...';
					|en = '...'");
																															// begin fix Suetin 30.08.2019 16:36:53	
		СтрокаМаршрута.ВИЛС_КонтактныеЛица = КонтактныеЛицаПоПункту
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоРаспоряжений, НСтр("ru = 'распоряжение, распоряжения, распоряжений';
																												|en = 'reference, reference, references'"))
			+ НСтр("ru = '...';
					|en = '...'");
																															// fix Suetin 30.08.2019 16:36:58
		Если РассчитатьНаличиеТТН Тогда
			СтрокаМаршрута.ТранспортнаяНакладнаяОформлена = ТранспортнаяНакладнаяОформлена;
		КонецЕсли;
		
		СтрокаМаршрута.ВремяСБезДаты   = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяС);
		СтрокаМаршрута.ВремяПоБезДаты  = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяПо);
		
	КонецЦикла;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВИЛС_Подключаемый_Нажатие_ВИЛС_КонтактныеЛица() Экспорт
//	а = 0;	
//КонецПроцедуры	

&НаКлиенте
Процедура ВИЛС_МаршрутВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Поле.Имя = "ВИЛС_КонтактныеЛица" Тогда
		СтандартнаяОбработка = Ложь; 
		ПараметрыОтбора = Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи);
		МассивСтрокРаспоряжений = Объект.Распоряжения.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрокРаспоряжений.Количество() Тогда
			ТекущаяСтрокаРаспоряжений = МассивСтрокРаспоряжений[0];
			Если ТипЗнч(ТекущаяСтрокаРаспоряжений.ПолучательОтправитель) = Тип("СправочникСсылка.Партнеры") Тогда 
				ПараметрОтбор = Новый Структура;
				ПараметрОтбор.Вставить("Владелец", ТекущаяСтрокаРаспоряжений.ПолучательОтправитель);
				ПараметрыФормы = Новый Структура("Отбор", ПараметрОтбор);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактирования_ВИЛС_КонтактныеЛица",ЭтотОбъект, ПараметрыОтбора);
				ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", 
					ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеРедактирования_ВИЛС_КонтактныеЛица(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	//ПослеРедактированияРаспоряженийСервер(Результат);
	ПараметрыОтбора = Новый Структура("КлючСвязи", ДополнительныеПараметры.КлючСвязи);
	МассивСтрокРаспоряжений = Объект.Распоряжения.НайтиСтроки(ПараметрыОтбора);       
	Если МассивСтрокРаспоряжений.Количество() Тогда
		МассивСтрокРаспоряжений[0].ВИЛС_КонтактноеЛицо = Результат;
	КонецЕсли;	
	ПослеРедактирования_ВИЛС_КонтактныеЛицаНаСервере(ПараметрыОтбора);
КонецПроцедуры

&НаСервере
Процедура ПослеРедактирования_ВИЛС_КонтактныеЛицаНаСервере(Знач ПараметрыОтбора)
	ОбновляемыеСтроки = Объект.Маршрут.НайтиСтроки(ПараметрыОтбора);       
	Если ОбновляемыеСтроки.Количество() Тогда
		ВИЛС_ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки)	
	КонецЕсли;	
КонецПроцедуры	

//&НаКлиенте               
//Процедура ТекстДокументыНаОснованииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
//	
//	ОчиститьСообщения();
//	
//	ПродажиКлиент.ОбработкаНавигационнойСсылкиТранспортныеНакладные(ЭтаФорма, НавигационнаяСсылка, СтандартнаяОбработка);
//	
//	//ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка);

//КонецПроцедуры

//&НаКлиенте               
//Процедура ТекстДокументыНаОснованииНажатие(Элемент, СтандартнаяОбработка) Экспорт
//	
//	ОчиститьСообщения();
//	НавигационнаяСсылка = "";
//	ПродажиКлиент.ОбработкаНавигационнойСсылкиТранспортныеНакладные(ЭтаФорма, НавигационнаяСсылка, СтандартнаяОбработка);
//	
//	//ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаСервере
//&После("ПриЧтенииСозданииНаСервере")
//Процедура ВИЛС_ПриЧтенииСозданииНаСервере()
//	//ПродажиСервер.ПолучитьОбновитьИнформациюТранспортныхНакладных(ЭтаФорма);
//	ПолучитьОбновитьИнформациюТранспортныхНакладных();
//КонецПроцедуры

//&НаСервере
//Функция ОбработкаВыбораТранспортнойНакладной(ВыбраннаяТранспортнаяНакладная)
//	
//	Если ЗначениеЗаполнено(ВыбраннаяТранспортнаяНакладная) Тогда
//		
//		ТранспортнаяНакладнаяОбъект = ВыбраннаяТранспортнаяНакладная.ПолучитьОбъект();
//		НоваяСтрока = ТранспортнаяНакладнаяОбъект.ДокументыОснования.Добавить();
//		НоваяСтрока.ДокументОснование = Объект.Ссылка;
//		Попытка
//			ТранспортнаяНакладнаяОбъект.Записать();
//		Исключение
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
//		КонецПопытки; 		
//		
//	КонецЕсли;
//	
//	ДанныеТранспортныхНакладных = ПолучитьИнформациюТранспортныхНакладных();
//	
//	Возврат ДанныеТранспортныхНакладных;
//	
//КонецФункции

//&НаКлиенте
//Процедура ВИЛС_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
//	Если ИсточникВыбора.ИмяФормы = "Документ.ТранспортнаяНакладная.Форма.ФормаВыбора" Тогда
//		
//		ДанныеТранспортныхНакладных = ОбработкаВыбораТранспортнойНакладной(ВыбранноеЗначение);
//		ОбновитьИнформациюТранспортныхНакладных(ДанныеТранспортныхНакладных, ЭтаФорма);
//		
//	КонецЕсли;
//КонецПроцедуры

//////////////////////////////////////////////

//&НаКлиенте
//Процедура СоздатьТранспортнуюНакладную(Команда)
//	
//	ОчиститьСообщения();
//	
//	ПроверитьВозможностьСозданияТранспортнойНакладной();

//КонецПроцедуры

//&НаКлиенте
//Процедура ПроверитьВозможностьСозданияТранспортнойНакладной()
//	
//	МожноСоздатьТТН = Истина;
//			
//	Если МожноСоздатьТТН
//		И (НЕ ЗначениеЗаполнено(Объект.Ссылка)
//			ИЛИ НЕ Объект.Проведен
//			ИЛИ Модифицированность) Тогда
//		
//		ТекстВопроса = НСтр("ru = 'Ввод транспортных накладных возможен только после проведения документа.';
//							|en = 'You can enter consignment notes only after posting a document.'");
//		СписокКнопок = Новый СписокЗначений;
//		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Провести';
//															|en = 'Post'"));
//		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена';
//																|en = 'Cancel'"));
//		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьВозможностьСозданияТранспортнойНакладнойОбработкаОтвета", ЭтотОбъект), ТекстВопроса, СписокКнопок);
//		Возврат;
//	КонецЕсли;
//		
//	ПроверитьВозможностьСозданияТранспортнойНакладнойЗавершение(МожноСоздатьТТН);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПроверитьВозможностьСозданияТранспортнойНакладнойЗавершение(МожноСоздатьТТН)
//	
//	Если Не МожноСоздатьТТН Тогда
//		Возврат; // Проверки не были пройдены, продолжать создание ТТН не нужно
//	КонецЕсли;
//	
//	Если ПроверитьНаличиеТранспортныхНакладных() Тогда
//		СписокКнопок = Новый СписокЗначений();
//		СписокКнопок.Добавить(КодВозвратаДиалога.Да,     НСтр("ru = 'Оформить';
//																|en = 'Register'"));
//		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru = 'Дополнить';
//																|en = 'Add'"));
//		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена';
//																|en = 'Cancel'"));
//		
//		Ответ = Неопределено;
//		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьТранспортнуюНакладнуюЗавершение", ЭтотОбъект), НСтр("ru = 'Оформить новую ТТН или дополнить существующую?';
//																											|en = 'Register a new waybill or supplement the existing one?'"), СписокКнопок);
//	Иначе
//		ОформитьТранспортнуюНакладную();
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ПроверитьНаличиеТранспортныхНакладных()

//	Отбор = Новый Структура("ДокументОснование, Дата",Объект.Ссылка,Объект.Дата);
//	
//	Возврат Документы.ТранспортнаяНакладная.ПроверитьНаличиеОформленныхТранспортныхНакладных(Отбор);

//КонецФункции

//&НаСервере
//Функция ПолучитьАдресХранилищаСПараметрамиОтбораТТН()
//	
//	ТаблицаПараметровОтбора = Документы.ТранспортнаяНакладная.ПолучитьПараметрыОтбораТТН(Объект.Ссылка);
//	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОтбора);
//	
//КонецФункции	

//&НаКлиенте
//Процедура СоздатьТранспортнуюНакладнуюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//    
//    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		ОформитьТранспортнуюНакладную();
//	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
//		ВыбратьТранспортнуюНакладную();
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьТранспортнуюНакладную()
//	
//	АдресХранилища = ПолучитьАдресХранилищаСПараметрамиОтбораТТН();
//	
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Вставить("ДокументОснование", Объект.Ссылка);
//	ПараметрыОтбора.Вставить("ДатаНачала", Объект.Дата - 14 * 24 * 60 * 60);
//	ПараметрыОтбора.Вставить("АдресХранилища", АдресХранилища);
//		
//	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
//	
//	ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.ФормаВыбора", 
//				ПараметрыФормы, 
//				ЭтаФорма,,,,,
//				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
//				
//КонецПроцедуры

//&НаКлиенте
//Процедура ОформитьТранспортнуюНакладную()
//	
//	СозданныеТТН = ОформитьТранспортныеНакладныеНаСервере();
//	
//	Если СозданныеТТН.Количество() = 1 Тогда 
//		ПоказатьЗначение(, СозданныеТТН[0]);
//	ИначеЕсли СозданныеТТН.Количество() > 1 Тогда
//		ПараметрыФормы = Новый Структура;
//		ПараметрыФормы.Вставить("ТранспортныеНакладные", СозданныеТТН);
//		ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.СозданныеТранспортныеНакладные", ПараметрыФормы, ЭтаФорма);
//	КонецЕсли;
//					
//КонецПроцедуры

//&НаСервере
//Функция ОформитьТранспортныеНакладныеНаСервере()
//	
//	МассивОбъектов = Новый Массив;
//	МассивОбъектов.Добавить(Объект.Ссылка);
//	СозданныеТТН = Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладные(МассивОбъектов);
//	
//	Если СозданныеТТН.Количество() <> 0 Тогда 
//		ПолучитьОбновитьИнформациюТранспортныхНакладных();
//	КонецЕсли;
//	
//	Возврат СозданныеТТН;
//	
//КонецФункции

//&НаКлиентеНаСервереБезКонтекста
//Процедура ОбновитьИнформациюТранспортныхНакладных(Параметры, Форма)
//	
//	Форма.КоличествоТранспортныхНакладных = Параметры.КоличествоТранспортныхНакладных;
//		
//	Если Форма.КоличествоТранспортныхНакладных = 0 Тогда
//		//Форма.Элементы.ГруппаТранспортныеНакладныеСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаНетТранспортныхНакладных;
//	ИначеЕсли Форма.КоличествоТранспортныхНакладных = 1 Тогда
//		//Форма.Элементы.ГруппаТранспортныеНакладныеСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаОднаТранспортнаяНакладная;
//		Форма.ТранспортнаяНакладная = Параметры.ТранспортнаяНакладная;
//		Форма.ТранспортнаяНакладнаяТекст = НСтр("ru = 'ТТН';
//												|en = 'Waybill'") + " " + Параметры.СокращенноеНаименованиеТранспортнойНакладной;
//	Иначе
//		//Форма.Элементы.ГруппаТранспортныеНакладныеСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаНесколькоТранспортныхНакладных;
//		ЗаголовокКоманды = НСтр("ru = 'ТТН (%КоличествоТранспортныхНакладных%)';
//								|en = 'Waybill (%КоличествоТранспортныхНакладных%)'");
//		ЗаголовокКоманды = СтрЗаменить(ЗаголовокКоманды, "%КоличествоТранспортныхНакладных%", Форма.КоличествоТранспортныхНакладных);
//		Форма.Элементы.ОткрытьСписокТН.Заголовок = ЗаголовокКоманды;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПолучитьОбновитьИнформациюТранспортныхНакладных()
//	
//	Если ПолучитьФункциональнуюОпцию("ИспользоватьТТН") И ПравоДоступа("Чтение", Метаданные.Документы.ТранспортнаяНакладная) Тогда 
//		ДанныеТранспортныхНакладных = ПолучитьИнформациюТранспортныхНакладных();
//		ОбновитьИнформациюТранспортныхНакладных(ДанныеТранспортныхНакладных, ЭтаФорма);
//	Иначе
//		Элементы.ТекстТТН.Видимость = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьИнформациюТранспортныхНакладных()
//	
//	Возврат Документы.ТранспортнаяНакладная.ПолучитьИнформациюТранспортныхНакладных(Объект.Ссылка);
//	
//КонецФункции

//&НаКлиенте
//Процедура ОткрытьСписокТранспортныхНакладных(Команда)
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Отбор", Новый Структура("ДокументОснование", Объект.Ссылка));
//	ОткрытьФорму("Документ.ТранспортнаяНакладная.ФормаСписка",
//				ПараметрыФормы,
//				ЭтаФорма,,,,,
//				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////
//&НаСервере
//Функция ПостроитьДеревоЭлементов()
//
//    ДеревоЭлементов = Новый ДеревоЗначений();
//    ДеревоЭлементов.Колонки.Добавить("ИмяЭлемента");
//
//    КореньЭлементов = ДеревоЭлементов.Строки.Добавить();
//    Для Каждого ТекущийЭлементФормы Из Элементы Цикл
//        ОбработатьЭлемент(КореньЭлементов, ТекущийЭлементФормы);
//    КонецЦикла;
//	Возврат(ДеревоЭлементов);
//КонецФункции
//
//&НаСервере
//Процедура ОбработатьЭлемент(СтрокаДерева, ТекущийЭлементФормы)
//
//    Если ТипЗнч(ТекущийЭлементФормы) = Тип("ГруппаФормы") Тогда
//        ПодчиненнаяСтрокаДЕрева = СтрокаДерева.Строки.Добавить();
//        ПодчиненнаяСтрокаДЕрева.ИмяЭлемента = ТекущийЭлементФормы.Имя;
//        ОбработатьЭлемент(ПодчиненнаяСтрокаДЕрева, ТекущийЭлементФормы);
////    ИначеЕсли тип = другой элемент
//    Иначе
//        ПодчиненнаяСтрокаДЕрева = СтрокаДерева.Строки.Добавить();
//        ПодчиненнаяСтрокаДЕрева.ИмяЭлемента = ТекущийЭлементФормы.Имя;
//    КонецЕсли;
//
//КонецПроцедуры


//&НаКлиенте
//Процедура ВИЛС_ОформитьТранспортнуюНакладную()
//	
//	СозданныеТТН = ВИЛС_ОформитьТранспортныеНакладныеНаСервере();
//	
//	Если СозданныеТТН.Количество() = 1 Тогда 
//		ПоказатьЗначение(, СозданныеТТН[0]);
//	ИначеЕсли СозданныеТТН.Количество() > 1 Тогда
//		ПараметрыФормы = Новый Структура;
//		ПараметрыФормы.Вставить("ТранспортныеНакладные", СозданныеТТН);
//		ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.СозданныеТранспортныеНакладные", ПараметрыФормы, ЭтаФорма);
//	КонецЕсли;
//					
//КонецПроцедуры


//&НаСервере
//Функция ВИЛС_ОформитьТранспортныеНакладныеНаСервере()
//	
//	МассивОбъектов = Новый Массив;
//	МассивОбъектов.Добавить(Объект.Ссылка);
//	СозданныеТТН = Документы.ТранспортнаяНакладная..СоздатьТранспортныеНакладные(МассивОбъектов);
//	
//	Если СозданныеТТН.Количество() <> 0 Тогда 
//		ПолучитьОбновитьИнформациюТранспортныхНакладных();
//	КонецЕсли;
//	
//	Возврат СозданныеТТН;
//	
//КонецФункции

///////////////////////////////////////////////




#Область ОбработчикиСобытий

&НаКлиенте
Процедура ВИЛСОбработкаКомандыСоздатьТранспортныеНакладные(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();	
	ВыделенныеСтрокиИдентификаторы = Элементы.Маршрут.ВыделенныеСтроки;
	
	Если ВыделенныеСтрокиИдентификаторы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно создать транспортные накладные. Не выделено ни одного адреса доставки.';
								|en = 'Cannot create consignment notes. No delivery address is selected.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Маршрут");
		Возврат;
	КонецЕсли;

	СозданныеТраспортныеНакладные = ВИЛССоздатьТранспортныеНакладныеНаСервере(ВыделенныеСтрокиИдентификаторы);
						
	Если СозданныеТраспортныеНакладные.Количество() = 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СозданныеТраспортныеНакладные[0]);
		
		ОткрытьФорму(
				"Документ.ТранспортнаяНакладная.ФормаОбъекта", 
				ПараметрыФормы);
				
	ИначеЕсли СозданныеТраспортныеНакладные.Количество() > 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТранспортныеНакладные", СозданныеТраспортныеНакладные);
		
		ОткрытьФорму(
				"Документ.ТранспортнаяНакладная.Форма.СозданныеТранспортныеНакладные", 
				ПараметрыФормы);
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВИЛССоздатьТранспортныеНакладныеНаСервере(ВыделенныеСтрокиИдентификаторы)
	
	ВыделенныеСтроки = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтрокиИдентификаторы Цикл
		ИсходныйНомерСтроки = Объект.Маршрут.НайтиПоИдентификатору(ИдентификаторСтроки).ИсходныйНомерСтроки;
		ВыделенныеСтроки.Добавить(ИсходныйНомерСтроки);
	КонецЦикла;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	ЗаданияНаПеревозкуДляОформленияТН = Документы.ТранспортнаяНакладная.ПроверитьЗаданияНаПеревозкуДляОформленияТранспортныхНакладных(
		МассивОбъектов, ВыделенныеСтроки);
	
	СозданныеТранспортныеНакладные = Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладныеДляЗаданийНаПеревозку(
			ЗаданияНаПеревозкуДляОформленияТН, 
			ВыделенныеСтроки);
			
	ЗаполнитьСлужебныеРеквизитыМаршрута();
			
	Возврат СозданныеТранспортныеНакладные;
	
КонецФункции
//// begin fix Suetin 07.10.2019 13:25:56
//&НаСервере
//Функция ВИЛС_СоздатьТранспортныеНакладныеДляЗаданийНаПеревозку(МассивОбъектов, ВыделенныеСтроки = Неопределено) 

//	Запрос = Новый Запрос;
//	Запрос.Текст = Документы.ЗаданиеНаПеревозку.ТекстЗапросаПолученияСпискаНакладныхИзЗаданийНаПеревозку() + 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку КАК Ссылка,
//	|	НакладныеПоЗаданиямНаПеревозку.НомерСтроки КАК НомерСтроки,
//	|	ЕСТЬNULL(ТранспортнаяНакладная.Ссылка, ЗНАЧЕНИЕ(Документ.ТранспортнаяНакладная.ПустаяСсылка)) КАК ТранспортнаяНакладная,
//	|	ЕСТЬNULL(ТранспортнаяНакладная.Организация, ЕСТЬNULL(НакладныеПоЗаданиямНаПеревозку.Накладная.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК Организация,
//	|	ВЫБОР
//	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ
//	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель
//	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ
//	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент
//	//++ НЕ УТКА
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПередачаДавальцу).Контрагент
//	//-- НЕ УТКА
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).Организация
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику                          // begin fix Suetin 24.09.2019 13:23:12
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ЗаказПоставщику).Организация   // end fix Suetin 24.09.2019 13:23:16
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|	КОНЕЦ КАК Грузополучатель,
//	|	ВЫБОР
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	//++ НЕ УТ
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	//-- НЕ УТ				
//	//++ НЕ УТКА
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
//	//-- НЕ УТКА
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент

//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.ОрганизацияПолучатель
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	//-- НЕ УТ
//	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику     // fix Suetin 24.09.2019 13:19:34	
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Организация
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|	КОНЕЦ КАК Плательщик,
//	|	ЕСТЬNULL(ТранспортнаяНакладная.АдресДоставки, НакладныеПоЗаданиямНаПеревозку.АдресДоставки) КАК АдресДоставки
//	|ИЗ
//	|	НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
//	|		ПО НакладныеПоЗаданиямНаПеревозку.АдресДоставки = ТранспортнаяНакладная.АдресДоставки
//	|			И НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку = ТранспортнаяНакладная.ЗаданиеНаПеревозку
//	|			И НакладныеПоЗаданиямНаПеревозку.Накладная.Организация = ТранспортнаяНакладная.Организация
//	|			И (ВЫБОР
//	|				КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	//++ НЕ УТ
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ
//	|						) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель
//	|				КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	//++ НЕ УТ
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ
//	|						) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент
//	//++ НЕ УТКА
//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
//	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПередачаДавальцу).Контрагент
//	//-- НЕ УТКА
//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).Организация
//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику                          // begin fix Suetin 24.09.2019 13:23:12
//	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ЗаказПоставщику).Организация   // end fix Suetin 24.09.2019 13:23:16
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			КОНЕЦ = ТранспортнаяНакладная.Грузоотправитель)
//	|			И ВЫБОР
//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	//++ НЕ УТ
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ				
//	//++ НЕ УТКА
//	|						ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
//	//-- НЕ УТКА
//	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент

//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|					ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
//	|				КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|						И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|					ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|					ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	//-- НЕ УТ
//	|					ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику     // fix Suetin 24.09.2019 13:19:34	
//	|					ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Организация
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			КОНЕЦ = ТранспортнаяНакладная.Плательщик
//	|			И (ТранспортнаяНакладная.Проведен)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	НомерСтроки,
//	|	Организация,
//	|	Грузополучатель
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	НакладныеПоЗаданиямНаПеревозку.Накладная,
//	|	НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку КАК Ссылка,
//	|	ЕСТЬNULL(НакладныеПоЗаданиямНаПеревозку.Накладная.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|	ВЫБОР
//	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ
//	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель
//	|		КОГДА (НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ
//	|				) И НакладныеПоЗаданиямНаПеревозку.Накладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент
//	//++ НЕ УТКА
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПередачаДавальцу).Контрагент
//	//-- НЕ УТКА
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).Организация
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику                          // begin fix Suetin 24.09.2019 13:23:12
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ЗаказПоставщику).Организация   // end fix Suetin 24.09.2019 13:23:16
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|	КОНЕЦ КАК Грузополучатель,
//	|	ВЫБОР
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.РеализацияТоваровУслуг
//	//++ НЕ УТ
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаТоваровХранителю
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаСырьяПереработчику
//	//-- НЕ УТ				
//	//++ НЕ УТКА
//	|				ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПередачаДавальцу
//	//-- НЕ УТКА
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Контрагент

//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель
//	|		КОГДА НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ПеремещениеТоваров
//	|				И ВЫРАЗИТЬ(НакладныеПоЗаданиямНаПеревозку.Накладная КАК Документ.ПеремещениеТоваров).ОрганизацияПолучатель = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ВозвратТоваровПоставщику
//	//++ НЕ УТ
//	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ОтгрузкаТоваровСХранения
//	//-- НЕ УТ
//	|			ИЛИ НакладныеПоЗаданиямНаПеревозку.Накладная ССЫЛКА Документ.ЗаказПоставщику     // fix Suetin 24.09.2019 13:19:34
//	|			ТОГДА НакладныеПоЗаданиямНаПеревозку.Накладная.Организация
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|	КОНЕЦ КАК Плательщик,
//	|	НакладныеПоЗаданиямНаПеревозку.АдресДоставки КАК АдресДоставки,
//	|	НакладныеПоЗаданиямНаПеревозку.НомерСтроки КАК НомерСтроки
//	|ИЗ
//	|	НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснованияОснования
//	//|		ПО НакладныеПоЗаданиямНаПеревозку.Накладная = ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование        // begin fix Suetin 26.09.2019 17:13:15
//	|		ПО НакладныеПоЗаданиямНаПеревозку.Накладная = ТранспортнаяНакладнаяДокументыОснованияОснования.ВИЛС_ДокументОснование   // end fix Suetin 26.09.2019 17:13:19
//	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.ЗаданиеНаПеревозку = НакладныеПоЗаданиямНаПеревозку.ЗаданиеНаПеревозку)
//	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.Проведен)
//	|ГДЕ
//	//|	ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование ЕСТЬ NULL           // begin fix Suetin 26.09.2019 17:13:05
//	|	ТранспортнаяНакладнаяДокументыОснованияОснования.ВИЛС_ДокументОснование ЕСТЬ NULL      // end fix Suetin 26.09.2019 17:13:09
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	НомерСтроки,
//	|	Организация,
//	|	Грузополучатель";

//	Запрос.УстановитьПараметр("ЗаданияНаПеревозку",  	   МассивОбъектов);
//	Запрос.УстановитьПараметр("ВыделенныеСтрокиАдресов",   ВыделенныеСтроки);
//	Запрос.УстановитьПараметр("НетВыделенныхСтрокАдресов", НЕ ЗначениеЗаполнено(ВыделенныеСтроки));
//	Запрос.УстановитьПараметр("ВсеРаспоряжения",           Истина);
//	Запрос.УстановитьПараметр("Распоряжения",              Новый Массив);

//	УстановитьПривилегированныйРежим(Истина);
//	МассивРезультатов = Запрос.ВыполнитьПакет();
//	УстановитьПривилегированныйРежим(Ложь);
//	ТранспортныеНакладныеПоНомерамСтрок = МассивРезультатов[2].Выбрать();
//	РаспоряженияБезТранспортныхНакладных = МассивРезультатов[3].Выбрать();

//	СозданныеТранспортныеНакладные 	= Новый Массив;

//	Пока ТранспортныеНакладныеПоНомерамСтрок.Следующий() Цикл

//		СтруктураПоиска = Новый Структура;
//		СтруктураПоиска.Вставить("Ссылка", 			ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
//		СтруктураПоиска.Вставить("НомерСтроки", 	ТранспортныеНакладныеПоНомерамСтрок.НомерСтроки);
//		СтруктураПоиска.Вставить("Организация", 	ТранспортныеНакладныеПоНомерамСтрок.Организация);
//		СтруктураПоиска.Вставить("Плательщик", 		ТранспортныеНакладныеПоНомерамСтрок.Плательщик);
//		СтруктураПоиска.Вставить("Грузополучатель", ТранспортныеНакладныеПоНомерамСтрок.Грузополучатель);

//		МассивРаспоряженийБезТранспортныхНакладных = Новый Массив;

//		Пока РаспоряженияБезТранспортныхНакладных.НайтиСледующий(СтруктураПоиска) Цикл
//			МассивРаспоряженийБезТранспортныхНакладных.Добавить(РаспоряженияБезТранспортныхНакладных.Накладная);		
//		КонецЦикла;
//		//#Удаление
//		//МассивРаспоряженийСТоварами = ПолучитьТолькоДокументыОснованияСТоварами(МассивРаспоряженийБезТранспортныхНакладных);
//		//#КонецУдаления
//		//#Вставка
//		МассивРаспоряженийСТоварами = ВИЛС_ПолучитьТолькоДокументыОснованияСТоварами(МассивРаспоряженийБезТранспортныхНакладных, , ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
//		//#КонецВставки
//		Если НЕ ЗначениеЗаполнено(МассивРаспоряженийСТоварами) Тогда
//			Продолжить;
//		КонецЕсли;

//		ЗначенияЗаполнения = Новый Структура;
//		ЗначенияЗаполнения.Вставить("АдресДоставки", 	ТранспортныеНакладныеПоНомерамСтрок.АдресДоставки);
//		ЗначенияЗаполнения.Вставить("Организация", 		ТранспортныеНакладныеПоНомерамСтрок.Организация);
//		ЗначенияЗаполнения.Вставить("Плательщик", 		ТранспортныеНакладныеПоНомерамСтрок.Плательщик);
//		ЗначенияЗаполнения.Вставить("Грузополучатель", 	ТранспортныеНакладныеПоНомерамСтрок.Грузополучатель);
//		ЗначенияЗаполнения.Вставить("Перевозчик", 		Неопределено);

//		Если ЗначениеЗаполнено(ТранспортныеНакладныеПоНомерамСтрок.ТранспортнаяНакладная) Тогда
//			ТранспортнаяНакладная = ПерезаписатьТранспортнуюНакладную(
//			ТранспортныеНакладныеПоНомерамСтрок.ТранспортнаяНакладная, 
//			МассивРаспоряженийСТоварами,
//			ЗначенияЗаполнения,
//			ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
//		Иначе
//			ТранспортнаяНакладная = СоздатьИлиЗаполнитьТранспортнуюНакладную(
//			МассивРаспоряженийСТоварами, 
//			ЗначенияЗаполнения, 
//			ТранспортныеНакладныеПоНомерамСтрок.Ссылка);
//		КонецЕсли;

//		СозданныеТранспортныеНакладные.Добавить(ТранспортнаяНакладная);

//	КонецЦикла;

//	Возврат СозданныеТранспортныеНакладные;

//КонецФункции

//&НаСервере
//Функция ВИЛС_ПолучитьТолькоДокументыОснованияСТоварами(МассивВсехРаспоряжений, Отказ, ТекущееЗаданиеНаПеревозку) 
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка КАК Ссылка,
//	|	ДанныеДокументов.Валюта КАК Валюта,
//	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
//	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка,
//	|	ДанныеДокументов.Валюта,
//	|	ДанныеДокументов.ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ВозвратТоваровПоставщику КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка КАК Ссылка,
//	|	ДанныеДокументов.Валюта КАК Валюта,
//	|	ДанныеДокументов.ВидКорректировки
//	|
//	|ИЗ
//	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка,
//	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
//	|	ДанныеДокументов.ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ПеремещениеТоваров КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	//++ НЕ УТ
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка,
//	|	ДанныеДокументов.Валюта,
//	|	ДанныеДокументов.ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ОтгрузкаТоваровСХранения КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка КАК Ссылка,
//	|	ДанныеДокументов.Валюта КАК Валюта,
//	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ПередачаТоваровХранителю КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка,
//	|	ДанныеДокументов.Валюта,
//	|	ДанныеДокументов.ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ПередачаСырьяПереработчику КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	//-- НЕ УТ
//	//++ НЕ УТКА
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка,
//	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
//	|	ДанныеДокументов.ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ПередачаДавальцу КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка,
//	|	ДанныеДокументов.Валюта,
//	|	ДанныеДокументов.ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ВозвратСырьяДавальцу КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	//|ОБЪЕДИНИТЬ ВСЕ  // begin fix Suetin 19.09.2019 12:50:30
//	//|
//	//|ВЫБРАТЬ
//	//|	ДанныеДокументов.Ссылка КАК Ссылка,
//	//|	ДанныеДокументов.Ссылка.ВИЛС_ДоговорПеревозчика.ВалютаВзаиморасчетов КАК Валюта,
//	//|	ДанныеДокументов.Распоряжение.ХозяйственнаяОперация КАК ХозяйственнаяОперация
//	//|ИЗ
//	//|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ДанныеДокументов
//	//|ГДЕ
//	//|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеДокументов.Распоряжение КАК Ссылка,
//	|	ДанныеДокументов.Распоряжение.Договор.ВалютаВзаиморасчетов КАК Валюта,
//	|	ДанныеДокументов.Распоряжение.ХозяйственнаяОперация КАК ХозяйственнаяОперация
//	|ИЗ
//	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ДанныеДокументов
//	|ГДЕ
//	|	ДанныеДокументов.Распоряжение В(&МассивОбъектов)      
//	|   И ДанныеДокументов.Ссылка = &ТекущееЗаданиеНаПеревозку
//	// end fix Suetin 19.09.2019 12:50:36
//	|

//	//-- НЕ УТКА
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДанныеДокументов.Ссылка КАК ДокументОснование,
//	|	ЛОЖЬ КАК Корректировочный
//	|
//	|ПОМЕСТИТЬ СчетаФактурыОснования
//	|ИЗ
//	|	ТаблицаДанныхДокументов КАК ДанныеДокументов
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка
//	|;";
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивВсехРаспоряжений);
//	Запрос.УстановитьПараметр("ТекущееЗаданиеНаПеревозку", ТекущееЗаданиеНаПеревозку);       // fix Suetin 20.09.2019 15:56:45
//	Запрос.Выполнить();
//	
//	РеализацияТоваровУслугЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	ВозвратТоваровПоставщикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	ПеремещениеТоваровЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	КорректировкаРеализацииЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	
//	//++ НЕ УТ
//	ОтгрузкаТоваровСХраненияЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	ПередачаТоваровХранителюЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
//	ПередачаСырьяПереработчикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
//	//-- НЕ УТ
//	ЗаданиеНаПеревозкуЛокализация.ВИЛС_ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ТекущееЗаданиеНаПеревозку);        // fix Suetin 19.09.2019 15:47:00
//	//++ НЕ УТКА
//	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
//	ПараметрыЗаполнения.ПересчитыватьВВалютуРегл = Ложь;
//	ПередачаДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
//	ВозвратСырьяДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
//	//-- НЕ УТКА
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка КАК Ссылка
//	|ИЗ
//	|	РеализацияТоваровУслугТаблицаТоваров КАК ДокументТовары
//	|		
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
////++ НЕ УТ
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка КАК Ссылка
//	|ИЗ
//	|	ПередачаСырьяПереработчикуТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка КАК Ссылка
//	|ИЗ
//	|	ПередачаТоваровХранителюТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка
//	|ИЗ
//	|	ОтгрузкаТоваровСХраненияТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
////-- НЕ УТ
////++ НЕ УТКА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка КАК Ссылка
//	|ИЗ
//	|	ПередачаДавальцуТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка
//	|ИЗ
//	|	ВозвратСырьяДавальцуТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
////-- НЕ УТКА
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПеремещениеТоваров.Ссылка
//	|ИЗ
//	|	ПеремещениеТоваровТаблицаТоваров КАК ПеремещениеТоваров
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТаблицаТоваров.Ссылка
//	|ИЗ
//	|	ТаблицаТоваровКорректировкаРеализации КАК ТаблицаТоваров
//	|ГДЕ
//	|	ТаблицаТоваров.ЭтоТовар
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Ссылка
//	|ИЗ
//	|	ВозвратТоваровПоставщикуТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
//	|   // begin fix Suetin 20.09.2019 10:56:13
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ДокументТовары.Распоряжение         // fix Suetin 20.09.2019 16:07:00   Ссылка -> Распоряжение
//	|ИЗ
//	|	ЗаданиеНаПеревозкуТаблицаТоваров КАК ДокументТовары
//	|ГДЕ
//	|	ДокументТовары.ЭтоТовар
//	|";   // end fix Suetin 20.09.2019 10:56:23
//		
//	СтрокиТоваров = Запрос.Выполнить().Выбрать();
//	
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	МассивРаспоряженийСТоварами = Новый Массив;
//	
//	Пока СтрокиТоваров.Следующий() Цикл
//		Если МассивРаспоряженийСТоварами.Найти(СтрокиТоваров.Ссылка) = Неопределено Тогда
//			МассивРаспоряженийСТоварами.Добавить(СтрокиТоваров.Ссылка);	
//		КонецЕсли;			
//	КонецЦикла;
//	
//	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВсехРаспоряжений, Неопределено);
//	
//	МассивРаспоряженийБезТоваров = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивВсехРаспоряжений, МассивРаспоряженийСТоварами);
//	              	
//	Для Каждого РаспоряжениеБезТоваров Из МассивРаспоряженийБезТоваров Цикл
//		ТекстСообщения = НСтр("ru = 'Документ ""%Документ%"" не может являться основанием для транспортной накладной, т.к. в нем отсутствует номенклатура типа ""%ТипТовар%"" или ""%ТипТара%"".';
//								|en = 'The ""%Документ%"" document cannot be a basis for the consignment note as it does not contain products of the ""%ТипТовар%"" or ""%ТипТара%"" type.'");
//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", РаспоряжениеБезТоваров);
//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипТовар%", Перечисления.ТипыНоменклатуры.Товар);
//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипТара%", Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, РаспоряжениеБезТоваров,,,Отказ);
//	КонецЦикла;
//	
//	Возврат МассивРаспоряженийСТоварами;
//	
//КонецФункции

//// end fix Suetin 07.10.2019 13:26:05
#КонецОбласти