//>>fix бесшовка
&Вместо("ЗаписатьОбъект")
&НаСервере
// Записывает задачу, возможно, выполняя ее.
//
// Параметры:
//   РезультатВыполненияЗадачи - Неопределено, если задача просто записывается, или
//                       - Структура - результат выполнения со свойствами:
//     НомерКнопки - Число - номер кнопки, выполняющей задачу.
//     ВыбранныйИсполнитель - Строка - currentUser - текущий пользователь, или
//                                   - taskPerformer - фактический исполнитель задачи.
//     ПредметСсылка - ЛюбаяСсылка - неявно возвращаемый параметр, предмет задачи,
//       требующий оповещения об изменении.
//
Функция ВИЛС_ЗаписатьОбъект(РезультатВыполненияЗадачи = Неопределено)
	
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	
	ПроцессXDTO = СоздатьОбъект(Прокси, ПроцессТип);
	ПроцессXDTO.name = Процесс;
	ПроцессXDTO.objectID = ИнтеграцияС1СДокументооборот.СоздатьObjectID(Прокси, ПроцессID, ПроцессТип);
	
	Задача = СоздатьОбъект(Прокси, Тип);
	
	Если ДоступнаМультипредметность Тогда
		ЗаполнитьЗадачуПредметамиИзДереваПриложений(Прокси, ДеревоПриложений.ПолучитьЭлементы(), Задача);
	КонецЕсли;
	
	Задача.executed = ?(РезультатВыполненияЗадачи <> Неопределено, Истина, Выполнена);
	Задача.parentBusinessProcess = ПроцессXDTO;
	Задача.objectID = ИнтеграцияС1СДокументооборот.СоздатьObjectID(Прокси, ID, Тип);
	Задача.name = Наименование;
	Задача.number = Номер;
	Задача.description = Описание;
	Задача.beginDate = Дата;
	Задача.dueDate = СрокИсполнения;
	Задача.endDate = ДатаИсполнения;
	Задача.executionComment = РезультатВыполнения;
	Задача.businessProcessStep = ТочкаМаршрута;
	ЗаполнитьXDTOПоОбъектномуРеквизиту(Прокси, "Важность", "importance", Задача);
	
	// Заполним результат и исполнителя задачи при выполнении.
	Если РезультатВыполненияЗадачи <> Неопределено Тогда
		
		ЗаполнитьСвойстваОбъектаПоТипуЗадачи(Прокси, Задача, РезультатВыполненияЗадачи.НомерКнопки);
	
		Если РезультатВыполненияЗадачи.ВыбранныйИсполнитель = "currentUser" Тогда
			Обработки.ИнтеграцияС1СДокументооборот.СоздатьУчастникаБизнесПроцесса(
				Прокси, Задача.performer, ЭтаФорма, "ТекущийПользователь", "ОбъектАдресации");
		Иначе
			Обработки.ИнтеграцияС1СДокументооборот.СоздатьУчастникаБизнесПроцесса(
				Прокси, Задача.performer, ЭтаФорма, "Исполнитель", "ОбъектАдресации");
		КонецЕсли;
			
	Иначе // обычная запись
		
		Обработки.ИнтеграцияС1СДокументооборот.СоздатьУчастникаБизнесПроцесса(
			Прокси, Задача.performer, ЭтаФорма, "Исполнитель", "ОбъектАдресации");
		
	КонецЕсли;
	
	Обработки.ИнтеграцияС1СДокументооборот.СформироватьДополнительныеСвойства(Прокси, Задача, ЭтаФорма);
	
	Ответ = ИнтеграцияС1СДокументооборот.ЗаписатьОбъект(Прокси, Задача);
	
	Если ИнтеграцияС1СДокументооборот.ПроверитьТип(Прокси, Ответ, "DMError") Тогда
		
		Возврат Ложь;
		
	Иначе // Изменение состояния согласования требует особой обработки с оповещением предмета.
		
		Если Тип = "DMBusinessProcessApprovalTaskApproval" 
			И РезультатВыполненияЗадачи <> Неопределено Тогда
			
			НовоеСостояние = Неопределено;
			Если РезультатВыполненияЗадачи.НомерКнопки = 3 Тогда
				НовоеСостояние = Перечисления.СостоянияСогласованияВДокументообороте.НеСогласован;
			Иначе
				ДанныеПроцесса = ИнтеграцияС1СДокументооборот.ПолучитьОбъект(Прокси,
					ПроцессТип,
					ПроцессID,
					СтрРазделить("completed", ""));
				Если ДанныеПроцесса.objects[0].completed = Истина Тогда
					НовоеСостояние = Перечисления.СостоянияСогласованияВДокументообороте.Согласован;
				КонецЕсли;
			КонецЕсли;
			Если НовоеСостояние <> Неопределено Тогда
				Для Каждого СтрокаПредмета Из ДеревоПриложений.ПолучитьЭлементы() Цикл
					Если (Не ДоступнаМультипредметность Или СтрокаПредмета.РольПредмета = "Основной")
						И ИнтеграцияС1СДокументооборотКлиентСервер.ЭтоДокумент(СтрокаПредмета.ПредметТип) Тогда
						ИнтеграцияС1СДокументооборотВызовСервера.ПриИзмененииСостоянияСогласования(
							СтрокаПредмета.ПредметID,
							СтрокаПредмета.ПредметТип,
							НовоеСостояние,
							Ложь,
							РезультатВыполненияЗадачи.ПредметСсылка);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Тип = "DMBusinessProcessConfirmationTaskConfirmation"  
			И РезультатВыполненияЗадачи <> Неопределено Тогда
			НовоеСостояние = Неопределено;
			Если РезультатВыполненияЗадачи.НомерКнопки = 3 Тогда
				НовоеСостояние = "Отклонено";
			Иначе
				НаборКолонок = Новый Массив;
				НаборКолонок.Добавить("completed");
				ДанныеПроцесса = ИнтеграцияС1СДокументооборот.ПолучитьОбъект(Прокси,
					ПроцессТип,
					ПроцессID,
					СтрРазделить("completed", ""));
				Если ДанныеПроцесса.objects[0].completed = Истина Тогда
					НовоеСостояние = "Утверждено";
				КонецЕсли;
			КонецЕсли;
			Если НовоеСостояние <> Неопределено Тогда
				Для Каждого СтрокаПредмета Из ДеревоПриложений.ПолучитьЭлементы() Цикл
					Если (Не ДоступнаМультипредметность Или СтрокаПредмета.РольПредмета = "Основной")
						И ИнтеграцияС1СДокументооборотКлиентСервер.ЭтоДокумент(СтрокаПредмета.ПредметТип) Тогда
						ИнтеграцияС1СДокументооборотВызовСервера.ВИЛС_ПриИзмененииУтверждения(
							СтрокаПредмета.ПредметID,
							СтрокаПредмета.ПредметТип,
							НовоеСостояние,
							Ложь,
							РезультатВыполненияЗадачи.ПредметСсылка);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Модифицированность = Ложь;
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции
//<<fix бесшовка