//begin fix Администратор 21.09.2018  
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("ВИЛС_СтрокаСерий")=Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы("ВИЛС_СтрокаСерий",Новый ОписаниеТипов("Строка"),"Объект.Товары","ТекстСерий");
		МассивДобавляемых = Новый Массив;
		МассивДобавляемых.Добавить(НовыйРеквизит);
		ИзменитьРеквизиты(МассивДобавляемых);
		
		НовыйЭлемент = Элементы.Вставить("ВИЛС_СтрокаСерий",Тип("ПолеФормы"),Элементы.Товары,Элементы.ТоварыКоличествоУпаковок);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ГиперссылкаЯчейки = Истина;
		НовыйЭлемент.Видимость= Истина;
		НовыйЭлемент.ПутьКДанным = "Объект.Товары.ВИЛС_СтрокаСерий";
		НовыйЭлемент.ЗАголовок = "Серии";
		НовыйЭлемент.УстановитьДействие("Нажатие","ВИЛС_Подключаемый_НажатиеНеГиперссылкуСерии");
	КонецЕсли;
	
	Команда = Команды.Добавить("ВИЛС_ОткрытьСерию");
	Команда.Действие = "ВИЛС_ОткрытьСерию";
	
	НоваяКнопка = Элементы.Добавить("ВИЛС_ОткрытьСерию",Тип("КнопкаФормы"),Элементы.Товары.КоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "ВИЛС_ОткрытьСерию";
    НоваяКнопка.Заголовок  = "Открыть серию";
		
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ПриОткрытииПосле(Отказ)
	Для Каждого СтрокаТовар Из Объект.Товары Цикл
		ВИЛС_ОбработкаСтрокиТЧДляСерий(СтрокаТовар)
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ОткрытьСерию(Кнопка)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если не ТекДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.Серия) Тогда 
			КлючПоиска = Новый Структура("Ключ", ТекДанные.Серия);
			ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта",КлючПоиска);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&Вместо("ОткрытьПодборСерийЗавершение")
&НаКлиенте
Процедура ВИЛС_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПараметрыФормыУказанияСерий = ДополнительныеПараметры.ПараметрыФормыУказанияСерий;
    
    
    ЗначениеВозврата = Результат;
    
    Если ЗначениеВозврата <> Неопределено Тогда
        ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий);
		ТекДанные = Элементы.Товары.ТекущиеДанные;
	ВИЛС_ОбработкаСтрокиТЧДляСерий(ТекДанные);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ВИЛС_СтрокаСерий" Тогда
		ОткрытьПодборСерий();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВИЛС_ОбработкаСтрокиТЧДляСерий(ТекДанные)
	 Если не ТекДанные = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Характеристика",ТекДанные.Характеристика);
		Отбор.Вставить("Номенклатура",ТекДанные.Номенклатура);
		Отбор.Вставить("Назначение",ТекДанные.Назначение);
		НайденныеСтроки = Объект.Серии.НайтиСтроки(Отбор);
		СтрокаСерий = "<серии не указаны>";
		
		Если НайденныеСтроки.Количество() Тогда
			СтрокаСерий = "";
			Для Каждого СтрокаСерии Из НайденныеСтроки Цикл
				СтрокаСерий = СтрокаСерий+СокрЛП(СтрокаСерии.Серия);
			КонецЦикла;
		КонецЕсли;
		 ТекДанные.ВИЛС_СтрокаСерий = СтрокаСерий;
	КонецЕсли;
КонецПроцедуры

//end fix Администратор 21.09.2018

