#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("СтруктураОснования")
Функция ВИЛС_СтруктураОснования(Объект, ПоДоговору)
	
	СтруктураОснование = Новый Структура;
	СтруктураОснование.Вставить("Основание");
	СтруктураОснование.Вставить("ОснованиеНомер");
	СтруктураОснование.Вставить("ОснованиеДата");
	
	Если ПоДоговору И ЗначениеЗаполнено(Объект.Договор) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК Основание,
		|	ДоговорыКонтрагентов.Дата КАК ОснованиеДата,
		|	ДоговорыКонтрагентов.Номер КАК ОснованиеНомер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Объект.Договор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтруктураОснование.Основание = СокрЛП(Выборка.Основание);
			СтруктураОснование.ОснованиеДата = Объект.Дата;   //  ТТН	Выборка.ОснованиеДата;    // fix Suetin 11.02.2019 12:57:14
			СтруктураОснование.ОснованиеНомер = СокрЛП(Объект.Номер); // ТТН	СокрЛП(Выборка.ОснованиеНомер);  // fix Suetin 11.02.2019 12:57:35
		КонецЕсли;
		
	ИначеЕсли Не ПоДоговору Тогда
		
		МассивЗаказов = Неопределено;
		Если ЗначениеЗаполнено(Объект.ЗаказДавальца) Тогда
			
			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(Объект.ЗаказДавальца);
			
		ИначеЕсли Объект.Товары.Количество() <> 0 Тогда
			
			Если ТипЗнч(Объект) = Тип("Структура") Тогда
				МассивЗаказов = Объект.Товары.ВыгрузитьКолонку("ЗаказДавальца");
			Иначе
				МассивЗаказов = Объект.Товары.Выгрузить(, "ЗаказДавальца").ВыгрузитьКолонку("ЗаказДавальца");
			КонецЕсли;
			
		КонецЕсли;
		
		Если МассивЗаказов <> Неопределено Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаказыДавальца.НомерПоДаннымПартнера КАК НомерПоДаннымПартнера,
			|	ЗаказыДавальца.ДатаПоДаннымПартнера  КАК ДатаПоДаннымПартнера,
			|	ЗаказыДавальца.Номер                 КАК Номер,
			|	ЗаказыДавальца.Дата                  КАК Дата,
			|	&СинонимЗаказа                       КАК Синоним
			|ИЗ
			|	Документ.ЗаказДавальца КАК ЗаказыДавальца
			|ГДЕ
			|	ЗаказыДавальца.Ссылка В(&МассивЗаказов)");
			
			Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
			Запрос.УстановитьПараметр("СинонимЗаказа", НСтр("ru='Заказ давальца'"));
			Выборка = Запрос.Выполнить().Выбрать();
			
			ТекстПоЗаказам = "";
			ОдноОснование = Выборка.Количество() = 1;
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.НомерПоДаннымПартнера) И ЗначениеЗаполнено(Выборка.ДатаПоДаннымПартнера) Тогда
					
					ИнформацияОЗаказе = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 № %2 от %3'"),                               // Строка с параметрами
						Выборка.Синоним,                                            // 1 параметр
						Выборка.НомерПоДаннымПартнера,                              // 2 параметр
						Формат(Выборка.ДатаПоДаннымПартнера, "ДЛФ=ДД")); // 3 параметр
					ДатаПоЗаказам  = Выборка.ДатаПоДаннымПартнера;
					НомерПоЗаказам = Выборка.НомерПоДаннымПартнера;
				Иначе
					
					ИнформацияОЗаказе = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Выборка, Выборка.Синоним);
					ДатаПоЗаказам  = Выборка.Дата;
					НомерПоЗаказам = Выборка.Номер;
				КонецЕсли;
				
				ТекстПоЗаказам = ТекстПоЗаказам + ", " + ИнформацияОЗаказе;
				
			КонецЦикла;
			
			СтруктураОснование.Основание      = СокрЛП(Сред(ТекстПоЗаказам, 3));
			СтруктураОснование.ОснованиеДата  = ?(ОдноОснование, ДатаПоЗаказам, "");
			СтруктураОснование.ОснованиеНомер = ?(ОдноОснование,ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерПоЗаказам),"");
		КонецЕсли;
		// begin fix Suetin 31.01.2019 16:40:59
		Если ЗначениеЗаполнено(Объект.Договор) Тогда 
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК Основание,
				|	ДоговорыКонтрагентов.Дата КАК ОснованиеДата,
				|	ДоговорыКонтрагентов.Номер КАК ОснованиеНомер
				|ИЗ
				|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|ГДЕ
				|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Объект.Договор);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если МассивЗаказов <> Неопределено Тогда
					СтруктураОснование.Основание = СокрЛП(Выборка.Основание) + "; " + СокрЛП(СтруктураОснование.Основание);   //;
				Иначе
					СтруктураОснование.Основание = СокрЛП(Выборка.Основание);
				КонецЕсли;	
				СтруктураОснование.ОснованиеДата = Объект.Дата;   //  ТТН
				СтруктураОснование.ОснованиеНомер = СокрЛП(Объект.Номер); // ТТН
			КонецЕсли;
		КонецЕсли;	
		// end fix Suetin 31.01.2019 16:41:46
	КонецЕсли;
	
	Возврат СтруктураОснование; // Возврат значения по умолчанию
	
КонецФункции

&Вместо("ОснованияДляПечати")
Функция ВИЛС_ОснованияДляПечати(Объект)
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "Дата, Номер");
		РеквизитыДоговораТекст = СтрШаблон(
			НСтр("ru='по договору №%1 от %2'"),
			РеквизитыДоговора.Номер,
			Формат(РеквизитыДоговора.Дата, "ДЛФ=ДД"));
		
	Иначе
		РеквизитыДогвораТекст = "";
	КонецЕсли;
	
	ТаблицаОснований = Новый ТаблицаЗначений;
	ТаблицаОснований.Колонки.Добавить("Основание",      Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(300)));
	ТаблицаОснований.Колонки.Добавить("ОснованиеДата",  Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата))); 
	ТаблицаОснований.Колонки.Добавить("ОснованиеНомер", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(128)));
	// begin fix Suetin 11.02.2019 13:03:32
	СтруктураОснования = СтруктураОснования(Объект, Ложь);
	Если ЗначениеЗаполнено(СтруктураОснования.Основание) Тогда
		ДобавленнаяСтрока = ТаблицаОснований.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, СтруктураОснования);
		ДобавленнаяСтрока.Основание = СтруктураОснования.Основание;
	КонецЕсли;
	// end fix Suetin 11.02.2019 13:03:38	
	СтруктураОснования = СтруктураОснования(Объект, Истина);
	Если ЗначениеЗаполнено(СтруктураОснования.Основание) Тогда
		
		СтруктураОснования.Основание = СтрШаблон(
			СтруктураОснования.Основание + НСтр("ru=', переработка давальческого сырья %1'"),
			РеквизитыДоговораТекст);
			
		ДобавленнаяСтрока = ТаблицаОснований.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, СтруктураОснования);
		
	КонецЕсли;
	
	//СтруктураОснования = СтруктураОснования(Объект, Ложь);
	//Если ЗначениеЗаполнено(СтруктураОснования.Основание) Тогда
	//	
	//	Если ТаблицаОснований.Количество() = 0 Тогда
	//		СтруктураОснования.Основание = СтрШаблон(
	//			СтруктураОснования.Основание + НСтр("ru=', переработка давальческого сырья %1'"),
	//			РеквизитыДоговораТекст);
	//	КонецЕсли;
	//	
	//	ДобавленнаяСтрока = ТаблицаОснований.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, СтруктураОснования);
	//	
	//КонецЕсли;
	
	Если ТаблицаОснований.Количество() = 0 Тогда
		ДобавленнаяСтрока = ТаблицаОснований.Добавить();
		ДобавленнаяСтрока.Основание      = СтрШаблон(НСтр("ru='Переработка давальческого сырья %1'"), РеквизитыДоговораТекст);
		ДобавленнаяСтрока.ОснованиеДата  = ?(ЗначениеЗаполнено(Объект.Договор), РеквизитыДоговора.Дата, ""); 
		ДобавленнаяСтрока.ОснованиеНомер = ?(ЗначениеЗаполнено(Объект.Договор), ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДоговора.Номер), "");
	КонецЕсли;
	
	Возврат ТаблицаОснований;
	
КонецФункции
#КонецЕсли