
&ИзменениеИКонтроль("Выгрузить")
Процедура ВИЛС_Выгрузить(ПараметрыВыгрузки, АдресХранилища)

	ТаблицаДокументов = ПараметрыВыгрузки.ТаблицаДокументов;

	КоличествоДокументов = ТаблицаДокументов.Количество();

	Если Не КоличествоДокументов Тогда
		Возврат;
	КонецЕсли;

	ТаблицаДокументов.Сортировать("Дата");
	НачПериода = ТаблицаДокументов[0].Дата;
	КонПериода = ТаблицаДокументов[КоличествоДокументов-1].Дата;

	БанковскиеСчетаВыгрузки = ПараметрыВыгрузки.БанковскийСчет;

	ПотокВыгрузки = Новый ТекстовыйДокумент();

	// Формируем заголовок
	ПотокВыгрузки.ДобавитьСтроку("1CClientBankExchange");

#Удаление
	ПотокВыгрузки.ДобавитьСтроку("ВерсияФормата=" + ?(ТекущаяДатаСеанса() >= '20140101', "1.02", "1.01"));
#КонецУдаления
#Вставка
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	Если ТекущаяДатаСеанса >= '20200601' Тогда
		ВерсияФормата = "1.03";
	ИначеЕсли ТекущаяДатаСеанса >= '20140101' Тогда
		ВерсияФормата = "1.02";
	Иначе
		ВерсияФормата = "1.01";
	КонецЕсли;
	
	ПотокВыгрузки.ДобавитьСтроку("ВерсияФормата=" + ВерсияФормата);
#КонецВставки
	ПотокВыгрузки.ДобавитьСтроку("Кодировка="     + ?(ЗначениеЗаполнено(ПараметрыВыгрузки.Кодировка), ПараметрыВыгрузки.Кодировка, "Windows"));
	ПотокВыгрузки.ДобавитьСтроку("Отправитель="   + Метаданные.Синоним);
	ПотокВыгрузки.ДобавитьСтроку("Получатель="    + СокрЛП(ПараметрыВыгрузки.Программа));
	ПотокВыгрузки.ДобавитьСтроку("ДатаСоздания="  + Формат(ТекущаяДатаСеанса(), "ДФ=дд.ММ.гггг"));
	ПотокВыгрузки.ДобавитьСтроку("ВремяСоздания=" + Формат(ТекущаяДатаСеанса(), "ДФ=ЧЧ:мм:сс"));
	ПотокВыгрузки.ДобавитьСтроку("ДатаНачала="    + Формат(НачПериода, "ДФ=дд.ММ.гггг"));
	ПотокВыгрузки.ДобавитьСтроку("ДатаКонца="     + Формат(КонПериода, "ДФ=дд.ММ.гггг"));

	Если ТипЗнч(БанковскиеСчетаВыгрузки) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ОчереднойБанковскийСчет Из БанковскиеСчетаВыгрузки Цикл 
			ПотокВыгрузки.ДобавитьСтроку("РасчСчет=" + ОчереднойБанковскийСчет.НомерСчета);
		КонецЦикла;
	Иначе
		ПотокВыгрузки.ДобавитьСтроку("РасчСчет=" + БанковскиеСчетаВыгрузки.НомерСчета);
	КонецЕсли;

	ВидыДокументов = Новый Соответствие;
	ВидыДокументов.Вставить(Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение, "Платежное поручение");
	ВидыДокументов.Вставить(Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование, "Платежное требование");

	Для каждого ВидДокумента Из ВидыДокументов Цикл
		Если ТаблицаДокументов.Найти(ВидДокумента.Ключ, "ВидДокумента") <> Неопределено Тогда
			ПотокВыгрузки.ДобавитьСтроку("Документ=" + ВидДокумента.Значение);
		КонецЕсли;
	КонецЦикла;

	// Выводим отмеченные секции документов
	Для каждого СтрокаСекции Из ТаблицаДокументов Цикл

		ЗаполнятьПоказательТипа = ЗначениеЗаполнено(СтрокаСекции.Дата)
		И ТипЗнч(СтрокаСекции.Дата) = Тип("Дата")
		И СтрокаСекции.Дата < ПлатежиВБюджетКлиентСервер.НачалоДействияУказания3844У();
		Буфер = СекцияДокумент(СтрокаСекции, ЗаполнятьПоказательТипа);

		КоличествоСрокСекции = СтрЧислоСтрок(Буфер);
		Для Сч = 1 По КоличествоСрокСекции Цикл
			ПотокВыгрузки.ДобавитьСтроку(СтрПолучитьСтроку(Буфер, Сч));
		КонецЦикла;
	КонецЦикла;

	ПотокВыгрузки.ДобавитьСтроку("КонецФайла");

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");

	// Кодировку задаем текстом, иначе бывают проблемы на сервере в Linux и в связке англоязычная Windows + англоязычный SQL.
	Если ПараметрыВыгрузки.Кодировка = "DOS" Тогда
		Кодировка = "cp866";        // КодировкаТекста.OEM;
	Иначе
		Кодировка = "windows-1251"; // КодировкаТекста.ANSI;
	КонецЕсли;

	ПотокВыгрузки.Записать(ИмяВременногоФайла, Кодировка);

	ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), АдресХранилища);

	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
#Удаление
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Выгрузка платежей в банк.Удаление временного файла';
		|en = 'Export payments to bank.Remove temporary file'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
#КонецУдаления
#Вставка
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Выгрузка платежей в банк.Удаление временного файла';
				|en = 'Export payments to bank.Remove temporary file'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
#КонецВставки
	КонецПопытки;

КонецПроцедуры
