
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		МассивДобавляемыхРеквизитов = Новый Массив;
		Реквизит = Новый РеквизитФормы("ВИЛС_СпособОтраженияЗарплатыВБухучете",Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВБухучете"),,"Способ отражения");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит);
		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);		
		
		//Элементы
		НовыйЭлемент = Элементы.Вставить("ВИЛС_СпособОтраженияЗарплатыВБухучете",Тип("ПолеФормы"), Элементы.ГруппаУсловияПриемаКраткоеОписание, Элементы.ГруппаУсловияПриемаКраткоеОписание.ПодчиненныеЭлементы.ТрудоваяФункция);
		НовыйЭлемент.ПутьКДанным = "ВИЛС_СпособОтраженияЗарплатыВБухучете";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		//НовыйЭлемент.Ширина = 30;
		//НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		//НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПВ);
		//НовыйЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСПВ);
		ЭтотОбъект.ВИЛС_СпособОтраженияЗарплатыВБухучете = Объект.СпособОтраженияЗарплатыВБухучете;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ВИЛС_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		ТекущийОбъект.СпособОтраженияЗарплатыВБухучете = ЭтотОбъект.ВИЛС_СпособОтраженияЗарплатыВБухучете;
	КонецЕсли; 
КонецПроцедуры
