
&НаКлиенте
Процедура ВИЛС_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
//>>fix бесшовка	
	Если ИмяСобытия = "ИзменитьСтатус" и не Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена") Тогда
		ЭтотОбъект.Прочитать();
		СтатусИзменен = Ложь;
		///Сообщить(Параметр.КтоРешил);
		
		
		Если Параметр.Согласован и Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована") Тогда 
			СтатусИзменен = Истина;
		КонецЕсли;
		
		Если (ТипЗнч(Параметр.Утвержден) = Тип("Булево") 
			и Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована"))
			и не СтатусИзменен Тогда
			Если  Параметр.Утвержден Тогда
				СтатусИзменен = Истина;
			Иначе
				СтатусИзменен = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если не Объект.КтоРешил = Параметр.КтоРешил Тогда
			СтатусИзменен = Истина;
		КонецЕсли;
		
		//begin fix Клещ А.Н. 21.01.2019  
		Если не Объект.ВИЛС_Исполнитель = Параметр.Исполнитель Тогда
			СтатусИзменен = Истина;
		КонецЕсли;
		//end fix Клещ А.Н. 21.01.2019
		Если СтатусИзменен Тогда
			
			ЗаписатьИзменения(Параметр);
			
		КонецЕсли;
		//begin fix Клещ А.Н. 01.10.2019 
		знДоступность = Не Объект.ВИЛС_КазначейскийКонтрольПройден;
		УстановитьДоступностьЭлемента("СуммаДокумента",знДоступность);
		//end fix Клещ А.Н. 01.10.2019
	КонецЕсли;
//<<fix бесшовка	
КонецПроцедуры
//>>fix бесшовка

//begin fix Клещ А.Н. 01.10.2019  
&НаСервере
Процедура УстановитьДоступностьЭлемента(Имя,знДоступность);
	Элементы[Имя].Доступность = знДоступность и не (РольДоступна("ВИЛС_ПраваНаРедактированиеКазначейскимКонтролем")или РольДоступна("ПолныеПрава"));
КонецПроцедуры

//end fix Клещ А.Н. 01.10.2019


&НаСервере
Процедура ЗаписатьИзменения(Параметр)
	
	СтатусИзменен = Ложь;
	ЭтотОбъект.Модифицированность = Ложь;
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	
	
	Если Параметр.Согласован и ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована Тогда 
		ОбъектДокумента.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована");
		СтатусИзменен = Истина;
	КонецЕсли;
	
	
	Если (ТипЗнч(Параметр.Утвержден) = Тип("Булево") 
		и ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
		и не СтатусИзменен Тогда
		Если  Параметр.Утвержден Тогда
			ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
		Иначе
			ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена;
		КонецЕсли;
	КонецЕсли;
	
	Если не ОбъектДокумента.КтоРешил = Параметр.КтоРешил Тогда
		ОбъектДокумента.КтоРешил = Параметр.КтоРешил;
	КонецЕсли;
	//begin fix Клещ А.Н. 21.01.2019  
	Если не ОбъектДокумента.ВИЛС_Исполнитель = Параметр.Исполнитель Тогда
		//begin fix Клещ А.Н. 01.10.2019  
		Если не ОбъектДокумента.ВИЛС_КазначейскийКонтрольПройден и  СокрЛП(ОбъектДокумента.ВИЛС_Исполнитель) = "Казначейский контроль" Тогда
			ОбъектДокумента.ВИЛС_КазначейскийКонтрольПройден = Истина;
			Элементы.СуммаДокумента.ТолькоПросмотр = Истина и не (РольДоступна("ВИЛС_ПраваНаРедактированиеКазначейскимКонтролем")или РольДоступна("ПолныеПрава"));
		КонецЕсли;
		//end fix Клещ А.Н. 01.10.2019
		ОбъектДокумента.ВИЛС_Исполнитель = Параметр.Исполнитель;
	КонецЕсли;
	//end fix Клещ А.Н. 21.01.2019
	
	ОбъектДокумента.Записать();
	
	ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
	
КонецПроцедуры


&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.Статус.Вид = ВидПоляФормы.ПолеНадписи;
	//begin fix Клещ А.Н. 01.10.2019  
	Элементы.СуммаДокумента.ТолькоПросмотр = Объект.ВИЛС_КазначейскийКонтрольПройден и не (РольДоступна("ВИЛС_ПраваНаРедактированиеКазначейскимКонтролем")или РольДоступна("ПолныеПрава"));
	//end fix Клещ А.Н. 01.10.2019
КонецПроцедуры
//<<fix бесшовка

&Вместо("УстановитьСписокСтатусов")
&НаСервере
Процедура ВИЛС_УстановитьСписокСтатусов()
	
	//СписокВыбора = Элементы.Статус.СписокВыбора;
	//
	//Если Не ПравоСогласования Или Не ПравоУтверждения Тогда
	//	
	//	СписокВыбора.Очистить();
	//	СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	//	СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	//	
	//	Если ПравоСогласования Или Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована Тогда
	//		СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	//	КонецЕсли;
	//	
	//	Если ПравоУтверждения Или Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
	//		СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&Вместо("УстановитьФормуОплаты")
&НаСервере
Процедура ВИЛС_УстановитьФормуОплаты()
	
	Если Объект.ФормаОплатыНаличная И Объект.ФормаОплатыБезналичная Тогда
		ФормаОплаты = "Любая";
	
	ИначеЕсли Объект.ФормаОплатыНаличная Тогда
		ФормаОплаты = "Наличная";
		
	ИначеЕсли Объект.ФормаОплатыБезналичная Тогда
		ФормаОплаты = "Безналичная";
		
	ИначеЕсли Объект.ФормаОплатыПлатежнаяКарта Тогда
		ФормаОплаты = "ПлатежнаяКарта";
		
	Иначе
		ФормаОплаты = "";
		
	КонецЕсли;
	
	//fix Клещ А.Н. если новый документ, форма оплаты безнал
	Если Объект.Ссылка.Пустая() тогда
		ФормаОплаты = "Безналичная";
		Объект.ФормаОплатыНаличная = Ложь;
		Объект.ФормаОплатыБезналичная = Истина;
		Объект.ФормаОплатыПлатежнаяКарта = Ложь;
		Объект.ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Безналичная;
		ФормаОплатыЗаявкиПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры