
&НаКлиенте
Процедура ВИЛС_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
//>>fix бесшовка	
	Если ИмяСобытия = "ИзменитьСтатус" и не Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена") Тогда
		ЭтотОбъект.Прочитать();
		СтатусИзменен = Ложь;
		Сообщить(Параметр.КтоРешил);
		Если не Объект.КтоРешил = Параметр.КтоРешил Тогда
			СтатусИзменен = Истина;
		КонецЕсли;
		
		//begin fix Клещ А.Н. 21.01.2019  
		Если не Объект.ВИЛС_Исполнитель = Параметр.Исполнитель Тогда
			СтатусИзменен = Истина;
		КонецЕсли;
		//end fix Клещ А.Н. 21.01.2019
		
		Если Параметр.Согласован и Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована") Тогда 
			СтатусИзменен = Истина;
		КонецЕсли;
		
		Если (ТипЗнч(Параметр.Утвержден) = Тип("Булево") 
			и Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована"))
			и не СтатусИзменен Тогда
			Если  Параметр.Утвержден Тогда
				СтатусИзменен = Истина;
			Иначе
				СтатусИзменен = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СтатусИзменен Тогда
			
			ЗаписатьИзменения(Параметр);
			
		КонецЕсли;
		
	КонецЕсли;
//<<fix бесшовка	
КонецПроцедуры
//>>fix бесшовка
&НаСервере
Процедура ЗаписатьИзменения(Параметр)
	
	СтатусИзменен = Ложь;
	ЭтотОбъект.Модифицированность = Ложь;
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Если не ОбъектДокумента.КтоРешил = Параметр.КтоРешил Тогда
		ОбъектДокумента.КтоРешил = Параметр.КтоРешил;
			СтатусИзменен = Истина;
		КонецЕсли;
		
		Если Параметр.Согласован и ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована Тогда 
			ОбъектДокумента.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована");
		КонецЕсли;
		
		//begin fix Клещ А.Н. 21.01.2019  
		Если не ОбъектДокумента.ВИЛС_Исполнитель = Параметр.Исполнитель Тогда
			ОбъектДокумента.ВИЛС_Исполнитель = Параметр.Исполнитель;
			СтатусИзменен = Истина;
		КонецЕсли;
		//end fix Клещ А.Н. 21.01.2019
		
		Если (ТипЗнч(Параметр.Утвержден) = Тип("Булево") 
			и ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
			и не СтатусИзменен Тогда
			Если  Параметр.Утвержден Тогда
				ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
			Иначе
				ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена;
				СтатусИзменен = Истина;
			КонецЕсли;
		КонецЕсли;
	ОбъектДокумента.Записать();
	
	ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
	
КонецПроцедуры


&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.Статус.Вид = ВидПоляФормы.ПолеНадписи;
КонецПроцедуры
//<<fix бесшовка

&Вместо("УстановитьСписокСтатусов")
&НаСервере
Процедура ВИЛС_УстановитьСписокСтатусов()
	
	//СписокВыбора = Элементы.Статус.СписокВыбора;
	//
	//Если Не ПравоСогласования Или Не ПравоУтверждения Тогда
	//	
	//	СписокВыбора.Очистить();
	//	СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	//	СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	//	
	//	Если ПравоСогласования Или Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована Тогда
	//		СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	//	КонецЕсли;
	//	
	//	Если ПравоУтверждения Или Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
	//		СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры