
&НаКлиенте
Процедура ВИЛС_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменитьСтатус" и не Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена") Тогда
		СтатусИзменен = Ложь;
		Если Параметр.Согласован и Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована") Тогда 
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована");
			СтатусИзменен = Истина;
		КонецЕсли;
		
		Если (ТипЗнч(Параметр.Утвержден) = Тип("Булево") 
			и Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована"))
			и не СтатусИзменен Тогда
			Если  Параметр.Утвержден Тогда
				Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате");
				СтатусИзменен = Истина;
			Иначе
				Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена");
				СтатусИзменен = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СтатусИзменен Тогда
			ЗаписатьИзменения();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменения()
	
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	
	ОбъектДокумента.Записать();
	
	ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
	
КонецПроцедуры
