
&НаСервере
&Вместо("ЗаполнитьПоОстаткамНаСервере")    //ИзменениеИКонтроль
Процедура ВИЛС_ЗаполнитьПоОстаткамНаСервере()

	Объект.ОС.Очистить();

	Если НЕ ЗначениеЗаполнено(Объект.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанныеУчета = Документы.ИнвентаризацияОС.ДанныеУчета(
	Объект.Организация,
	Объект.Подразделение,
	Объект.Дата,
	Объект.ХозяйственнаяОперация);

	Для каждого ДанныеУчета Из ТекущиеДанныеУчета Цикл

		ДанныеСтроки = Объект.ОС.Добавить();
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеУчета);
//#Вставка
		ДанныеСтроки.МОЛ = ДанныеУчета.МОЛПоДаннымУчета;       // fix Suetin 04.12.2019 11:39:23
//#КонецВставки
		ВнеоборотныеАктивыКлиентСерверЛокализация.ЗаполнитьДанныеУчетаВСтрокеИнвентаризацииОС(
		ДанныеСтроки, 
		ДанныеУчета,
		Объект.Организация, 
		Объект.Подразделение,
		Ложь,
		Истина,
		ИспользуетсяУправлениеВНА_2_4);

	КонецЦикла;

КонецПроцедуры
