
&После("ПриСозданииНаСервере")
Процедура ВИЛС_ПриСозданииНаСервере(Форма, ПараметрыРазмещения)  	// begin fix Suetin 12.01.2021 1:12:31
	// fix Suetin 12.01.2021 1:15:05 Лучше вызвать в СобытияФорм.ПриСозданииНаСервере, но там уже очищен Параметры.Отбор 
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора" Тогда
		//end fix Клещ А.Н. 02. 
		Если Форма.Параметры.Отбор.Свойство("ХозяйственнаяОперация") И
			Форма.Параметры.Отбор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту Тогда
			
			МассивХозяйственныхОпераций = Новый Массив();
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
			//begin fix Клещ А.Н. 10.04.2019  
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья);
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
			//end fix Клещ А.Н. 10.04.2019
			
					
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.Список, 
				"ХозяйственнаяОперация", 
				МассивХозяйственныхОпераций,
				ВидСравненияКомпоновкиДанных.ВСписке);
				
		КонецЕсли;
		//begin fix Клещ А.Н.	
		Если Форма.Параметры.Отбор.Свойство("ХозяйственнаяОперация") И
			Форма.Параметры.Отбор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи Тогда
			
			МассивХозяйственныхОпераций = Новый Массив();
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
			 
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.Список, 
				"ХозяйственнаяОперация", 
				МассивХозяйственныхОпераций,
				ВидСравненияКомпоновкиДанных.ВСписке);
				
		КонецЕсли;
		//end fix Клещ А.Н.
		//begin fix Клещ А.Н. 02.07.2019  
		Если Форма.Параметры.Отбор.Свойство("ХозяйственнаяОперация") И
			Форма.Параметры.Отбор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
			
			МассивХозяйственныхОпераций = Новый Массив();
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПереработчику);
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);
			МассивХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.Список, 
				"ХозяйственнаяОперация", 
				МассивХозяйственныхОпераций,
				ВидСравненияКомпоновкиДанных.ВСписке);
				
		КонецЕсли;
		//end fix Клещ А.Н. 02.07.2019
	КонецЕсли;	
КонецПроцедуры     													// end fix Suetin 12.01.2021 1:12:37
