&Вместо("ЗаполнитьПараметрыДляРасчетаОценочныхОбязательствОтпусков")
// Заполняет параметры для расчета оценочных обязательств по отпускам.
//
// Параметры:
// 	Организация – тип СправочникСсылка.Организации.
// 	ПериодРегистрации – тип Дата.
// 	ПараметрыДляРасчета – структура, параметры, которые будут заполняться, описание см ОтражениеЗарплатыВБухучете.ОписаниеПараметровДляРасчетаОценочныхОбязательствОтпусков.
// 	Сотрудники – Неопределенно или Массив.
//
Процедура ВИЛС_ЗаполнитьПараметрыДляРасчетаОценочныхОбязательствОтпусков(Организация, ПериодРегистрации, ПараметрыДляРасчета, Сотрудники) Экспорт

	НачисленнаяЗарплатаИВзносы = НачисленияИВзносыДляРасчетаОценочныхОбязательствОтпусков(Организация, ПериодРегистрации, Сотрудники);
	//begin fix Клещ А.Н. 06.05.2019  
	ИзменениеОтраженияВБухУчете(НачисленнаяЗарплатаИВзносы);
	//end fix Клещ А.Н. 06.05.2019
	
	ФондОплатыТрудаИСтраховыеВзносы = ОтражениеЗарплатыВБухучете.ФондОплатыТрудаИСтраховыеВзносыДляРасчетаОценочныхОбязательствОтпусков(Организация, ПериодРегистрации, НачисленнаяЗарплатаИВзносы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ФондОплатыТрудаИСтраховыеВзносы, ПараметрыДляРасчета.ФондОплатыТрудаИСтраховыеВзносы);
	
	ОстаткиОтпусковДляРасчетаОценочныхОбязательств = ОтражениеЗарплатыВБухучете.ОстаткиОтпусковДляРасчетаОценочныхОбязательств(Организация, ПериодРегистрации, Сотрудники);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОстаткиОтпусковДляРасчетаОценочныхОбязательств, ПараметрыДляРасчета.ОстаткиОтпусков);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		ПараметрыДляРасчета.ОстаткиОтпусков.ЗаполнитьЗначения(КонецМесяца(ПериодРегистрации),"ДатаНачала");
		ИменаТаблиц = "ФондОплатыТрудаИСтраховыеВзносы,ОстаткиОтпусков";
		Модуль.ДополнитьДанныеДокументаМестомВСтруктуреПредприятия(ПараметрыДляРасчета, ИменаТаблиц);
	КонецЕсли;
	
	Для каждого ЭлементСтруктуры Из ПараметрыДляРасчета Цикл
		Если ЭлементСтруктуры.Значение.Колонки.Найти("ПодразделениеУчетаЗатрат") <> Неопределено Тогда
			ЭлементСтруктуры.Значение.Колонки.Удалить("Подразделение");
			ЭлементСтруктуры.Значение.Колонки.ПодразделениеУчетаЗатрат.Имя = "Подразделение";
		КонецЕсли;
	КонецЦикла;
	
	ОтражениеЗарплатыВБухучете.СвернутьДанныеДляОтраженияЗарплатыВБухучете(ПараметрыДляРасчета, "ДатаНачала");

КонецПроцедуры

Процедура ИзменениеОтраженияВБухУчете(НачисленнаяЗарплатаИВзносы)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТЗ.Сотрудник КАК Сотрудник,
	|	ТЗ.Подразделение КАК Подразделение,
	|	ТЗ.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
	|	ТЗ.ДатаНачала КАК ДатаНачала,
	|	ТЗ.ВидОперации КАК ВидОперации,
	|	ТЗ.Начисление КАК Начисление,
	|	ТЗ.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ТЗ.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ТЗ.СтатьяРасходов КАК СтатьяРасходов,
	|	ТЗ.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ТЗ.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ТЗ.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
	|	ТЗ.Сумма КАК Сумма,
	|	ТЗ.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
	|	ТЗ.ПФРСПревышения КАК ПФРСПревышения,
	|	ТЗ.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
	|	ТЗ.ПФРСтраховая КАК ПФРСтраховая,
	|	ТЗ.ПФРНакопительная КАК ПФРНакопительная,
	|	ТЗ.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТЗ.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ТЗ.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
	|	ТЗ.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
	|	ТЗ.ФСС КАК ФСС,
	|	ТЗ.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	ТЗ.ФФОМС КАК ФФОМС,
	|	ТЗ.ТФОМС КАК ТФОМС,
	|	ТЗ.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
	|	ТЗ.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
	|	ТЗ.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
	|	ТЗ.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
	|ПОМЕСТИТЬ ВТ_ТаблицаЗаполнения
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска КАК ЭлементПоиска,
	|	ВИЛС_СоответствияПоРазделамУчета.ЭлементСоответствия КАК ЭлементСоответствия
	|ПОМЕСТИТЬ ВТ_Соответствия
	|ИЗ
	|	РегистрСведений.ВИЛС_СоответствияПоРазделамУчета КАК ВИЛС_СоответствияПоРазделамУчета
	|ГДЕ
	|	ВИЛС_СоответствияПоРазделамУчета.РазрезУчета = Значение(Справочник.ВИЛС_ИменаРазделовСоответствий.СоответствиеСпособовОтраженияДляОценочныхОбязательствПоОтпускам)
	|	И ВИЛС_СоответствияПоРазделамУчета.ЭлементПоиска В(&МассивЭлементов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЗаполнения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ТаблицаЗаполнения.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаЗаполнения.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаЗаполнения.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
	|	ВТ_ТаблицаЗаполнения.ДатаНачала КАК ДатаНачала,
	|	ВТ_ТаблицаЗаполнения.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаЗаполнения.Начисление КАК Начисление,
	|	ЕСТЬNULL(ВТ_Соответствия.ЭлементСоответствия, ВТ_ТаблицаЗаполнения.СпособОтраженияЗарплатыВБухучете) КАК СпособОтраженияЗарплатыВБухучете,
	|	ВТ_ТаблицаЗаполнения.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВТ_ТаблицаЗаполнения.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ТаблицаЗаполнения.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_ТаблицаЗаполнения.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_ТаблицаЗаполнения.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
	|	ВТ_ТаблицаЗаполнения.Сумма КАК Сумма,
	|	ВТ_ТаблицаЗаполнения.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
	|	ВТ_ТаблицаЗаполнения.ПФРСПревышения КАК ПФРСПревышения,
	|	ВТ_ТаблицаЗаполнения.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
	|	ВТ_ТаблицаЗаполнения.ПФРСтраховая КАК ПФРСтраховая,
	|	ВТ_ТаблицаЗаполнения.ПФРНакопительная КАК ПФРНакопительная,
	|	ВТ_ТаблицаЗаполнения.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВТ_ТаблицаЗаполнения.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ВТ_ТаблицаЗаполнения.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
	|	ВТ_ТаблицаЗаполнения.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
	|	ВТ_ТаблицаЗаполнения.ФСС КАК ФСС,
	|	ВТ_ТаблицаЗаполнения.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	ВТ_ТаблицаЗаполнения.ФФОМС КАК ФФОМС,
	|	ВТ_ТаблицаЗаполнения.ТФОМС КАК ТФОМС,
	|	ВТ_ТаблицаЗаполнения.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
	|	ВТ_ТаблицаЗаполнения.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
	|	ВТ_ТаблицаЗаполнения.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
	|	ВТ_ТаблицаЗаполнения.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
	|ИЗ
	|	ВТ_ТаблицаЗаполнения КАК ВТ_ТаблицаЗаполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Соответствия КАК ВТ_Соответствия
	|		ПО ВТ_ТаблицаЗаполнения.СпособОтраженияЗарплатыВБухучете = ВТ_Соответствия.ЭлементПоиска";
	
	ТЗОтбора = НачисленнаяЗарплатаИВзносы.Скопировать();
	ТЗОтбора.Свернуть("СпособОтраженияЗарплатыВБухучете");
	МассивЭлементов = ТЗОтбора.ВыгрузитьКОлонку("СпособОтраженияЗарплатыВБухучете");
	Запрос.УстановитьПараметр("МассивЭлементов",МассивЭлементов);
	Запрос.УстановитьПараметр("ТЗ",НачисленнаяЗарплатаИВзносы);
	НачисленнаяЗарплатаИВзносы = Запрос.Выполнить().Выгрузить();
КонецПроцедуры
