
#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаКлиенте
&ИзменениеИКонтроль("ЗаполнитьДатуПолучения")
Процедура ВИЛС_ЗаполнитьДатуПолучения()
	
#Удаление
	Если Объект.Исправление И ЗначениеЗаполнено(Объект.ДатаИсправления) Тогда
		Объект.Дата = Объект.ДатаИсправления;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаСоставления) Тогда
		Объект.Дата = Объект.ДатаСоставления;
	КонецЕсли;
#КонецУдаления

	ДатаПолученияПриИзмененииКлиент();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
