
&НаКлиенте
Процедура ВИЛС_ОСЗаполнитьСуммыИзФайлаВместо(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайлаДляЗагрузкиВТЧ", ЭтотОбъект);
	//ИмяФайла = СформироватьИмяФайлаДляОбъектаМетаданных(ИмяОбъектаСопоставления);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru = 'Книга Excel 97 (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx|Электронная таблица OpenDocument (*.ods)|*.ods|Текстовый документ c разделителями (*.csv)|*.csv|Табличный документ (*.mxl)|*.mxl';
														|en = 'Excel Workbook 97 (*.xls)|*.xls|Excel Workbook 2007 (*.xlsx)|*.xlsx|OpenDocument Spreadsheet  (*.ods)|*.ods|Delimited text document(*.csv)|*.csv|Spreadsheet document(*.mxl)|*.mxl'");
	ДиалогВыбораФайла.Расширение                  = "xls";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	//ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайла;
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбораФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаДляЗагрузкиВТЧ(ВыбранныеФайлы, Параметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КоличествоФайлов = ВыбранныеФайлы.Количество() - 1;
	Для Ном = 0 По КоличествоФайлов Цикл
		АдресФайла = ВыбранныеФайлы[Ном];
		
		Если АдресФайла = "" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не указан файл для загрузки";
			Сообщение.Поле = "Элементы.ОСЗаполнитьСуммыИзФайла";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		// Загрузка файла
		ВременныйКаталог = КаталогВременныхФайлов();
		
		ДлинаАдреса = СтрДлина(АдресФайла);
		ПозицияПоследнегоСлеша = ДлинаАдреса;
		Символ = Сред(АдресФайла, ПозицияПоследнегоСлеша, 1);
		Пока Символ <> "\" И Символ <> "/" Цикл
			ПозицияПоследнегоСлеша = ПозицияПоследнегоСлеша - 1;
			Символ = Сред(АдресФайла, ПозицияПоследнегоСлеша, 1);
		КонецЦикла;
		
		ИмяФайла = Сред(АдресФайла, ПозицияПоследнегоСлеша + 1);
		ИмяФайла = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяФайла);
		ПолноеИмяФайла = ВременныйКаталог + ИмяФайла;
		
		КопироватьФайл(АдресФайла, ПолноеИмяФайла);
		
		// Извлечение из ZIP архива
		Если ВРег(Прав(ИмяФайла, 3)) = "ZIP" Тогда
			ЧтениеZIP = Новый ЧтениеZipФайла(ПолноеИмяФайла);
			Элемент = ЧтениеZIP.Элементы[0];
			ЧтениеZIP.Извлечь(Элемент, ВременныйКаталог);
			ПолноеИмяФайла = ВременныйКаталог + Элемент.Имя;
		КонецЕсли;
		
		// Загрузка файла.
		ЗагружаемыеСтроки = Новый Массив;
		
		Попытка
			ПрочитатьСтроки_Excel(ПолноеИмяФайла, ЗагружаемыеСтроки);
		Исключение
			ИнформацияОбОшибке_Excel = ИнформацияОбОшибке();
			Попытка
				ПрочитатьСтроки_ADODB(ПолноеИмяФайла, ЗагружаемыеСтроки);
			Исключение
				ИнформацияОбОшибке_ADODB = ИнформацияОбОшибке();
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось прочитать файл Excel.
						|Сообщение об ошибке от COM-объекта Excel.Application:
						|	%1
						|Сообщение об ошибке от COM-объекта ADODB.Connection:
						|	%2
						|Обратитесь к системному администратору.'"),
					СтрЗаменить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке_Excel), Символы.ПС, Символы.ПС + Символы.Таб),
					СтрЗаменить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке_ADODB), Символы.ПС, Символы.ПС + Символы.Таб));
			КонецПопытки;
		КонецПопытки;
	
		// Удаление временных файлов.
		УдалитьФайлы(ПолноеИмяФайла);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьСтроки(ЗагружаемыеСтроки)
	ЭтотОбъектМодифицирован = Ложь;
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(9);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	ТЗ = Новый ТаблицаЗначений();
	Колонки = ТЗ.Колонки;
	//Колонки.Добавить("ОсновноеСредство");
	Колонки.Добавить("Колонка2", ОписаниеТиповС);
	Колонки.Добавить("Колонка3", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка4", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка5", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка6", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка7", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка8", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка9", ОписаниеТиповЧ);
	Колонки.Добавить("Колонка10",ОписаниеТиповЧ);
	РазмерМассива = ЗагружаемыеСтроки.Количество() - 1;
	Для Ном = 0 По РазмерМассива Цикл
		СтрокаТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, ЗагружаемыеСтроки[Ном]);
	КонецЦикла;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	//|	ТЗ.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЗ.Колонка2 КАК Код,
	|	ТЗ.Колонка3 КАК Колонка3,
	|	ТЗ.Колонка4 КАК Колонка4,
	|	ТЗ.Колонка5 КАК Колонка5,
	|	ТЗ.Колонка6 КАК Колонка6,
	|	ТЗ.Колонка7 КАК Колонка7,
	|	ТЗ.Колонка8 КАК Колонка8,
	|	ТЗ.Колонка9 КАК Колонка9,
	|	ТЗ.Колонка10 КАК Колонка10
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыЭксплуатации.Ссылка КАК ОсновноеСредство,
	|	ОбъектыЭксплуатации.Код КАК Код,
	|	ВТ.Колонка3 КАК Колонка3,
	|	ВТ.Колонка4 КАК Колонка4,
	|	ВТ.Колонка5 КАК Колонка5,
	|	ВТ.Колонка6 КАК Колонка6,
	|	ВТ.Колонка7 КАК Колонка7,
	|	ВТ.Колонка8 КАК Колонка8,
	|	ВТ.Колонка9 КАК Колонка9,
	|	ВТ.Колонка10 КАК Колонка10
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ПО ВТ.Код = ОбъектыЭксплуатации.Код
	|";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат ЭтотОбъектМодифицирован;
	КонецЕсли;
	ТЗ = Рез.Выгрузить();
	КоличествоСтрокТЗ = ТЗ.Количество()-1;
	Для Ном = 0 По КоличествоСтрокТЗ Цикл
		СтрокаТЗ = ТЗ[Ном];
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ОсновноеСредство) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "ОС с кодом " + СтрокаТЗ.Код + " не найдено!";
			Сообщение.Поле = "Элементы.ОСЗаполнитьСуммыИзФайла";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;         
		ПараметрОтбора = Новый Структура("ОсновноеСредство", СтрокаТЗ.ОсновноеСредство);
		МассивСтрокОС = Объект.ОС.НайтиСтроки(ПараметрОтбора);
		КоличетсвоСтрокОС = МассивСтрокОС.Количество();
		Если КоличетсвоСтрокОС = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "ОС " + СтрокаТЗ.ОсновноеСредство + " не найдено в документе!";
			Сообщение.Поле = "Элементы.ОСЗаполнитьСуммыИзФайла";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;  
		Если КоличетсвоСтрокОС > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "ОС " + СтрокаТЗ.ОсновноеСредство + " в документе присутствует " + КоличетсвоСтрокОС + " раз!";
			Сообщение.Поле = "Элементы.ОСЗаполнитьСуммыИзФайла";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		Если (МассивСтрокОС[0].ТекущаяСтоимостьБУ 		= СтрокаТЗ.Колонка3 и 	
			  МассивСтрокОС[0].ТекущаяСтоимостьНУ		= СтрокаТЗ.Колонка4 и 	
			  МассивСтрокОС[0].ТекущаяСтоимостьПР		= СтрокаТЗ.Колонка5 и 	
			  //МассивСтрокОС[0].ТекущаяСтоимостьВР 	= СтрокаТЗ.Колонка6 и 	
			  МассивСтрокОС[0].НакопленнаяАмортизацияБУ = СтрокаТЗ.Колонка7 и 	
			  МассивСтрокОС[0].НакопленнаяАмортизацияНУ = СтрокаТЗ.Колонка8 и 	
			  МассивСтрокОС[0].НакопленнаяАмортизацияПР = СтрокаТЗ.Колонка9) Тогда Продолжить; КонецЕсли;
			  
		МассивСтрокОС[0].ТекущаяСтоимостьБУ 		= СтрокаТЗ.Колонка3; 	
		МассивСтрокОС[0].ТекущаяСтоимостьНУ			= СтрокаТЗ.Колонка4; 	
		МассивСтрокОС[0].ТекущаяСтоимостьПР			= СтрокаТЗ.Колонка5; 	
		//МассивСтрокОС[0].ТекущаяСтоимостьВР 		= СтрокаТЗ.Колонка6; 	
		МассивСтрокОС[0].НакопленнаяАмортизацияБУ 	= СтрокаТЗ.Колонка7; 	
		МассивСтрокОС[0].НакопленнаяАмортизацияНУ 	= СтрокаТЗ.Колонка8; 	
		МассивСтрокОС[0].НакопленнаяАмортизацияПР 	= СтрокаТЗ.Колонка9; 	
		//МассивСтрокОС[0].НакопленнаяАмортизацияВР = СтрокаТЗ.Колонка10; 
		ЭтотОбъектМодифицирован = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "ОС " + СтрокаТЗ.ОсновноеСредство + " суммы изменены!";
		//Сообщение.Поле = "Элементы.ОСЗаполнитьСуммыИзФайла";
		Сообщение.Сообщить();
	КонецЦикла;
	Возврат ЭтотОбъектМодифицирован;
КонецФункции	

&НаКлиенте
Процедура ПрочитатьСтроки_Excel(ПолноеИмяФайла, МассивДанных)
	// Чтение листа Excel.
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		ИнформацияОбОшибке = Неопределено;
	Исключение
		ВызватьИсключение НСтр("ru = 'Не удалось подключить COM-объект Excel.
			|Вероятные причины:
			| - На сервере не установлен Microsoft Office;
			| - У пользователя недостаточно прав на создание COM-объектов;
			| - Включен контроль учетных записей Windows;
			| - Операционная система сервера не из семейства Windows.
			|
			|Техническая информация:
			|'") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	//Excel.Application.Workbooks.Open(ПолноеИмяФайла);
	Excel.Workbooks.Open(ПолноеИмяФайла);
	Excel.DisplayAlerts = 0;
	ExcelSheet = Excel.Sheets(1);
	ВсегоСтрок = ExcelSheet.Cells.SpecialCells(11).Row;
	ВсегоКолонок = ExcelSheet.Cells.SpecialCells(11).Column;
	
	ExcelSheetRange = ExcelSheet.Range(ExcelSheet.Cells(1,1), ExcelSheet.Cells(ВсегоСтрок,ВсегоКолонок));  //1,2
	Данные = ExcelSheetRange.Value.Выгрузить();
	
	Для Стр = 1 По ВсегоСтрок Цикл
		Строка = Новый Структура;
		Для Кол = 1 по ВсегоКолонок Цикл
			Строка.Вставить("Колонка"+Строка(Кол), ExcelSheet.Cells(Стр,Кол).Value);
		КонецЦикла;
		Если Не ЗначениеЗаполнено(Строка.Колонка2) или Строка.Колонка2 = "Код" Тогда Продолжить; КонецЕсли;
		МассивДанных.Добавить(Строка);
	КонецЦикла;
	
	ЭтотОбъект.Модифицированность = ЗагрузитьСтроки(МассивДанных);
	
	Данные = Неопределено;
	ExcelSheetRange = Неопределено;
	ВсегоСтрок = Неопределено;
	ExcelSheet = Неопределено;
	
	Excel.Application.Workbooks(1).Close();
	Excel.Quit();
	
	Excel = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСтроки_ADODB(ПолноеИмяФайла, МассивДанных)
	// Выгрузка данных excel в таблицу значений.
	Попытка
		Connection = Новый COMОбъект("ADODB.Connection");
	Исключение
		ВызватьИсключение НСтр("ru = 'Не удалось подключить объект ADODB.
			|Вероятные причины:
			| - У пользователя недостаточно прав на создание COM-объектов;
			| - Включен контроль учетных записей Windows;
			| - Операционная система сервера не из семейства Windows.
			|
			|Техническая информация:
			|'") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ConnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=""" + СокрЛП(ПолноеИмяФайла) + """;Extended Properties=""Excel 12.0;HDR=YES;IMEX=1;""";
	//ConnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=""" + СокрЛП(ПолноеИмяФайла) + """;Extended Properties=""Excel 12.0;HDR=NO;IMEX=2;""";
	Попытка
		Connection.Open(ConnectionString);
	Исключение
		ВызватьИсключение НСтр("ru = 'Не удалось прочитать файл объектом ADODB.
			|Вероятные причины:
			| - На сервере не установлен пакет ""Microsoft Access Database Engine 2010 Redistributable"";
			| - У пользователя недостаточно прав на создание COM-объектов;
			| - Включен контроль учетных записей Windows;
			|
			|Техническая информация:
			|'") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Connection.CursorLocation = 3;
	
	RecordSet = Connection.Execute("SELECT * FROM [A:CZ]");
	Если Не RecordSet.EOF() Тогда
		КолвоСтрокExcel = RecordSet.RecordCount + 1;    // (+1) - учет Строки-Заголовока, которая "съедается".
    	КолвоКолонокExcel = RecordSet.Fields.Count - 1;
		МассивДат = Новый Массив();
	КонецЕсли;	
	Пока Не RecordSet.EOF() Цикл
		НомерКолонки = 1;
		Если ЗначениеЗаполнено(RecordSet.Fields(НомерКолонки).Value) Тогда
			Строка = Новый Структура;
			Для НомерКолонки = 1 по КолвоКолонокExcel Цикл
				Если ЗначениеЗаполнено(RecordSet.Fields(НомерКолонки).Value) Тогда
					Строка.Вставить("Колонка"+Строка(НомерКолонки), RecordSet.Fields(НомерКолонки).Value);					
				Иначе
					КолвоКолонокExcel = НомерКолонки - 1;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			МассивДанных.Добавить(Строка);
			RecordSet.MoveNext();
		КонецЕсли;	
		RecordSet.MoveNext();
		Если Не КолвоКолонокExcel > НомерКолонки Тогда Прервать; КонецЕсли;
	КонецЦикла;	
	
	ЭтотОбъект.Модифицированность = ЗагрузитьСтроки(МассивДанных);
	
	RecordSet.Close();
	RecordSet = Неопределено;
	Connection.Close();
	Connection = Неопределено;

КонецПроцедуры
