
&ИзменениеИКонтроль("ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента")
Процедура ВИЛС_ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
#Вставка	
	//begin fix Клещ А.Н. 24.06.2019  
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ВводНачальныхОстатковОтпусков") Тогда
		Возврат;
	КонецЕСли;
	//end fix Клещ А.Н. 24.06.2019
#КонецВставки	
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ПроверитьДатыЗапретаИзмененияДанных(Источник, Отказ);
	
КонецПроцедуры