
&Вместо("СформироватьПечатнуюФормуИНВ19")
Функция ВИЛС_СформироватьПечатнуюФормуИНВ19(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНВ19";

	НомерДокумента = 0;

	УстановитьПривилегированныйРежим(Истина);

	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл

		//Если СтруктураОбъектов.Ключ <> "Документ.ИнвентаризационнаяОпись" Тогда 
		//	ТекстСообщения = НСтр("ru = 'Формирование печатной формы ""ИНВ-19"" доступно только для документов ""%ТипДокумента%"".';
		//	|en = 'INV-19 print form generation is available only for documents ""%ТипДокумента%"".'");
		//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипДокумента%", Метаданные.Документы.ИнвентаризационнаяОпись.Синоним);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		//	Продолжить;
		//КонецЕсли;

		Если СтруктураОбъектов.Ключ <> "Документ.ИнвентаризационнаяОпись" и  СтруктураОбъектов.Ключ <> "Документ.ВИЛС_ИнвентаризацияТМЦВЭксплуатации" Тогда 
			ТекстСообщения = НСтр("ru = 'Формирование печатной формы ""ИНВ-19"" доступно только для документов ""%ТипДокумента1%"",""%ТипДокумента2%"".';
			|en = 'INV-19 print form generation is available only for documents ""%ТипДокумента1%"",""%ТипДокумента2%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипДокумента1%", Метаданные.Документы.ИнвентаризационнаяОпись.Синоним);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипДокумента2%", Метаданные.Документы.ВИЛС_ИнвентаризацияТМЦВЭксплуатации.Синоним);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;

		МенеджерОбъекта = ОбщегоНазначенияУТ.ПолучитьМодульЛокализации(СтруктураОбъектов.Ключ);
		Если МенеджерОбъекта = Неопределено Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		КонецЕсли;

		Для Каждого ДокументОснование Из СтруктураОбъектов.Значение Цикл

			НомерДокумента = НомерДокумента + 1;
			Если НомерДокумента > 1 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыИНВ19(ПараметрыПечати, ДокументОснование);	
			Если НЕ ДанныеДляПечати = Неопределено Тогда
				ЗаполнитьТабличныйДокументИНВ19(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ДокументОснование);
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ТабличныйДокумент;

КонецФункции
