#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
// Интерфейс для регистрации обработки.
// Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение:
// Структура:
// Вид - строка - возможные значения:	"ДополнительнаяОбработка"
//										"ДополнительныйОтчет"
//										"ЗаполнениеОбъекта"
//										"Отчет"
//										"ПечатнаяФорма"
//										"СозданиеСвязанныхОбъектов"
//
// Назначение - массив строк имен объектов метаданных в формате:
//			<ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]
//			Например, "Документ.СчетЗаказ" или "Справочник.*"
//			Прим. параметр имеет смысл только для назначаемых обработок
//
// Наименование - строка - наименование обработки, которым будет заполнено
//						наименование справочника по умолчанию - краткая строка для
//						идентификации обработки администратором
//
// Версия - строка - версия обработки в формате <старший номер>.<младший номер>
//					используется при загрузке обработок в информационную базу
// БезопасныйРежим – Булево – Если истина, обработка будет запущена в безопасном режиме.
//							Более подбробная информация в справке.
//
// Информация - Строка- краткая информация по обработке, описание обработки
//
// ВерсияБСП - Строка - Минимальная версия БСП, на которую рассчитывает код
// дополнительной обработки. Номер версии БСП задается в формате «РР.ПП.ВВ.СС»
// (РР – старший номер редакции; ПП – младший номер ре-дакции; ВВ – номер версии; СС – номер сборки).
//
// Команды - ТаблицаЗначений - команды, поставляемые обработкой, одная строка таблицы соотвествует
//							одной команде
//				колонки: 
//				 - Представление - строка - представление команды конечному пользователю
//				 - Идентификатор - строка - идентефикатор команды. В случае печатных форм
//											перечисление через запятую списка макетов
//				 - Использование - строка - варианты запуска обработки:
//						"ОткрытиеФормы" - открыть форму обработки
//						"ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//						"ВызовСерверногоМетода" - вызов серверного экспортного метода из модуля объекта обработки
//				 - ПоказыватьОповещение – Булево – если Истина, требуется оказывать оповещение при начале
//								и при окончании запуска обработки. Прим. Имеет смысл только
//								при запуске обработки без открытия формы.
//				 - Модификатор – строка - для печатных форм MXL, которые требуется
//										отображать в форме ПечатьДокументов подсистемы Печать
//										требуется установить как "ПечатьMXL"
//
// Предусмотрено 2 команды:
// 1. "Открыть форму обработки" для загрузки прайс-листа в диалоговом режиме
// 2. "Загрузить прайс-лист и сохранить протокол в файл" для загрузки прайс-листа по регламентному заданию и
// сохранения протокола в файл.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Ведомость расчетов с поставщиками с номенклатурой (в натуральном выражении) (ВИЛС)");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.2.1.4");

	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	
	РегистрационныеДанные.Вставить("Информация", "Ведомость расчетов с поставщиками с номенклатурой (в натуральном выражении) (ВИЛС)");
	
	ТЗКоманд = Новый ТаблицаЗначений;
	ТЗКоманд.Колонки.Добавить("Идентификатор");
	ТЗКоманд.Колонки.Добавить("Представление");
	ТЗКоманд.Колонки.Добавить("Модификатор");
	ТЗКоманд.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманд.Колонки.Добавить("Использование");
	
	СтрокаКоманды = тзКоманд.Добавить();
	СтрокаКоманды.Идентификатор = "ВедомостьРасчетовСПоставщикамиСНоменклатурой_ВИЛС";  
	СтрокаКоманды.Представление = "Ведомость расчетов с поставщиками с номенклатурой (в натуральном выражении) (ВИЛС)";
	СтрокаКоманды.ПоказыватьОповещение = Истина;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", ТЗКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры;
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;
	
	Если Параметры.Свойство("ПараметрКоманды")
			И Параметры.Свойство("ОписаниеКоманды")
			И Параметры.ОписаниеКоманды.Свойство("ДополнительныеПараметры") Тогда 
		
		СформироватьПараметрыОтчета(Параметры.ПараметрКоманды, ЭтаФорма.ФормаПараметры, Параметры);
			
	КонецЕсли;
	
	ФормаПараметры = ЭтаФорма.ФормаПараметры;
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек;
	
	// Изменение настроек по функциональным опциям
	НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроекФормы);
	
	// Установка значений по умолчанию
	УстановитьОбязательныеНастройки(КомпоновщикНастроекФормы, Истина);
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	// Сформируем отчет
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрДанныеОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета,"ДанныеОтчета");
	
	ТекстЗапроса = ТекстЗапроса(ПараметрДанныеОтчета.Значение);
	ДобавитьОтборыВыбранныхПолейВЗапрос(ТекстЗапроса, НастройкиОтчета, СхемаКомпоновкиДанных.ВычисляемыеПоля, "Расчеты");                        // fix Suetin 27.11.2019 13:28:34
	ДобавитьОтборыВыбранныхПолейВЗапрос2(ТекстЗапроса, НастройкиОтчета, СхемаКомпоновкиДанных.ВычисляемыеПоля, "Расчеты");                       // fix Suetin 27.11.2019 14:26:19 ВзаиморасчетыСервер.
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = ТекстЗапроса;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы)
	
	КомпоновкаДанныхСервер.УстановитьПараметрыВалютыОтчета(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	СегментыСервер.ВключитьОтборПоСегментуПартнеровВСКД(КомпоновщикНастроек);
	УстановитьДатуОтчета(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
КонецПроцедуры

Процедура УстановитьДатуОтчета(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы)
	
	ПараметрДатаОтчетаГраница = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "КонецПериодаГраница");
	ПараметрДатаОтчетаГраница.Использование = Истина;

	ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
	Если ПараметрПериод.Использование И ЗначениеЗаполнено(ПараметрПериод.Значение.ДатаНачала) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоОстатки", ПараметрПериод.Значение.ДатаНачала);
		ПараметрДатаОтчетаГраница.Значение = Новый Граница(КонецДня(ПараметрПериод.Значение.ДатаОкончания), ВидГраницы.Включая);
	Иначе
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоОстатки", Дата(1,1,1,0,0,1));
		ПараметрДатаОтчетаГраница.Значение = Дата(1,1,1);
	КонецЕсли;
	// begin fix Suetin 26.11.2019 14:52:08
	ПараметрДатаОтчетаГраница = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "НачалоВремен");
	ПараметрДатаОтчетаГраница.Использование = Истина;
	ПараметрДатаОтчетаГраница.Значение = Дата(1980,1,1);
	// end fix Suetin 26.11.2019 14:53:38
КонецПроцедуры

Процедура НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроекФормы)
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		КомпоновкаДанныхСервер.УдалитьЭлементОтбораИзВсехНастроекОтчета(КомпоновщикНастроекФормы, "Контрагент");
	КонецЕсли;
КонецПроцедуры

Функция ТекстЗапроса(ВалютаОтчета)
	
	//ТекстЗапроса = "
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	Сегменты.Партнер КАК Партнер,
	//|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	//|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	//|ИЗ
	//|	РегистрСведений.ПартнерыСегмента КАК Сегменты
	//|{ГДЕ
	//|	Сегменты.Сегмент.* КАК СегментПартнеров,
	//|	Сегменты.Партнер.* КАК Партнер}
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Партнер,
	//|	ИспользуетсяОтборПоСегментуПартнеров
	//|;
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	КурсВалюты.Валюта КАК Валюта,
	//|	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК Коэффициент
	//|ПОМЕСТИТЬ КурсыВалют
	//|ИЗ
	//|	РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, ) КАК КурсВалюты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, Валюта = &Валюта) КАК КурсВалютыОтчета
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	КурсВалюты.Кратность <> 0
	//|	И КурсВалютыОтчета.Курс <> 0
	//|;
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Расчеты.Организация                                     КАК Организация,
	//|	Расчеты.Партнер                                         КАК Партнер,
	//|	Расчеты.Контрагент                                      КАК Контрагент,
	//|	Расчеты.Договор                                         КАК Договор,
	//|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	//|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	//|	Расчеты.Валюта                                          КАК Валюта,
	//|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	//|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	//|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,
	//|	
	//|	Расчеты.Номенклатура						 			КАК Номенклатура,                       // begin fix Suetin 26.11.2019 14:36:22
	//|	Расчеты.Характеристика 									КАК Характеристика,
	//|	СУММА(Расчеты.ЗапланированоКоличество)					КАК ЗапланированоКоличество,
	//|	СУММА(Расчеты.ПоставленоКоличество)						КАК ПоставленоКоличество,
	//|	СУММА(Расчеты.ОсталосьЗакупитьКоличество)				КАК ОсталосьЗакупитьКоличество,         // end fix Suetin 26.11.2019 14:36:31
	//|
	//|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	//|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	//|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	//|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	//|	
	//|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	//|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	//|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	//|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	//|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	//|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	//|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	//|	
	//|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	//|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	//|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	//|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток
	//|ИЗ (
	//|	ВЫБРАТЬ
	//|		АналитикаУчета.Организация                                     КАК Организация,
	//|		АналитикаУчета.Партнер                                         КАК Партнер,
	//|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	//|		АналитикаУчета.Договор                                         КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	//|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	//|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	//|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	//|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	//|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	//|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаНачальныйОстаток,
	//|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгНачальныйОстаток,
	//|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	//|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	//|		
	//|		0                                                              КАК Заказано,
	//|		0                                                              КАК ЗаказаноКОплате,
	//|		0                                                              КАК Поставлено,
	//|		0                                                              КАК Зачтено,
	//|		0                                                              КАК Оплачено,
	//|		0                                                              КАК СписаниеПереоценка,
	//|		0                                                              КАК Оплачивается,
	//|		
	//|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	//|		0                                                              КАК НашДолгКонечныйОстаток,
	//|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	//|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток,
	//|
	//|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)				   КАК Номенклатура,                     // begin fix Suetin 26.11.2019 14:40:06
	//|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)   КАК Характеристика,
	//|		0 															   КАК ЗапланированоКоличество,
	//|		0 															   КАК ПоставленоКоличество,
	//|		0 															   КАК ОсталосьЗакупитьКоличество        // end fix Suetin 26.11.2019 14:40:10
	//|	ИЗ
	//|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&НачалоОстатки}) КАК РасчетыПоСрокам
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|	ГДЕ
	//|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	{ГДЕ
	//|		АналитикаУчета.Организация.* КАК Организация,
	//|		АналитикаУчета.Партнер.* КАК Партнер,
	//|		АналитикаУчета.Контрагент.* КАК Контрагент,
	//|		АналитикаУчета.Договор.* КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(АналитикаУчета.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		АналитикаУчета.Организация                                     КАК Организация,
	//|		АналитикаУчета.Партнер                                         КАК Партнер,
	//|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	//|		АналитикаУчета.Договор                                         КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	//|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	//|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	//|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	//|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	//|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	//|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	//|		0                                                              КАК НашДолгНачальныйОстаток,
	//|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	//|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	//|		
	//|		0                                                              КАК Заказано,
	//|		0                                                              КАК ЗаказаноКОплате,
	//|		0                                                              КАК Поставлено,
	//|		0                                                              КАК Зачтено,
	//|		0                                                              КАК Оплачено,
	//|		0                                                              КАК СписаниеПереоценка,
	//|		0                                                              КАК Оплачивается,
	//|		
	//|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаКонечныйОстаток,
	//|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгКонечныйОстаток,
	//|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	//|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток,
	//|
	//|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)				   КАК Номенклатура,                     // begin fix Suetin 26.11.2019 14:40:06
	//|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)   КАК Характеристика,
	//|		0 															   КАК ЗапланированоКоличество,
	//|		0 															   КАК ПоставленоКоличество,
	//|		0 															   КАК ОсталосьЗакупитьКоличество        // end fix Suetin 26.11.2019 14:40:10
	//|	ИЗ
	//|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&КонецПериодаГраница}) КАК РасчетыПоСрокам
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|	ГДЕ
	//|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	{ГДЕ
	//|		АналитикаУчета.Организация.* КАК Организация,
	//|		АналитикаУчета.Партнер.* КАК Партнер,
	//|		АналитикаУчета.Контрагент.* КАК Контрагент,
	//|		АналитикаУчета.Договор.* КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(АналитикаУчета.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		АналитикаУчета.Организация                                     КАК Организация,
	//|		АналитикаУчета.Партнер                                         КАК Партнер,
	//|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	//|		АналитикаУчета.Договор                                         КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	//|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	//|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	//|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	//|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	//|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	//|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	//|		0                                                              КАК НашДолгНачальныйОстаток,
	//|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	//|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	//|		
	//|		0                                                              КАК Заказано,
	//|		0                                                              КАК ЗаказаноКОплате,
	//|		&ПоставленоПоставщиком                                         КАК Поставлено,
	//|		&ЗачтеноПоставщиком                                            КАК Зачтено,
	//|		&ОплаченоПоставщику                                            КАК Оплачено,
	//|		&СписаниеПереоценка                                            КАК СписаниеПереоценка,
	//|		0                                                              КАК Оплачивается,
	//|		
	//|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	//|		0                                                              КАК НашДолгКонечныйОстаток,
	//|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	//|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток,
	//|
	//|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)				   КАК Номенклатура,                     // begin fix Suetin 26.11.2019 14:40:06
	//|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)   КАК Характеристика,
	//|		0 															   КАК ЗапланированоКоличество,
	//|		0 															   КАК ПоставленоКоличество,
	//|		0 															   КАК ОсталосьЗакупитьКоличество        // end fix Suetin 26.11.2019 14:40:10
	//|	ИЗ
	//|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|	ГДЕ
	//|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	{ГДЕ
	//|		РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода,
	//|		АналитикаУчета.Организация.* КАК Организация,
	//|		АналитикаУчета.Партнер.* КАК Партнер,
	//|		АналитикаУчета.Контрагент.* КАК Контрагент,
	//|		АналитикаУчета.Договор.* КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(АналитикаУчета.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		КлючАналитики.Организация                КАК Организация,
	//|		КлючАналитики.Партнер                    КАК Партнер,
	//|		КлючАналитики.Контрагент                 КАК Контрагент,
	//|		КлючАналитики.Договор                    КАК Договор,
	//|		КлючАналитики.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	//|		РасчетыПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
	//|		РасчетыПланОплат.Валюта                  КАК Валюта,
	//|		РасчетыПланОплат.ДокументПлан            КАК ДокументПлан,
	//|		РасчетыПланОплат.ДатаВозникновения       КАК ДатаВозникновения,
	//|		РасчетыПланОплат.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	//|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
	//|		0                                        КАК НашДолгНачальныйОстаток,
	//|		РасчетыПланОплат.КОплатеНачальныйОстаток 
	//|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаНачальныйОстаток,
	//|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
	//|		
	//|		0                                        КАК Заказано,
	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
	//|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ                                    КАК ЗаказаноКОплате,
	//|		0                                        КАК Поставлено,
	//|		0                                        КАК Зачтено,
	//|		0                                        КАК Оплачено,
	//|		0                                        КАК СписаниеПереоценка,
	//|		0                                        КАК Оплачивается,
	//|		
	//|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
	//|		0                                        КАК НашДолгКонечныйОстаток,
	//|		РасчетыПланОплат.КОплатеКонечныйОстаток
	//|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаКонечныйОстаток,
	//|		0                                        КАК ПлановаяПоставкаКонечныйОстаток,
	//|
	//|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)				   КАК Номенклатура,                     // begin fix Suetin 26.11.2019 14:40:06
	//|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)   КАК Характеристика,
	//|		0 															   КАК ЗапланированоКоличество,
	//|		0 															   КАК ПоставленоКоличество,
	//|		0 															   КАК ОсталосьЗакупитьКоличество        // end fix Suetin 26.11.2019 14:40:10
	//|	ИЗ
	//|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОплат
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	//|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
	//|	ГДЕ
	//|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	{ГДЕ
	//|		АналитикаУчета.Организация.* КАК Организация,
	//|		АналитикаУчета.Партнер.* КАК Партнер,
	//|		АналитикаУчета.Контрагент.* КАК Контрагент,
	//|		АналитикаУчета.Договор.* КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(АналитикаУчета.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		КлючАналитики.Организация                   КАК Организация,
	//|		КлючАналитики.Партнер                       КАК Партнер,
	//|		КлючАналитики.Контрагент                    КАК Контрагент,
	//|		КлючАналитики.Договор                       КАК Договор,
	//|		КлючАналитики.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	//|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
	//|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
	//|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
	//|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
	//|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	//|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	//|		0                                           КАК НашДолгНачальныйОстаток,
	//|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	//|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
	//|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
	//|		
	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	//|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ                                       КАК Заказано,
	//|		0                                           КАК ЗаказаноКОплате,
	//|		0                                           КАК Поставлено,
	//|		0                                           КАК Зачтено,
	//|		0                                           КАК Оплачено,
	//|		0                                           КАК СписаниеПереоценка,
	//|		0                                           КАК Оплачивается,
	//|		
	//|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	//|		0                                           КАК НашДолгКонечныйОстаток,
	//|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	//|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
	//|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток,
	//|
	//|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)				   КАК Номенклатура,                     // begin fix Suetin 26.11.2019 14:40:06
	//|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)   КАК Характеристика,
	//|		0 															   КАК ЗапланированоКоличество,
	//|		0 															   КАК ПоставленоКоличество,
	//|		0 															   КАК ОсталосьЗакупитьКоличество        // end fix Suetin 26.11.2019 14:40:10
	//|	ИЗ
	//|		РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	//|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
	//|	ГДЕ
	//|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	{ГДЕ
	//|		АналитикаУчета.Организация.* КАК Организация,
	//|		АналитикаУчета.Партнер.* КАК Партнер,
	//|		АналитикаУчета.Контрагент.* КАК Контрагент,
	//|		АналитикаУчета.Договор.* КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(АналитикаУчета.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		АналитикаУчета.Организация                  КАК Организация,
	//|		АналитикаУчета.Партнер                      КАК Партнер,
	//|		АналитикаУчета.Контрагент                   КАК Контрагент,
	//|		АналитикаУчета.Договор                      КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	//|		РасчетыСПоставщиками.ЗаказПоставщику        КАК ОбъектРасчетов,
	//|		РасчетыСПоставщиками.Валюта                 КАК Валюта,
	//|		Неопределено                                КАК ДокументПлан,
	//|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаВозникновения,
	//|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПлановогоПогашения,
	//|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	//|		0                                           КАК НашДолгНачальныйОстаток,
	//|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	//|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	//|		
	//|		0                                           КАК Заказано,
	//|		0                                           КАК ЗаказаноКОплате,
	//|		0                                           КАК Поставлено,
	//|		0                                           КАК Зачтено,
	//|		0                                           КАК Оплачено,
	//|		0                                           КАК СписаниеПереоценка,
	//|		ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	//|				ТОГДА -РасчетыСПоставщиками.ОплачиваетсяОстаток
	//|			ИНАЧЕ 0 
	//|		КОНЕЦ * ЕСТЬNULL(Курсы.Коэффициент,1)       КАК Оплачивается,
	//|		
	//|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	//|		0                                           КАК НашДолгКонечныйОстаток,
	//|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	//|		0                                           КАК ПлановаяПоставкаКонечныйОстаток,
	//|
	//|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)				   КАК Номенклатура,                     // begin fix Suetin 26.11.2019 14:40:06
	//|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)   КАК Характеристика,
	//|		0 															   КАК ЗапланированоКоличество,
	//|		0 															   КАК ПоставленоКоличество,
	//|		0 															   КАК ОсталосьЗакупитьКоличество        // end fix Suetin 26.11.2019 14:40:10
	//|	ИЗ
	//|		РегистрНакопления.РасчетыСПоставщиками.Остатки({&КонецПериодаГраница}) КАК РасчетыСПоставщиками
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|				ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	//|				ПО Курсы.Валюта = РасчетыСПоставщиками.Валюта
	//|	ГДЕ
	//|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|		И РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	//|	{ГДЕ
	//|		АналитикаУчета.Организация.* КАК Организация,
	//|		АналитикаУчета.Партнер.* КАК Партнер,
	//|		АналитикаУчета.Контрагент.* КАК Контрагент,
	//|		АналитикаУчета.Договор.* КАК Договор,
	//|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(АналитикаУчета.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ    																									// begin fix Suetin 26.11.2019 14:43:11
	//|	
	//|	ВЫБРАТЬ
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Организация,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Договор,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности,
	//|		ЗаказыПоставщикам.ЗаказПоставщику,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Валюта,
	//|		ЗаказыПоставщикам.ЗаказПоставщику,
	//|		ДАТАВРЕМЯ(1, 1, 1),
	//|		ДАТАВРЕМЯ(1, 1, 1),
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		ЗаказыПоставщикам.Номенклатура,
	//|		ЗаказыПоставщикам.Характеристика,
	//|		ЗаказыПоставщикам.ЗаказаноПриход,
	//|		ЗаказыПоставщикам.ЗаказаноРасход,
	//|		ЗаказыПоставщикам.ЗаказаноКонечныйОстаток
	//|	ИЗ
	//|		РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты({(&НачалоВремен)}, {(&КонецПериодаГраница)}, , , ) КАК ЗаказыПоставщикам
	//|	ГДЕ
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	{ГДЕ
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Организация.* КАК Организация,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер.* КАК Партнер,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент.* КАК Контрагент,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.Договор.* КАК Договор,
	//|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	//|		(ЗаказыПоставщикам.ЗаказПоставщику.Партнер В
	//|				(ВЫБРАТЬ
	//|					ОтборПоСегментуПартнеров.Партнер
	//|				ИЗ
	//|					ОтборПоСегментуПартнеров
	//|				ГДЕ
	//|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}   // end fix Suetin 26.11.2019 14:43:06
	//|																															) КАК Расчеты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Расчеты.Организация,
	//|	Расчеты.Партнер,
	//|	Расчеты.Контрагент,
	//|	Расчеты.Договор,
	//|	Расчеты.НаправлениеДеятельности,
	//|	Расчеты.ОбъектРасчетов,
	//|	Расчеты.Валюта,
	//|	Расчеты.РасчетныйДокумент,
	//|	Расчеты.ДатаВозникновения,
	//|	Расчеты.ДатаПлановогоПогашения,
	//|	Расчеты.Номенклатура,
	//|	Расчеты.Характеристика
	//|ИМЕЮЩИЕ
	//|	(&ОтборыВыбранныхПолей)
	//|
	//|";
	
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Партнер КАК Партнер,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментПартнеров,
	|	Сегменты.Партнер.* КАК Партнер}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	ИспользуетсяОтборПоСегментуПартнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////       
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК Коэффициент
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, ) КАК КурсВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, Валюта = &Валюта) КАК КурсВалютыОтчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КурсВалюты.Кратность <> 0
	|	И КурсВалютыОтчета.Курс <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////        // begin fix Suetin 26.11.2019 16:25:26
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,

	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток
	|ПОМЕСТИТЬ РасчетыПредварительная
	|ИЗ (

	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&НачалоОстатки}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&КонецПериодаГраница}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		&ПоставленоПоставщиком                                         КАК Поставлено,
	|		&ЗачтеноПоставщиком                                            КАК Зачтено,
	|		&ОплаченоПоставщику                                            КАК Оплачено,
	|		&СписаниеПереоценка                                            КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода,
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                КАК Организация,
	|		КлючАналитики.Партнер                    КАК Партнер,
	|		КлючАналитики.Контрагент                 КАК Контрагент,
	|		КлючАналитики.Договор                    КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		РасчетыПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОплат.Валюта                  КАК Валюта,
	|		РасчетыПланОплат.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОплат.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОплат.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                        КАК НашДолгНачальныйОстаток,
	|		РасчетыПланОплат.КОплатеНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                        КАК Заказано,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                    КАК ЗаказаноКОплате,
	|		0                                        КАК Поставлено,
	|		0                                        КАК Зачтено,
	|		0                                        КАК Оплачено,
	|		0                                        КАК СписаниеПереоценка,
	|		0                                        КАК Оплачивается,
	|		
	|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                        КАК НашДолгКонечныйОстаток,
	|		РасчетыПланОплат.КОплатеКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                        КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОплат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                   КАК Организация,
	|		КлючАналитики.Партнер                       КАК Партнер,
	|		КлючАналитики.Контрагент                    КАК Контрагент,
	|		КлючАналитики.Договор                       КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
	|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                       КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                  КАК Организация,
	|		АналитикаУчета.Партнер                      КАК Партнер,
	|		АналитикаУчета.Контрагент                   КАК Контрагент,
	|		АналитикаУчета.Договор                      КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|		РасчетыСПоставщиками.ЗаказПоставщику        КАК ОбъектРасчетов,
	|		РасчетыСПоставщиками.Валюта                 КАК Валюта,
	|		Неопределено                                КАК ДокументПлан,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаВозникновения,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                           КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|				ТОГДА -РасчетыСПоставщиками.ОплачиваетсяОстаток
	|			ИНАЧЕ 0 
	|		КОНЕЦ * ЕСТЬNULL(Курсы.Коэффициент,1)       КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки({&КонецПериодаГраница}) КАК РасчетыСПоставщиками
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыСПоставщиками.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолейБезКоличественныхПолей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПоставщику) 
	//|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказНаПроизводство
	//|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказНаПроизводство)
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПереработчику)
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказДавальца)
	|       ИНАЧЕ ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПоставщику) 
	|	КОНЕЦ                   КАК ОбъектРасчетов
	|ПОМЕСТИТЬ РасчетыПредварительнаяСвернутая
	|ИЗ
	|		РасчетыПредварительная КАК РасчетыПредварительная
	|ГДЕ
	|	ВЫБОР
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ИСТИНА
	//|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказНаПроизводство
	//|			ТОГДА ИСТИНА
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|			ТОГДА ИСТИНА
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|			ТОГДА ИСТИНА
	|       ИНАЧЕ ЛОЖЬ 
	|	КОНЕЦ
	|{ГДЕ
	|		РасчетыПредварительная.Организация.* КАК Организация,
	|		РасчетыПредварительная.Партнер.* КАК Партнер,
	|		РасчетыПредварительная.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная.Договор.* КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////     // end fix Suetin 26.11.2019 16:25:17
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,
	|	
	|	Расчеты.Номенклатура						 			КАК Номенклатура,                       // begin fix Suetin 26.11.2019 14:36:22
	|	Расчеты.Характеристика 									КАК Характеристика,
	|	СУММА(Расчеты.ЗапланированоКоличество)					КАК ЗапланированоКоличество,
	|	СУММА(Расчеты.ПоставленоКоличество)						КАК ПоставленоКоличество,
	|	СУММА(Расчеты.ОсталосьЗакупитьКоличество)				КАК ОсталосьЗакупитьКоличество,         // end fix Suetin 26.11.2019 14:36:31
	|
	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток
	|ИЗ (
	|	ВЫБРАТЬ
	|		РасчетыПредварительная.Организация КАК Организация,
	|		РасчетыПредварительная.Партнер КАК Партнер,
	|		РасчетыПредварительная.Контрагент КАК Контрагент,
	|		РасчетыПредварительная.Договор КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		РасчетыПредварительная.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПредварительная.Валюта КАК Валюта,
	|		РасчетыПредварительная.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыПредварительная.ДатаВозникновения КАК ДатаВозникновения,
	|		РасчетыПредварительная.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|		РасчетыПредварительная.ДолгПоставщикаНачальныйОстаток КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПредварительная.НашДолгНачальныйОстаток КАК НашДолгНачальныйОстаток,
	|		РасчетыПредварительная.ПлановаяОплатаНачальныйОстаток КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПредварительная.ПлановаяПоставкаНачальныйОстаток КАК ПлановаяПоставкаНачальныйОстаток,
	|		РасчетыПредварительная.Заказано КАК Заказано,
	|		РасчетыПредварительная.ЗаказаноКОплате КАК ЗаказаноКОплате,
	|		РасчетыПредварительная.Поставлено КАК Поставлено,
	|		РасчетыПредварительная.Зачтено КАК Зачтено,
	|		РасчетыПредварительная.Оплачено КАК Оплачено,
	|		РасчетыПредварительная.СписаниеПереоценка КАК СписаниеПереоценка,
	|		РасчетыПредварительная.Оплачивается КАК Оплачивается,
	|		РасчетыПредварительная.ДолгПоставщикаКонечныйОстаток КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПредварительная.НашДолгКонечныйОстаток КАК НашДолгКонечныйОстаток,
	|		РасчетыПредварительная.ПлановаяОплатаКонечныйОстаток КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПредварительная.ПлановаяПоставкаКонечныйОстаток КАК ПлановаяПоставкаКонечныйОстаток,
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		0 КАК ЗапланированоКоличество,
	|		0 КАК ПоставленоКоличество,
	|		0 КАК ОсталосьЗакупитьКоличество
	|	ИЗ
	|		РасчетыПредварительная КАК РасчетыПредварительная
	|	{ГДЕ
	|		РасчетыПредварительная.Организация.* КАК Организация,
	|		РасчетыПредварительная.Партнер.* КАК Партнер,
	|		РасчетыПредварительная.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная.Договор.* КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ    																									// begin fix Suetin 26.11.2019 14:43:11
	|	
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Организация,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Договор,
	|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности,
	|		ЗаказыПоставщикам.ЗаказПоставщику,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Валюта,
	|		ЗаказыПоставщикам.ЗаказПоставщику,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаказыПоставщикам.Номенклатура,
	|		ЗаказыПоставщикам.Характеристика,
	|		ЗаказыПоставщикам.ЗаказаноПриход,
	|		ЗаказыПоставщикам.ЗаказаноРасход,
	|		ЗаказыПоставщикам.ЗаказаноКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты({(&НачалоВремен)}, {(&КонецПериодаГраница)}	//, , , ЗаказПоставщику В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					Т.ОбъектРасчетов
	//|				ИЗ
	//|					РасчетыПредварительная КАК Т)
	|																										) КАК ЗаказыПоставщикам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредварительнаяСвернутая КАК РасчетыПредварительнаяСвернутая
	|            	ПО ЗаказыПоставщикам.ЗаказПоставщику = РасчетыПредварительнаяСвернутая.ОбъектРасчетов
	|	ГДЕ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Организация.* КАК Организация,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер.* КАК Партнер,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент.* КАК Контрагент,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Договор.* КАК Договор,
	|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(ЗаказыПоставщикам.ЗаказПоставщику.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)),
	|		(ЗаказыПоставщикам.ЗаказПоставщику В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Т.ОбъектРасчетов
	|				ИЗ
	|					РасчетыПредварительная КАК Т))}   // end fix Suetin 26.11.2019 14:43:06
	|																															) КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.Номенклатура,
	|	Расчеты.Характеристика
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолей)
	|
	|";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Партнер КАК Партнер,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментПартнеров,
	|	Сегменты.Партнер.* КАК Партнер}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	ИспользуетсяОтборПоСегментуПартнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////       
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК Коэффициент
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, ) КАК КурсВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, Валюта = &Валюта) КАК КурсВалютыОтчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КурсВалюты.Кратность <> 0
	|	И КурсВалютыОтчета.Курс <> 0
	|;
	// begin fix Suetin 30.04.2021 13:40:37
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения	,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,

	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток
	|ПОМЕСТИТЬ РасчетыПредПредварительная
	|ИЗ (

	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения	,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&НачалоОстатки}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения	,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&КонецПериодаГраница}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения	,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		&ПоставленоПоставщиком                                         КАК Поставлено,
	|		&ЗачтеноПоставщиком                                            КАК Зачтено,
	|		&ОплаченоПоставщику                                            КАК Оплачено,
	|		&СписаниеПереоценка                                            КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода,
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                КАК Организация,
	|		КлючАналитики.Партнер                    КАК Партнер,
	|		КлючАналитики.Контрагент                 КАК Контрагент,
	|		КлючАналитики.Договор                    КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		РасчетыПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОплат.Валюта                  КАК Валюта,
	|		РасчетыПланОплат.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОплат.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОплат.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения	,
	|		РасчетыПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                        КАК НашДолгНачальныйОстаток,
	|		РасчетыПланОплат.КОплатеНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                        КАК Заказано,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                    КАК ЗаказаноКОплате,
	|		0                                        КАК Поставлено,
	|		0                                        КАК Зачтено,
	|		0                                        КАК Оплачено,
	|		0                                        КАК СписаниеПереоценка,
	|		0                                        КАК Оплачивается,
	|		
	|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                        КАК НашДолгКонечныйОстаток,
	|		РасчетыПланОплат.КОплатеКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                        КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОплат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                   КАК Организация,
	|		КлючАналитики.Партнер                       КАК Партнер,
	|		КлючАналитики.Контрагент                    КАК Контрагент,
	|		КлючАналитики.Договор                       КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
	|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения	,
	|		РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
	|
	// begin fix Suetin 30.04.2021 12:40:27 ЗАМЕНА!
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                       КАК Заказано,
	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузокОбороты.ДокументПлан) В (&ТипыДокументовПлана)
	//|				ТОГДА РасчетыПланОтгрузокОбороты.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ                                       КАК Заказано,
	// end fix Suetin 30.04.2021 12:40:44
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//// begin fix Suetin 30.04.2021 12:38:27
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты({&НачалоВремен}, {&КонецПериода}) КАК РасчетыПланОтгрузокОбороты
	//|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам 	= РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам
	//|					И РасчетыПланОтгрузок.ОбъектРасчетов 			= РасчетыПланОтгрузокОбороты.ОбъектРасчетов
	//|					И РасчетыПланОтгрузок.Валюта 					= РасчетыПланОтгрузокОбороты.Валюта
	//|					И РасчетыПланОтгрузок.ДокументПлан 				= РасчетыПланОтгрузокОбороты.ДокументПлан
	//|					И РасчетыПланОтгрузок.ДатаПлановогоПогашения 	= РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения
	//|					И РасчетыПланОтгрузок.ДатаВозникновения 		= РасчетыПланОтгрузокОбороты.ДатаВозникновения
	//// end fix Suetin 30.04.2021 12:38:32
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                  КАК Организация,
	|		АналитикаУчета.Партнер                      КАК Партнер,
	|		АналитикаУчета.Контрагент                   КАК Контрагент,
	|		АналитикаУчета.Договор                      КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|		РасчетыСПоставщиками.ЗаказПоставщику        КАК ОбъектРасчетов,
	|		РасчетыСПоставщиками.Валюта                 КАК Валюта,
	|		Неопределено                                КАК ДокументПлан,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаВозникновения,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПлановогоПогашения	,
	
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                           КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|				ТОГДА -РасчетыСПоставщиками.ОплачиваетсяОстаток
	|			ИНАЧЕ 0 
	|		КОНЕЦ * ЕСТЬNULL(Курсы.Коэффициент,1)       КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки({&КонецПериодаГраница}) КАК РасчетыСПоставщиками
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыСПоставщиками.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолейБезКоличественныхПолей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|
	
	|	ВЫБРАТЬ
	|		РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам.Организация                   КАК Организация,
	|		РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам.Партнер                       КАК Партнер,
	|		РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам.Контрагент                    КАК Контрагент,
	|		РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам.Договор                       КАК Договор,
	|		РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПланОтгрузокОбороты.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОтгрузокОбороты.Валюта                  КАК Валюта,
	|		РасчетыПланОтгрузокОбороты.ДокументПлан            КАК РасчетныйДокумент,   
	|		РасчетыПланОтгрузокОбороты.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	|
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузокОбороты.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОтгрузокОбороты.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                       КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	|поместить РасчетыПредПредварительная5
	|	ИЗ
	//|		РасчетыПредПредварительная КАК РасчетыПредПредварительная
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	//|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	//|					И РасчетыПланОтгрузок.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	//|					И РасчетыПланОтгрузок.Валюта 					= РасчетыПредПредварительная.Валюта
	//|					И РасчетыПланОтгрузок.ДокументПлан		 		= РасчетыПредПредварительная.РасчетныйДокумент
	////|					И РасчетыПланОтгрузок.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	////|					И РасчетыПланОтгрузок.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	// // begin fix Suetin 30.04.2021 12:38:27
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты(&НачалоВремен{&НачалоВремен}, {&КонецПериода},
	//|           РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты(&НачалоВремен{&НачалоВремен}, &КонецПериода{&КонецПериода},,,
	|           РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты(&НачалоВремен {(&НачалоВремен)}, &КонецПериода {(&КонецПериода)}, , 
	|           	(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ДокументПлан) В(выбрать Т.АналитикаУчетаПоПартнерам, Т.ОбъектРасчетов, Т.Валюта, Т.РасчетныйДокумент из РасчетыПредПредварительная как т)
	|
	|																				) КАК РасчетыПланОтгрузокОбороты
	//|				ПО РасчетыПредПредварительная.АналитикаУчетаПоПартнерам 	= РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам
	//|					И РасчетыПредПредварительная.ОбъектРасчетов 			= РасчетыПланОтгрузокОбороты.ОбъектРасчетов
	//|					И РасчетыПредПредварительная.Валюта 					= РасчетыПланОтгрузокОбороты.Валюта
	//|					И РасчетыПредПредварительная.РасчетныйДокумент			= РасчетыПланОтгрузокОбороты.ДокументПлан
	////|					И РасчетыПредПредварительная.ДатаПлановогоПогашения 	= РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения   &НачалоВремен{&НачалоВремен}
	////|					И РасчетыПредПредварительная.ДатаВозникновения 			= РасчетыПланОтгрузокОбороты.ДатаВозникновения        &КонецПериода{&КонецПериода}
	//// end fix Suetin 30.04.2021 12:38:32
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОтгрузокОбороты.Валюта
	|;
	
	// end fix Suetin 30.04.2021 13:40:41
	|
	|////////////////////////////////////////////////////////////////////////////////        // begin fix Suetin 26.11.2019 16:25:26
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,

	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток
	|ПОМЕСТИТЬ РасчетыПредварительная
	|ИЗ (

//	|	ВЫБРАТЬ
//	|		АналитикаУчета.Организация                                     КАК Организация,
//	|		АналитикаУчета.Партнер                                         КАК Партнер,
//	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
//	|		АналитикаУчета.Договор                                         КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
//	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
//	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
//	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
//	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
//	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
//	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаНачальныйОстаток,
//	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгНачальныйОстаток,
//	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
//	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
//	|		
//	|		0                                                              КАК Заказано,
//	|		0                                                              КАК ЗаказаноКОплате,
//	|		0                                                              КАК Поставлено,
//	|		0                                                              КАК Зачтено,
//	|		0                                                              КАК Оплачено,
//	|		0                                                              КАК СписаниеПереоценка,
//	|		0                                                              КАК Оплачивается,
//	|		
//	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
//	|		0                                                              КАК НашДолгКонечныйОстаток,
//	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
//	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток

//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&НачалоОстатки}) КАК РасчетыПоСрокам
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
//	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
//	|	ГДЕ
//	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	{ГДЕ
//	|		АналитикаУчета.Организация.* КАК Организация,
//	|		АналитикаУчета.Партнер.* КАК Партнер,
//	|		АналитикаУчета.Контрагент.* КАК Контрагент,
//	|		АналитикаУчета.Договор.* КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
//	|		(АналитикаУчета.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		АналитикаУчета.Организация                                     КАК Организация,
//	|		АналитикаУчета.Партнер                                         КАК Партнер,
//	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
//	|		АналитикаУчета.Договор                                         КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
//	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
//	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
//	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
//	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
//	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
//	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
//	|		0                                                              КАК НашДолгНачальныйОстаток,
//	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
//	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
//	|		
//	|		0                                                              КАК Заказано,
//	|		0                                                              КАК ЗаказаноКОплате,
//	|		0                                                              КАК Поставлено,
//	|		0                                                              КАК Зачтено,
//	|		0                                                              КАК Оплачено,
//	|		0                                                              КАК СписаниеПереоценка,
//	|		0                                                              КАК Оплачивается,
//	|		
//	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаКонечныйОстаток,
//	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгКонечныйОстаток,
//	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
//	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&КонецПериодаГраница}) КАК РасчетыПоСрокам
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
//	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
//	|	ГДЕ
//	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	{ГДЕ
//	|		АналитикаУчета.Организация.* КАК Организация,
//	|		АналитикаУчета.Партнер.* КАК Партнер,
//	|		АналитикаУчета.Контрагент.* КАК Контрагент,
//	|		АналитикаУчета.Договор.* КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
//	|		(АналитикаУчета.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		АналитикаУчета.Организация                                     КАК Организация,
//	|		АналитикаУчета.Партнер                                         КАК Партнер,
//	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
//	|		АналитикаУчета.Договор                                         КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
//	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
//	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
//	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
//	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
//	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
//	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
//	|		0                                                              КАК НашДолгНачальныйОстаток,
//	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
//	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
//	|		
//	|		0                                                              КАК Заказано,
//	|		0                                                              КАК ЗаказаноКОплате,
//	|		&ПоставленоПоставщиком                                         КАК Поставлено,
//	|		&ЗачтеноПоставщиком                                            КАК Зачтено,
//	|		&ОплаченоПоставщику                                            КАК Оплачено,
//	|		&СписаниеПереоценка                                            КАК СписаниеПереоценка,
//	|		0                                                              КАК Оплачивается,
//	|		
//	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
//	|		0                                                              КАК НашДолгКонечныйОстаток,
//	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
//	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
//	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
//	|	ГДЕ
//	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	{ГДЕ
//	|		РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода,
//	|		АналитикаУчета.Организация.* КАК Организация,
//	|		АналитикаУчета.Партнер.* КАК Партнер,
//	|		АналитикаУчета.Контрагент.* КАК Контрагент,
//	|		АналитикаУчета.Договор.* КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
//	|		(АналитикаУчета.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		КлючАналитики.Организация                КАК Организация,
//	|		КлючАналитики.Партнер                    КАК Партнер,
//	|		КлючАналитики.Контрагент                 КАК Контрагент,
//	|		КлючАналитики.Договор                    КАК Договор,
//	|		КлючАналитики.НаправлениеДеятельности    КАК НаправлениеДеятельности,
//	|		РасчетыПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
//	|		РасчетыПланОплат.Валюта                  КАК Валюта,
//	|		РасчетыПланОплат.ДокументПлан            КАК ДокументПлан,
//	|		РасчетыПланОплат.ДатаВозникновения       КАК ДатаВозникновения,
//	|		РасчетыПланОплат.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
//	|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
//	|		0                                        КАК НашДолгНачальныйОстаток,
//	|		РасчетыПланОплат.КОплатеНачальныйОстаток 
//	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаНачальныйОстаток,
//	|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
//	|		
//	|		0                                        КАК Заказано,
//	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
//	|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
//	|			ИНАЧЕ 0
//	|		КОНЕЦ                                    КАК ЗаказаноКОплате,
//	|		0                                        КАК Поставлено,
//	|		0                                        КАК Зачтено,
//	|		0                                        КАК Оплачено,
//	|		0                                        КАК СписаниеПереоценка,
//	|		0                                        КАК Оплачивается,
//	|		
//	|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
//	|		0                                        КАК НашДолгКонечныйОстаток,
//	|		РасчетыПланОплат.КОплатеКонечныйОстаток
//	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаКонечныйОстаток,
//	|		0                                        КАК ПлановаяПоставкаКонечныйОстаток
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОплат
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
//	|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
//	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
//	|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
//	|	ГДЕ
//	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	{ГДЕ
//	|		АналитикаУчета.Организация.* КАК Организация,
//	|		АналитикаУчета.Партнер.* КАК Партнер,
//	|		АналитикаУчета.Контрагент.* КАК Контрагент,
//	|		АналитикаУчета.Договор.* КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
//	|		(АналитикаУчета.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		КлючАналитики.Организация                   КАК Организация,
//	|		КлючАналитики.Партнер                       КАК Партнер,
//	|		КлючАналитики.Контрагент                    КАК Контрагент,
//	|		КлючАналитики.Договор                       КАК Договор,
//	|		КлючАналитики.НаправлениеДеятельности       КАК НаправлениеДеятельности,
//	|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
//	|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
//	|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
//	|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
//	|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
//	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
//	|		0                                           КАК НашДолгНачальныйОстаток,
//	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
//	|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
//	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
//	|
//	// begin fix Suetin 30.04.2021 12:40:27 ЗАМЕНА!
//	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
//	//|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
//	//|			ИНАЧЕ 0
//	//|		КОНЕЦ                                       КАК Заказано,
//	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузокОбороты.ДокументПлан) В (&ТипыДокументовПлана)
//	|				ТОГДА РасчетыПланОтгрузокОбороты.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
//	|			ИНАЧЕ 0
//	|		КОНЕЦ                                       КАК Заказано,
//	// end fix Suetin 30.04.2021 12:40:44
//	|		0                                           КАК ЗаказаноКОплате,
//	|		0                                           КАК Поставлено,
//	|		0                                           КАК Зачтено,
//	|		0                                           КАК Оплачено,
//	|		0                                           КАК СписаниеПереоценка,
//	|		0                                           КАК Оплачивается,
//	|		
//	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
//	|		0                                           КАК НашДолгКонечныйОстаток,
//	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
//	|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
//	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
//	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
//	 // begin fix Suetin 30.04.2021 12:38:27
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты({&НачалоВремен}, {&КонецПериода}) КАК РасчетыПланОтгрузокОбороты
//	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам 	= РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам
//	|					И РасчетыПланОтгрузок.ОбъектРасчетов 			= РасчетыПланОтгрузокОбороты.ОбъектРасчетов
//	|					И РасчетыПланОтгрузок.Валюта 					= РасчетыПланОтгрузокОбороты.Валюта
//	|					И РасчетыПланОтгрузок.ДокументПлан 				= РасчетыПланОтгрузокОбороты.ДокументПлан
//	|					И РасчетыПланОтгрузок.ДатаПлановогоПогашения 	= РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения
//	|					И РасчетыПланОтгрузок.ДатаВозникновения 		= РасчетыПланОтгрузокОбороты.ДатаВозникновения
//	// end fix Suetin 30.04.2021 12:38:32
//	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
//	|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
//	|	ГДЕ
//	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	{ГДЕ
//	|		АналитикаУчета.Организация.* КАК Организация,
//	|		АналитикаУчета.Партнер.* КАК Партнер,
//	|		АналитикаУчета.Контрагент.* КАК Контрагент,
//	|		АналитикаУчета.Договор.* КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
//	|		(АналитикаУчета.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		АналитикаУчета.Организация                  КАК Организация,
//	|		АналитикаУчета.Партнер                      КАК Партнер,
//	|		АналитикаУчета.Контрагент                   КАК Контрагент,
//	|		АналитикаУчета.Договор                      КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
//	|		РасчетыСПоставщиками.ЗаказПоставщику        КАК ОбъектРасчетов,
//	|		РасчетыСПоставщиками.Валюта                 КАК Валюта,
//	|		Неопределено                                КАК ДокументПлан,
//	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаВозникновения,
//	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПлановогоПогашения,
//	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
//	|		0                                           КАК НашДолгНачальныйОстаток,
//	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
//	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
//	|		
//	|		0                                           КАК Заказано,
//	|		0                                           КАК ЗаказаноКОплате,
//	|		0                                           КАК Поставлено,
//	|		0                                           КАК Зачтено,
//	|		0                                           КАК Оплачено,
//	|		0                                           КАК СписаниеПереоценка,
//	|		ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
//	|				ТОГДА -РасчетыСПоставщиками.ОплачиваетсяОстаток
//	|			ИНАЧЕ 0 
//	|		КОНЕЦ * ЕСТЬNULL(Курсы.Коэффициент,1)       КАК Оплачивается,
//	|		
//	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
//	|		0                                           КАК НашДолгКонечныйОстаток,
//	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
//	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщиками.Остатки({&КонецПериодаГраница}) КАК РасчетыСПоставщиками
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
//	|				ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
//	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
//	|				ПО Курсы.Валюта = РасчетыСПоставщиками.Валюта
//	|	ГДЕ
//	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|		И РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
//	|	{ГДЕ
//	|		АналитикаУчета.Организация.* КАК Организация,
//	|		АналитикаУчета.Партнер.* КАК Партнер,
//	|		АналитикаУчета.Контрагент.* КАК Контрагент,
//	|		АналитикаУчета.Договор.* КАК Договор,
//	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
//	|		(АналитикаУчета.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
// begin fix Suetin 30.04.2021 13:48:02

	|	ВЫБРАТЬ
	|		РасчетыПредПредварительная.Организация                                     КАК Организация,
	|		РасчетыПредПредварительная.Партнер                                         КАК Партнер,
	|		РасчетыПредПредварительная.Контрагент                                      КАК Контрагент,
	|		РасчетыПредПредварительная.Договор                                         КАК Договор,
	|		РасчетыПредПредварительная.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная.Валюта                                         КАК Валюта,
	|		РасчетыПредПредварительная.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПредПредварительная.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПредПредварительная.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&НачалоОстатки}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредПредварительная КАК РасчетыПредПредварительная
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	|					И РасчетыПоСрокам.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	|					И РасчетыПоСрокам.Валюта 					= РасчетыПредПредварительная.Валюта
	|					И РасчетыПоСрокам.РасчетныйДокумент 		= РасчетыПредПредварительная.РасчетныйДокумент
	|					И РасчетыПоСрокам.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	|					И РасчетыПоСрокам.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПредПредварительная.Организация                                     КАК Организация,
	|		РасчетыПредПредварительная.Партнер                                         КАК Партнер,
	|		РасчетыПредПредварительная.Контрагент                                      КАК Контрагент,
	|		РасчетыПредПредварительная.Договор                                         КАК Договор,
	|		РасчетыПредПредварительная.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная.Валюта                                         КАК Валюта,
	|		РасчетыПредПредварительная.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПредПредварительная.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПредПредварительная.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&КонецПериодаГраница}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредПредварительная КАК РасчетыПредПредварительная
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	|					И РасчетыПоСрокам.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	|					И РасчетыПоСрокам.Валюта 					= РасчетыПредПредварительная.Валюта
	|					И РасчетыПоСрокам.РасчетныйДокумент 		= РасчетыПредПредварительная.РасчетныйДокумент
	|					И РасчетыПоСрокам.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	|					И РасчетыПоСрокам.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПредПредварительная.Организация                                     КАК Организация,
	|		РасчетыПредПредварительная.Партнер                                         КАК Партнер,
	|		РасчетыПредПредварительная.Контрагент                                      КАК Контрагент,
	|		РасчетыПредПредварительная.Договор                                         КАК Договор,
	|		РасчетыПредПредварительная.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная.Валюта                                         КАК Валюта,
	|		РасчетыПредПредварительная.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПредПредварительная.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПредПредварительная.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		&ПоставленоПоставщиком                                         КАК Поставлено,
	|		&ЗачтеноПоставщиком                                            КАК Зачтено,
	|		&ОплаченоПоставщику                                            КАК Оплачено,
	|		&СписаниеПереоценка                                            КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредПредварительная КАК РасчетыПредПредварительная
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	|					И РасчетыПоСрокам.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	|					И РасчетыПоСрокам.Валюта 					= РасчетыПредПредварительная.Валюта
	|					И РасчетыПоСрокам.РасчетныйДокумент 		= РасчетыПредПредварительная.РасчетныйДокумент
	|					И РасчетыПоСрокам.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	|					И РасчетыПоСрокам.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	|	{ГДЕ
	|		РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода}     //НачалоВремен <- НачалоПериода
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПредПредварительная.Организация                КАК Организация,
	|		РасчетыПредПредварительная.Партнер                    КАК Партнер,
	|		РасчетыПредПредварительная.Контрагент                 КАК Контрагент,
	|		РасчетыПредПредварительная.Договор                    КАК Договор,
	|		РасчетыПредПредварительная.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная.Валюта                  КАК Валюта,
	|		РасчетыПредПредварительная.РасчетныйДокумент            КАК ДокументПлан,
	|		РасчетыПредПредварительная.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПредПредварительная.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                        КАК НашДолгНачальныйОстаток,
	|		РасчетыПланОплат.КОплатеНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                        КАК Заказано,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                    КАК ЗаказаноКОплате,
	|		0                                        КАК Поставлено,
	|		0                                        КАК Зачтено,
	|		0                                        КАК Оплачено,
	|		0                                        КАК СписаниеПереоценка,
	|		0                                        КАК Оплачивается,
	|		
	|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                        КАК НашДолгКонечныйОстаток,
	|		РасчетыПланОплат.КОплатеКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                        КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОплат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредПредварительная КАК РасчетыПредПредварительная
	|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	|					И РасчетыПланОплат.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	|					И РасчетыПланОплат.Валюта 					= РасчетыПредПредварительная.Валюта
	|					И РасчетыПланОплат.ДокументПлан		 		= РасчетыПредПредварительная.РасчетныйДокумент
	|					И РасчетыПланОплат.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	|					И РасчетыПланОплат.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПредПредварительная.Организация                   КАК Организация,
	|		РасчетыПредПредварительная.Партнер                       КАК Партнер,
	|		РасчетыПредПредварительная.Контрагент                    КАК Контрагент,
	|		РасчетыПредПредварительная.Договор                       КАК Договор,
	|		РасчетыПредПредварительная.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная.Валюта                  КАК Валюта,
	|		РасчетыПредПредварительная.РасчетныйДокумент            КАК ДокументПлан,
	//|		ЕСТЬNULL(РасчетыПланОтгрузок.ДатаВозникновения, РасчетыПланОтгрузокОбороты.ДатаВозникновения)       КАК ДатаВозникновения,
	//|		ЕСТЬNULL(РасчетыПланОтгрузок.ДатаПлановогоПогашения, РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения)  КАК ДатаПлановогоПогашения,
	|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
	|
	// begin fix Suetin 30.04.2021 12:40:27 ЗАМЕНА!
	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	//|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ                                       КАК Заказано,
	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузокОбороты.ДокументПлан) В (&ТипыДокументовПлана)
	//|				ТОГДА РасчетыПланОтгрузокОбороты.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ                                       КАК Заказано,
	|		0											КАК Заказано,
	// end fix Suetin 30.04.2021 12:40:44
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РасчетыПредПредварительная КАК РасчетыПредПредварительная
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	|					И РасчетыПланОтгрузок.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	|					И РасчетыПланОтгрузок.Валюта 					= РасчетыПредПредварительная.Валюта
	|					И РасчетыПланОтгрузок.ДокументПлан		 		= РасчетыПредПредварительная.РасчетныйДокумент
	//|					И РасчетыПланОтгрузок.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	//|					И РасчетыПланОтгрузок.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	 // begin fix Suetin 30.04.2021 12:38:27
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты(&НачалоВремен{&НачалоВремен}, {&КонецПериода}) КАК РасчетыПланОтгрузокОбороты
	//|				ПО РасчетыПредПредварительная.АналитикаУчетаПоПартнерам 	= РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам
	//|					И РасчетыПредПредварительная.ОбъектРасчетов 			= РасчетыПланОтгрузокОбороты.ОбъектРасчетов
	//|					И РасчетыПредПредварительная.Валюта 					= РасчетыПланОтгрузокОбороты.Валюта
	//|					И РасчетыПредПредварительная.РасчетныйДокумент			= РасчетыПланОтгрузокОбороты.ДокументПлан
	////|					И РасчетыПредПредварительная.ДатаПлановогоПогашения 	= РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения
	////|					И РасчетыПредПредварительная.ДатаВозникновения 			= РасчетыПланОтгрузокОбороты.ДатаВозникновения
	//// end fix Suetin 30.04.2021 12:38:32
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
	|
	
		|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	//|	ВЫБРАТЬ
	//|		РасчетыПредПредварительная.Организация                   КАК Организация,
	//|		РасчетыПредПредварительная.Партнер                       КАК Партнер,
	//|		РасчетыПредПредварительная.Контрагент                    КАК Контрагент,
	//|		РасчетыПредПредварительная.Договор                       КАК Договор,
	//|		РасчетыПредПредварительная.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	//|		РасчетыПредПредварительная.ОбъектРасчетов          КАК ОбъектРасчетов,
	//|		РасчетыПредПредварительная.Валюта                  КАК Валюта,
	//|		РасчетыПредПредварительная.РасчетныйДокумент            КАК ДокументПлан,   
	////|		РасчетыПланОтгрузокОбороты.ДокументПлан            КАК ДокументПлан,
	////|		ЕСТЬNULL(РасчетыПланОтгрузок.ДатаВозникновения, РасчетыПланОтгрузокОбороты.ДатаВозникновения)       КАК ДатаВозникновения,
	////|		ЕСТЬNULL(РасчетыПланОтгрузок.ДатаПлановогоПогашения, РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения)  КАК ДатаПлановогоПогашения,
	//|		РасчетыПланОтгрузокОбороты.ДатаВозникновения       КАК ДатаВозникновения,
	//|		РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	//|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	//|		0                                           КАК НашДолгНачальныйОстаток,
	//|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	////|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
	////|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
	//|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	//|
	//// begin fix Suetin 30.04.2021 12:40:27 ЗАМЕНА!
	////|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	////|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	////|			ИНАЧЕ 0
	////|		КОНЕЦ                                       КАК Заказано,
	//|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузокОбороты.ДокументПлан) В (&ТипыДокументовПлана)
	//|				ТОГДА РасчетыПланОтгрузокОбороты.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ                                       КАК Заказано,
	////|		РасчетыПланОтгрузокОбороты.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1) КАК Заказано,
	//// end fix Suetin 30.04.2021 12:40:44
	//|		0                                           КАК ЗаказаноКОплате,
	//|		0                                           КАК Поставлено,
	//|		0                                           КАК Зачтено,
	//|		0                                           КАК Оплачено,
	//|		0                                           КАК СписаниеПереоценка,
	//|		0                                           КАК Оплачивается,
	//|		
	//|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	//|		0                                           КАК НашДолгКонечныйОстаток,
	//|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	////|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
	////|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток
	//|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	//|	ИЗ
	//|		РасчетыПредПредварительная КАК РасчетыПредПредварительная
	////|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	////|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	////|					И РасчетыПланОтгрузок.ОбъектРасчетов 			= РасчетыПредПредварительная.ОбъектРасчетов
	////|					И РасчетыПланОтгрузок.Валюта 					= РасчетыПредПредварительная.Валюта
	////|					И РасчетыПланОтгрузок.ДокументПлан		 		= РасчетыПредПредварительная.РасчетныйДокумент
	//////|					И РасчетыПланОтгрузок.ДатаПлановогоПогашения 	= РасчетыПредПредварительная.ДатаПлановогоПогашения
	//////|					И РасчетыПланОтгрузок.ДатаВозникновения 		= РасчетыПредПредварительная.ДатаВозникновения
	//// // begin fix Suetin 30.04.2021 12:38:27
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты(&НачалоВремен{&НачалоВремен}, {&КонецПериода}) КАК РасчетыПланОтгрузокОбороты
	//|				ПО РасчетыПредПредварительная.АналитикаУчетаПоПартнерам 	= РасчетыПланОтгрузокОбороты.АналитикаУчетаПоПартнерам
	//|					И РасчетыПредПредварительная.ОбъектРасчетов 			= РасчетыПланОтгрузокОбороты.ОбъектРасчетов
	//|					И РасчетыПредПредварительная.Валюта 					= РасчетыПланОтгрузокОбороты.Валюта
	//|					И РасчетыПредПредварительная.РасчетныйДокумент			= РасчетыПланОтгрузокОбороты.ДокументПлан
	////|					И РасчетыПредПредварительная.ДатаПлановогоПогашения 	= РасчетыПланОтгрузокОбороты.ДатаПлановогоПогашения   &НачалоВремен{&НачалоВремен}
	////|					И РасчетыПредПредварительная.ДатаВозникновения 			= РасчетыПланОтгрузокОбороты.ДатаВозникновения        &КонецПериода{&КонецПериода}
	//// end fix Suetin 30.04.2021 12:38:32
	//|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	//|				ПО Курсы.Валюта = РасчетыПланОтгрузокОбороты.Валюта
	|	
	
	|	ВЫБРАТЬ 
	|		РасчетыПредПредварительная5.Организация                   КАК Организация,
	|		РасчетыПредПредварительная5.Партнер                       КАК Партнер,
	|		РасчетыПредПредварительная5.Контрагент                    КАК Контрагент,
	|		РасчетыПредПредварительная5.Договор                       КАК Договор,
	|		РасчетыПредПредварительная5.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная5.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная5.Валюта                  КАК Валюта,
	|		РасчетыПредПредварительная5.РасчетныйДокумент            КАК ДокументПлан,   
	|		РасчетыПредПредварительная5.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПредПредварительная5.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	|       
	|		РасчетыПредПредварительная5.Заказано                                      КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	
	|ИЗ РасчетыПредПредварительная5 КАК РасчетыПредПредварительная5
	
	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПредПредварительная.Организация                  КАК Организация,
	|		РасчетыПредПредварительная.Партнер                      КАК Партнер,
	|		РасчетыПредПредварительная.Контрагент                   КАК Контрагент,
	|		РасчетыПредПредварительная.Договор                      КАК Договор,
	|		РасчетыПредПредварительная.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|		РасчетыПредПредварительная.ОбъектРасчетов        КАК ОбъектРасчетов,
	|		РасчетыПредПредварительная.Валюта                 КАК Валюта,
	|		Неопределено                                КАК ДокументПлан,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаВозникновения,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                           КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|				ТОГДА -РасчетыСПоставщиками.ОплачиваетсяОстаток
	|			ИНАЧЕ 0 
	|		КОНЕЦ * ЕСТЬNULL(Курсы.Коэффициент,1)       КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки({&КонецПериодаГраница}) КАК РасчетыСПоставщиками
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредПредварительная КАК РасчетыПредПредварительная
	|				ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам 	= РасчетыПредПредварительная.АналитикаУчетаПоПартнерам
	|					И РасчетыСПоставщиками.ЗаказПоставщику 			= РасчетыПредПредварительная.ОбъектРасчетов
	|					И РасчетыСПоставщиками.Валюта 					= РасчетыПредПредварительная.Валюта
	|					И Неопределено 									= РасчетыПредПредварительная.РасчетныйДокумент
	|					И ДАТАВРЕМЯ(1,1,1) 								= РасчетыПредПредварительная.ДатаПлановогоПогашения
	|					И ДАТАВРЕМЯ(1,1,1) 								= РасчетыПредПредварительная.ДатаВозникновения
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыСПоставщиками.Валюта
	|	ГДЕ
	|		РасчетыСПоставщиками.ОплачиваетсяОстаток < 0

// end fix Suetin 30.04.2021 13:48:07
	|																											) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения
	//|ИМЕЮЩИЕ
	//|	(&ОтборыВыбранныхПолейБезКоличественныхПолей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПоставщику) 
	//|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказНаПроизводство
	//|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказНаПроизводство)
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПереработчику)
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказДавальца)
	|       ИНАЧЕ ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПоставщику) 
	|	КОНЕЦ                   КАК ОбъектРасчетов
	|ПОМЕСТИТЬ РасчетыПредварительнаяСвернутая
	|ИЗ
	|		РасчетыПредварительная КАК РасчетыПредварительная
	|ГДЕ
	|	ВЫБОР
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ИСТИНА
	//|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказНаПроизводство
	//|			ТОГДА ИСТИНА
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|			ТОГДА ИСТИНА
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|			ТОГДА ИСТИНА
	|       ИНАЧЕ ЛОЖЬ 
	|	КОНЕЦ
	|{ГДЕ
	|		РасчетыПредварительная.Организация.* КАК Организация,
	|		РасчетыПредварительная.Партнер.* КАК Партнер,
	|		РасчетыПредварительная.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная.Договор.* КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////     // end fix Suetin 26.11.2019 16:25:17
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,
	|	
	|	Расчеты.Номенклатура						 			КАК Номенклатура,                       // begin fix Suetin 26.11.2019 14:36:22
	|	Расчеты.Характеристика 									КАК Характеристика,
	|	СУММА(Расчеты.ЗапланированоКоличество)					КАК ЗапланированоКоличество,
	|	СУММА(Расчеты.ПоставленоКоличество)						КАК ПоставленоКоличество,
	|	СУММА(Расчеты.ОсталосьЗакупитьКоличество)				КАК ОсталосьЗакупитьКоличество,         // end fix Suetin 26.11.2019 14:36:31
	|
	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток
	|ИЗ (
	|	ВЫБРАТЬ
	|		РасчетыПредварительная.Организация КАК Организация,
	|		РасчетыПредварительная.Партнер КАК Партнер,
	|		РасчетыПредварительная.Контрагент КАК Контрагент,
	|		РасчетыПредварительная.Договор КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		РасчетыПредварительная.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПредварительная.Валюта КАК Валюта,
	|		РасчетыПредварительная.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыПредварительная.ДатаВозникновения КАК ДатаВозникновения,
	|		РасчетыПредварительная.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|		РасчетыПредварительная.ДолгПоставщикаНачальныйОстаток КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПредварительная.НашДолгНачальныйОстаток КАК НашДолгНачальныйОстаток,
	|		РасчетыПредварительная.ПлановаяОплатаНачальныйОстаток КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПредварительная.ПлановаяПоставкаНачальныйОстаток КАК ПлановаяПоставкаНачальныйОстаток,
	|		РасчетыПредварительная.Заказано КАК Заказано,
	|		РасчетыПредварительная.ЗаказаноКОплате КАК ЗаказаноКОплате,
	|		РасчетыПредварительная.Поставлено КАК Поставлено,
	|		РасчетыПредварительная.Зачтено КАК Зачтено,
	|		РасчетыПредварительная.Оплачено КАК Оплачено,
	|		РасчетыПредварительная.СписаниеПереоценка КАК СписаниеПереоценка,
	|		РасчетыПредварительная.Оплачивается КАК Оплачивается,
	|		РасчетыПредварительная.ДолгПоставщикаКонечныйОстаток КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПредварительная.НашДолгКонечныйОстаток КАК НашДолгКонечныйОстаток,
	|		РасчетыПредварительная.ПлановаяОплатаКонечныйОстаток КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПредварительная.ПлановаяПоставкаКонечныйОстаток КАК ПлановаяПоставкаКонечныйОстаток,
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		0 КАК ЗапланированоКоличество,
	|		0 КАК ПоставленоКоличество,
	|		0 КАК ОсталосьЗакупитьКоличество
	|	ИЗ
	|		РасчетыПредварительная КАК РасчетыПредварительная
	|	{ГДЕ
	|		РасчетыПредварительная.Организация.* КАК Организация,
	|		РасчетыПредварительная.Партнер.* КАК Партнер,
	|		РасчетыПредварительная.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная.Договор.* КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ    																									// begin fix Suetin 26.11.2019 14:43:11
	|	
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Организация,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Договор,
	|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности,
	|		ЗаказыПоставщикам.ЗаказПоставщику,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Валюта,
	|		ЗаказыПоставщикам.ЗаказПоставщику,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаказыПоставщикам.Номенклатура,
	|		ЗаказыПоставщикам.Характеристика,
	|		ЗаказыПоставщикам.ЗаказаноПриход,
	|		ЗаказыПоставщикам.ЗаказаноРасход,
	|		ЗаказыПоставщикам.ЗаказаноКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты({(&НачалоВремен)}, {(&КонецПериодаГраница)}	//, , , ЗаказПоставщику В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					Т.ОбъектРасчетов
	//|				ИЗ
	//|					РасчетыПредварительная КАК Т)
	|																										) КАК ЗаказыПоставщикам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредварительнаяСвернутая КАК РасчетыПредварительнаяСвернутая
	|            	ПО ЗаказыПоставщикам.ЗаказПоставщику = РасчетыПредварительнаяСвернутая.ОбъектРасчетов
	|	ГДЕ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Организация.* КАК Организация,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер.* КАК Партнер,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент.* КАК Контрагент,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Договор.* КАК Договор,
	|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(ЗаказыПоставщикам.ЗаказПоставщику.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)),
	|		(ЗаказыПоставщикам.ЗаказПоставщику В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Т.ОбъектРасчетов
	|				ИЗ
	|					РасчетыПредварительная КАК Т))}   // end fix Suetin 26.11.2019 14:43:06
	|																															) КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.Номенклатура,
	|	Расчеты.Характеристика
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолей)
	|
	|";
	
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Партнер КАК Партнер,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментПартнеров,
	|	Сегменты.Партнер.* КАК Партнер}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	ИспользуетсяОтборПоСегментуПартнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////       
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК Коэффициент
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, ) КАК КурсВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({&КонецПериода}, Валюта = &Валюта) КАК КурсВалютыОтчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КурсВалюты.Кратность <> 0
	|	И КурсВалютыОтчета.Курс <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////        // begin fix Suetin 26.11.2019 16:25:26
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.АналитикаУчетаПоПартнерам                       КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,

	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток,
	|		
	|	СУММА(0)                            					КАК ЗаказаноВсего,
	|	СУММА(0)                     							КАК ЗаказаноКОплатеВсего,
	|	СУММА(0)                          						КАК ПоставленоВсего,
	|	СУММА(0)                             					КАК ЗачтеноВсего,
	|	СУММА(0)                            					КАК ОплаченоВсего,
	|	СУММА(0)                  								КАК СписаниеПереоценкаВсего
	|ПОМЕСТИТЬ РасчетыПредварительная0
	|ИЗ (

	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&НачалоОстатки}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                                              КАК Поставлено,
	|		0                                                              КАК Зачтено,
	|		0                                                              КАК Оплачено,
	|		0                                                              КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		РасчетыПоСрокам.ПредоплатаРеглОстаток                          КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПоСрокам.ДолгРеглОстаток                                КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки({&КонецПериодаГраница}) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		&ПоставленоПоставщиком                                         КАК Поставлено,
	|		&ЗачтеноПоставщиком                                            КАК Зачтено,
	|		&ОплаченоПоставщику                                            КАК Оплачено,
	|		&СписаниеПереоценка                                            КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода,
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                КАК Организация,
	|		КлючАналитики.Партнер                    КАК Партнер,
	|		КлючАналитики.Контрагент                 КАК Контрагент,
	|		КлючАналитики.Договор                    КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		РасчетыПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОплат.Валюта                  КАК Валюта,
	|		РасчетыПланОплат.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОплат.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОплат.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                        КАК НашДолгНачальныйОстаток,
	|		РасчетыПланОплат.КОплатеНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                        КАК Заказано,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                    КАК ЗаказаноКОплате,
	|		0                                        КАК Поставлено,
	|		0                                        КАК Зачтено,
	|		0                                        КАК Оплачено,
	|		0                                        КАК СписаниеПереоценка,
	|		0                                        КАК Оплачивается,
	|		
	|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                        КАК НашДолгКонечныйОстаток,
	|		РасчетыПланОплат.КОплатеКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)      КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                        КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОплат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                   КАК Организация,
	|		КлючАналитики.Партнер                       КАК Партнер,
	|		КлючАналитики.Контрагент                    КАК Контрагент,
	|		КлючАналитики.Договор                       КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
	|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПланОтгрузок.СуммаНачальныйОстаток 
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                       КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПланОтгрузок.СуммаКонечныйОстаток
	|			* ЕСТЬNULL(Курсы.Коэффициент,1)         КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланПоставок.ОстаткиИОбороты({&НачалоПериода}, {&КонецПериода}) КАК РасчетыПланОтгрузок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                  КАК Организация,
	|		АналитикаУчета.Партнер                      КАК Партнер,
	|		АналитикаУчета.Контрагент                   КАК Контрагент,
	|		АналитикаУчета.Договор                      КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщиками.ЗаказПоставщику        КАК ОбъектРасчетов,
	|		РасчетыСПоставщиками.Валюта                 КАК Валюта,
	|		Неопределено                                КАК ДокументПлан,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаВозникновения,
	|		ДАТАВРЕМЯ(1,1,1)                            КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                           КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                           КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|				ТОГДА -РасчетыСПоставщиками.ОплачиваетсяОстаток
	|			ИНАЧЕ 0 
	|		КОНЕЦ * ЕСТЬNULL(Курсы.Коэффициент,1)       КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                           КАК ПлановаяПоставкаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки({&КонецПериодаГраница}) КАК РасчетыСПоставщиками
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыСПоставщиками.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолейБезКоличественныхПолейБезВсего)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|////////////////////////////////////////////////////////////////////////////////        // begin fix Suetin 26.11.2019 16:25:26
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,

	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток,
	
	|		
	|	СУММА(Расчеты.ЗаказаноВсего)                            КАК ЗаказаноВсего,
	|	СУММА(Расчеты.ЗаказаноКОплатеВсего)                     КАК ЗаказаноКОплатеВсего,
	|	СУММА(Расчеты.ПоставленоВсего)                          КАК ПоставленоВсего,
	|	СУММА(Расчеты.ЗачтеноВсего)                             КАК ЗачтеноВсего,
	|	СУММА(Расчеты.ОплаченоВсего)                            КАК ОплаченоВсего,
	|	СУММА(Расчеты.СписаниеПереоценкаВсего)                  КАК СписаниеПереоценкаВсего
	|		
	|ПОМЕСТИТЬ РасчетыПредварительная
	|ИЗ (

	|	ВЫБРАТЬ
	|		РасчетыПредварительная0.Организация                                    	КАК Организация,
	|		РасчетыПредварительная0.Партнер                                        	КАК Партнер,
	|		РасчетыПредварительная0.Контрагент                                     	КАК Контрагент,
	|		РасчетыПредварительная0.Договор                                        	КАК Договор,
	|		РасчетыПредварительная0.НаправлениеДеятельности                        	КАК НаправлениеДеятельности,
	|		РасчетыПредварительная0.ОбъектРасчетов                                 	КАК ОбъектРасчетов,
	|		РасчетыПредварительная0.Валюта                                         	КАК Валюта,
	|		РасчетыПредварительная0.РасчетныйДокумент                              	КАК РасчетныйДокумент,
	|		РасчетыПредварительная0.ДатаВозникновения                              	КАК ДатаВозникновения,
	|		РасчетыПредварительная0.ДатаПлановогоПогашения                         	КАК ДатаПлановогоПогашения,
	|		РасчетыПредварительная0.ДолгПоставщикаНачальныйОстаток                  КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПредварительная0.НашДолгНачальныйОстаток                        	КАК НашДолгНачальныйОстаток,
	|		РасчетыПредварительная0.ПлановаяОплатаНачальныйОстаток                 	КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПредварительная0.ПлановаяПоставкаНачальныйОстаток               	КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		РасчетыПредварительная0.Заказано                                        КАК Заказано,
	|		РасчетыПредварительная0.ЗаказаноКОплате                                 КАК ЗаказаноКОплате,
	|		РасчетыПредварительная0.Поставлено                                      КАК Поставлено,
	|		РасчетыПредварительная0.Зачтено                                         КАК Зачтено,
	|		РасчетыПредварительная0.Оплачено                                 		КАК Оплачено,
	|		РасчетыПредварительная0.СписаниеПереоценка                     			КАК СписаниеПереоценка,
	|		РасчетыПредварительная0.Оплачивается                                    КАК Оплачивается,
	|		
	|		РасчетыПредварительная0.ДолгПоставщикаКонечныйОстаток                   КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПредварительная0.НашДолгКонечныйОстаток                         	КАК НашДолгКонечныйОстаток,
	|		РасчетыПредварительная0.ПлановаяОплатаКонечныйОстаток                   КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПредварительная0.ПлановаяПоставкаКонечныйОстаток                 КАК ПлановаяПоставкаКонечныйОстаток,
	
	|		
	|		0                                                              			КАК ЗаказаноВсего,
	|		0                                                              			КАК ЗаказаноКОплатеВсего,
	|		0                                         								КАК ПоставленоВсего,
	|		0                                            							КАК ЗачтеноВсего,
	|		0                                            							КАК ОплаченоВсего,
	|		0                                            							КАК СписаниеПереоценкаВсего
	|		

	
	|	ИЗ
	|		РасчетыПредварительная0
	|	{ГДЕ
	|		РасчетыПредварительная0.Организация.* КАК Организация,
	|		РасчетыПредварительная0.Партнер.* КАК Партнер,
	|		РасчетыПредварительная0.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная0.Договор.* КАК Договор,
	|		РасчетыПредварительная0.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная0.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация                                     КАК Организация,
	|		АналитикаУчета.Партнер                                         КАК Партнер,
	|		АналитикаУчета.Контрагент                                      КАК Контрагент,
	|		АналитикаУчета.Договор                                         КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|		0                                                              КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                                              КАК НашДолгНачальныйОстаток,
	|		0                                                              КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                                              КАК Заказано,
	|		0                                                              КАК ЗаказаноКОплате,
	|		0                                         					   КАК Поставлено,
	|		0                                            				   КАК Зачтено,
	|		0                                            				   КАК Оплачено,
	|		0                                            				   КАК СписаниеПереоценка,
	|		0                                                              КАК Оплачивается,
	|		
	|		0                                                              КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                                              КАК НашДолгКонечныйОстаток,
	|		0                                                              КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                                              КАК ПлановаяПоставкаКонечныйОстаток,
	
	|		
	|		0                                                              КАК ЗаказаноВсего,
	|		0                                                              КАК ЗаказаноКОплатеВсего,
	|		&ПоставленоПоставщиком                                         КАК ПоставленоВсего,
	|		&ЗачтеноПоставщиком                                            КАК ЗачтеноВсего,
	|		&ОплаченоПоставщику                                            КАК ОплаченоВсего,
	|		&СписаниеПереоценка                                            КАК СписаниеПереоценкаВсего
	|		

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредварительная0 КАК РасчетыПредварительная0
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = РасчетыПредварительная0.АналитикаУчетаПоПартнерам
	|					И РасчетыПоСрокам.ОбъектРасчетов = РасчетыПредварительная0.ОбъектРасчетов
	|					И РасчетыПоСрокам.Валюта = РасчетыПредварительная0.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		РасчетыПоСрокам.Период МЕЖДУ &НачалоВремен И &КонецПериода,
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                КАК Организация,
	|		КлючАналитики.Партнер                    КАК Партнер,
	|		КлючАналитики.Контрагент                 КАК Контрагент,
	|		КлючАналитики.Договор                    КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		РасчетыПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОплат.Валюта                  КАК Валюта,
	|		РасчетыПланОплат.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОплат.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОплат.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                        КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                        КАК НашДолгНачальныйОстаток,
	|		0      									 КАК ПлановаяОплатаНачальныйОстаток,
	|		0                                        КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                        КАК Заказано,
	|		0                                    	 КАК ЗаказаноКОплате,
	|		0                                        КАК Поставлено,
	|		0                                        КАК Зачтено,
	|		0                                        КАК Оплачено,
	|		0                                        КАК СписаниеПереоценка,
	|		0                                        КАК Оплачивается,
	|		
	|		0                                        КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                        КАК НашДолгКонечныйОстаток,
	|		0      									 КАК ПлановаяОплатаКонечныйОстаток,
	|		0                                        КАК ПлановаяПоставкаКонечныйОстаток,
	
	|		
	|		0                                        КАК ЗаказаноВсего,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОплат.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОплат.КОплатеПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                    КАК ЗаказаноКОплатеВсего,
	|		0                                        КАК ПоставленоВсего,
	|		0                                        КАК ЗачтеноВсего,
	|		0                                        КАК ОплаченоВсего,
	|		0                                        КАК СписаниеПереоценкаВсего
	|		

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.Обороты({&НачалоВремен}, {&КонецПериода},,
	|           					(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта) 
	|           						В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.АналитикаУчетаПоПартнерам, Т.ОбъектРасчетов, Т.Валюта ИЗ РасчетыПредварительная0 как Т)
	|																										) КАК РасчетыПланОплат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОплат.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлючАналитики.Организация                   КАК Организация,
	|		КлючАналитики.Партнер                       КАК Партнер,
	|		КлючАналитики.Контрагент                    КАК Контрагент,
	|		КлючАналитики.Договор                       КАК Договор,
	|		КлючАналитики.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
	|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
	|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
	|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
	|		0                                           КАК ДолгПоставщикаНачальныйОстаток,
	|		0                                           КАК НашДолгНачальныйОстаток,
	|		0                                           КАК ПлановаяОплатаНачальныйОстаток,
	|		0									        КАК ПлановаяПоставкаНачальныйОстаток,
	|		
	|		0                                       	КАК Заказано,
	|		0                                           КАК ЗаказаноКОплате,
	|		0                                           КАК Поставлено,
	|		0                                           КАК Зачтено,
	|		0                                           КАК Оплачено,
	|		0                                           КАК СписаниеПереоценка,
	|		0                                           КАК Оплачивается,
	|		
	|		0                                           КАК ДолгПоставщикаКонечныйОстаток,
	|		0                                           КАК НашДолгКонечныйОстаток,
	|		0                                           КАК ПлановаяОплатаКонечныйОстаток,
	|		0									        КАК ПлановаяПоставкаКонечныйОстаток,
	
	|		
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПланОтгрузок.ДокументПлан) В (&ТипыДокументовПлана)
	|				ТОГДА РасчетыПланОтгрузок.СуммаПриход * ЕСТЬNULL(Курсы.Коэффициент,1)
	|			ИНАЧЕ 0
	|		КОНЕЦ                                    КАК ЗаказаноВсего,
	|		0                                    	 КАК ЗаказаноКОплатеВсего,
	|		0                                        КАК ПоставленоВсего,
	|		0                                        КАК ЗачтеноВсего,
	|		0                                        КАК ОплаченоВсего,
	|		0                                        КАК СписаниеПереоценкаВсего
	|		

	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Обороты({&НачалоВремен}, {&КонецПериода},,
	|           					(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта) 
	|           						В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.АналитикаУчетаПоПартнерам, Т.ОбъектРасчетов, Т.Валюта ИЗ РасчетыПредварительная0 как Т)
	|																										) КАК РасчетыПланОтгрузок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК Курсы
	|				ПО Курсы.Валюта = РасчетыПланОтгрузок.Валюта
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		АналитикаУчета.Организация.* КАК Организация,
	|		АналитикаУчета.Партнер.* КАК Партнер,
	|		АналитикаУчета.Контрагент.* КАК Контрагент,
	|		АналитикаУчета.Договор.* КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(АналитикаУчета.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|																																) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолейБезКоличественныхПолей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПоставщику) 
	//|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказНаПроизводство
	//|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказНаПроизводство)
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПереработчику)
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|			ТОГДА ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказДавальца)
	|       ИНАЧЕ ВЫРАЗИТЬ(РасчетыПредварительная.ОбъектРасчетов КАК Документ.ЗаказПоставщику) 
	|	КОНЕЦ                   КАК ОбъектРасчетов
	|ПОМЕСТИТЬ РасчетыПредварительнаяСвернутая
	|ИЗ
	|		РасчетыПредварительная КАК РасчетыПредварительная
	|ГДЕ
	|	ВЫБОР
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ИСТИНА
	//|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказНаПроизводство
	//|			ТОГДА ИСТИНА
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказПереработчику
	|			ТОГДА ИСТИНА
	|		КОГДА РасчетыПредварительная.ОбъектРасчетов ССЫЛКА Документ.ЗаказДавальца
	|			ТОГДА ИСТИНА
	|       ИНАЧЕ ЛОЖЬ 
	|	КОНЕЦ
	|{ГДЕ
	|		РасчетыПредварительная.Организация.* КАК Организация,
	|		РасчетыПредварительная.Партнер.* КАК Партнер,
	|		РасчетыПредварительная.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная.Договор.* КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////     // end fix Suetin 26.11.2019 16:25:17
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация                                     КАК Организация,
	|	Расчеты.Партнер                                         КАК Партнер,
	|	Расчеты.Контрагент                                      КАК Контрагент,
	|	Расчеты.Договор                                         КАК Договор,
	|	Расчеты.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов                                  КАК ОбъектРасчетов,
	|	Расчеты.Валюта                                          КАК Валюта,
	|	Расчеты.РасчетныйДокумент                               КАК РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения                               КАК ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,
	|	
	|	Расчеты.Номенклатура						 			КАК Номенклатура,                       // begin fix Suetin 26.11.2019 14:36:22
	|	Расчеты.Характеристика 									КАК Характеристика,
	|	СУММА(Расчеты.ЗапланированоКоличество)					КАК ЗапланированоКоличество,
	|	СУММА(Расчеты.ПоставленоКоличество)						КАК ПоставленоКоличество,
	|	СУММА(Расчеты.ОсталосьЗакупитьКоличество)				КАК ОсталосьЗакупитьКоличество,         // end fix Suetin 26.11.2019 14:36:31
	|
	|	СУММА(Расчеты.ДолгПоставщикаНачальныйОстаток)           КАК ДолгПоставщикаНачальныйОстаток,
	|	СУММА(Расчеты.НашДолгНачальныйОстаток)                  КАК НашДолгНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаНачальныйОстаток)           КАК ПлановаяОплатаНачальныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаНачальныйОстаток)         КАК ПлановаяПоставкаНачальныйОстаток,
	|	
	|	СУММА(Расчеты.Заказано)                                 КАК Заказано,
	|	СУММА(Расчеты.ЗаказаноКОплате)                          КАК ЗаказаноКОплате,
	|	СУММА(Расчеты.Поставлено)                               КАК Поставлено,
	|	СУММА(Расчеты.Зачтено)                                  КАК Зачтено,
	|	СУММА(Расчеты.Оплачено)                                 КАК Оплачено,
	|	СУММА(Расчеты.СписаниеПереоценка)                       КАК СписаниеПереоценка,
	|	СУММА(Расчеты.Оплачивается)                             КАК Оплачивается,
	|	
	|	СУММА(Расчеты.ДолгПоставщикаКонечныйОстаток)            КАК ДолгПоставщикаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток)                   КАК НашДолгКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяОплатаКонечныйОстаток)            КАК ПлановаяОплатаКонечныйОстаток,
	|	СУММА(Расчеты.ПлановаяПоставкаКонечныйОстаток)          КАК ПлановаяПоставкаКонечныйОстаток,
	|		
	|	СУММА(Расчеты.ЗаказаноВсего)                            КАК ЗаказаноВсего,
	|	СУММА(Расчеты.ЗаказаноКОплатеВсего)                     КАК ЗаказаноКОплатеВсего,
	|	СУММА(Расчеты.ПоставленоВсего)                          КАК ПоставленоВсего,
	|	СУММА(Расчеты.ЗачтеноВсего)                             КАК ЗачтеноВсего,
	|	СУММА(Расчеты.ОплаченоВсего)                            КАК ОплаченоВсего,
	|	СУММА(Расчеты.СписаниеПереоценкаВсего)                  КАК СписаниеПереоценкаВсего
	|		
	|ИЗ (
	|	ВЫБРАТЬ
	|		РасчетыПредварительная.Организация КАК Организация,
	|		РасчетыПредварительная.Партнер КАК Партнер,
	|		РасчетыПредварительная.Контрагент КАК Контрагент,
	|		РасчетыПредварительная.Договор КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		РасчетыПредварительная.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПредварительная.Валюта КАК Валюта,
	|		РасчетыПредварительная.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыПредварительная.ДатаВозникновения КАК ДатаВозникновения,
	|		РасчетыПредварительная.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|		РасчетыПредварительная.ДолгПоставщикаНачальныйОстаток КАК ДолгПоставщикаНачальныйОстаток,
	|		РасчетыПредварительная.НашДолгНачальныйОстаток КАК НашДолгНачальныйОстаток,
	|		РасчетыПредварительная.ПлановаяОплатаНачальныйОстаток КАК ПлановаяОплатаНачальныйОстаток,
	|		РасчетыПредварительная.ПлановаяПоставкаНачальныйОстаток КАК ПлановаяПоставкаНачальныйОстаток,
	|		РасчетыПредварительная.Заказано КАК Заказано,
	|		РасчетыПредварительная.ЗаказаноКОплате КАК ЗаказаноКОплате,
	|		РасчетыПредварительная.Поставлено КАК Поставлено,
	|		РасчетыПредварительная.Зачтено КАК Зачтено,
	|		РасчетыПредварительная.Оплачено КАК Оплачено,
	|		РасчетыПредварительная.СписаниеПереоценка КАК СписаниеПереоценка,
	|		РасчетыПредварительная.Оплачивается КАК Оплачивается,
	|		РасчетыПредварительная.ДолгПоставщикаКонечныйОстаток КАК ДолгПоставщикаКонечныйОстаток,
	|		РасчетыПредварительная.НашДолгКонечныйОстаток КАК НашДолгКонечныйОстаток,
	|		РасчетыПредварительная.ПлановаяОплатаКонечныйОстаток КАК ПлановаяОплатаКонечныйОстаток,
	|		РасчетыПредварительная.ПлановаяПоставкаКонечныйОстаток КАК ПлановаяПоставкаКонечныйОстаток,
	|		
	|		РасчетыПредварительная.ЗаказаноВсего                            КАК ЗаказаноВсего,
	|		РасчетыПредварительная.ЗаказаноКОплатеВсего                     КАК ЗаказаноКОплатеВсего,
	|		РасчетыПредварительная.ПоставленоВсего                          КАК ПоставленоВсего,
	|		РасчетыПредварительная.ЗачтеноВсего                             КАК ЗачтеноВсего,
	|		РасчетыПредварительная.ОплаченоВсего                            КАК ОплаченоВсего,
	|		РасчетыПредварительная.СписаниеПереоценкаВсего                  КАК СписаниеПереоценкаВсего,
	|		
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		0 КАК ЗапланированоКоличество,
	|		0 КАК ПоставленоКоличество,
	|		0 КАК ОсталосьЗакупитьКоличество
	|	ИЗ
	|		РасчетыПредварительная КАК РасчетыПредварительная
	|	{ГДЕ
	|		РасчетыПредварительная.Организация.* КАК Организация,
	|		РасчетыПредварительная.Партнер.* КАК Партнер,
	|		РасчетыПредварительная.Контрагент.* КАК Контрагент,
	|		РасчетыПредварительная.Договор.* КАК Договор,
	|		РасчетыПредварительная.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(РасчетыПредварительная.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ    																									// begin fix Suetin 26.11.2019 14:43:11
	|	
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Организация,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Договор,
	|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности,
	|		ЗаказыПоставщикам.ЗаказПоставщику,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Валюта,
	|		ЗаказыПоставщикам.ЗаказПоставщику,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	
	|		ЗаказыПоставщикам.Номенклатура,
	|		ЗаказыПоставщикам.Характеристика,
	|		ЗаказыПоставщикам.ЗаказаноПриход,
	|		ЗаказыПоставщикам.ЗаказаноРасход,
	|		ЗаказыПоставщикам.ЗаказаноКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты({(&НачалоВремен)}, {(&КонецПериодаГраница)}	//, , , ЗаказПоставщику В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					Т.ОбъектРасчетов
	//|				ИЗ
	//|					РасчетыПредварительнаяСвернутая КАК Т)     РасчетыПредварительная
	|																										) КАК ЗаказыПоставщикам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыПредварительнаяСвернутая КАК РасчетыПредварительнаяСвернутая
	|            	ПО ЗаказыПоставщикам.ЗаказПоставщику = РасчетыПредварительнаяСвернутая.ОбъектРасчетов
	|	ГДЕ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	{ГДЕ
	|		ЗаказыПоставщикам.ЗаказПоставщику.Организация.* КАК Организация,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Партнер.* КАК Партнер,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Контрагент.* КАК Контрагент,
	|		ЗаказыПоставщикам.ЗаказПоставщику.Договор.* КАК Договор,
	|		ЗаказыПоставщикам.ЗаказПоставщику.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|		(ЗаказыПоставщикам.ЗаказПоставщику.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)),
	|		(ЗаказыПоставщикам.ЗаказПоставщику В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Т.ОбъектРасчетов
	|				ИЗ
	|					РасчетыПредварительная КАК Т))}   // end fix Suetin 26.11.2019 14:43:06
	|																															) КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Партнер,
	|	Расчеты.Контрагент,
	|	Расчеты.Договор,
	|	Расчеты.НаправлениеДеятельности,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.Номенклатура,
	|	Расчеты.Характеристика
	|ИМЕЮЩИЕ
	|	(&ОтборыВыбранныхПолей)
	|
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПоставленоПоставщиком", ВзаиморасчетыСервер.ШаблонПоляПоставленоПоставщиком());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗачтеноПоставщиком", ВзаиморасчетыСервер.ШаблонПоляЗачтеноПоставщиком());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОплаченоПоставщику", ВзаиморасчетыСервер.ШаблонПоляОплаченоПоставщику());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СписаниеПереоценка", ВзаиморасчетыСервер.ШаблонПоляСписаниеПереоценкаЗадолженности());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТипыДокументовПлана", ПолучитьТипыДокументовПлана());
	
	Если ВалютаОтчета = 4 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Регл","");
	ИначеЕсли ВалютаОтчета = 2 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Регл","Упр");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьТипыДокументовПлана()

	ТекстТиповДокументов = ""; 
	
	//++ НЕ УТ
	ТекстТиповДокументов = ТекстТиповДокументов + "ТИП(Документ.ЗаказПереработчику), ";
	//-- НЕ УТ
	
	ТекстТиповДокументов = ТекстТиповДокументов + "ТИП(Документ.ЗаказПоставщику)";
	
	Возврат ТекстТиповДокументов;
	
КонецФункции

Процедура СформироватьПараметрыОтчета(ПараметрКоманды, ПараметрыФормы, Параметры)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ЭтоМассив = Истина;
		Если ПараметрКоманды.Количество() > 0 Тогда
			ПервыйЭлемент = ПараметрКоманды[0];
		Иначе
			ПервыйЭлемент = Неопределено;
		КонецЕсли;
	Иначе
		ЭтоМассив = Ложь;
		ПервыйЭлемент = ПараметрКоманды;
	КонецЕсли;
	
	Если ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.Партнеры") Тогда
		Если ЭтоМассив Тогда
			ЕстьПодчиненныеПартнеры = Ложь;
			Для Каждого ЭлементПараметраКоманды Из ПараметрКоманды Цикл
				Если ПартнерыИКонтрагенты.ЕстьПодчиненныеПартнеры(ЭлементПараметраКоманды) Тогда
					ЕстьПодчиненныеПартнеры = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЕстьПодчиненныеПартнеры = ПартнерыИКонтрагенты.ЕстьПодчиненныеПартнеры(ПараметрКоманды);
		КонецЕсли;
		
		Если ЕстьПодчиненныеПартнеры Тогда
			ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных();
			ЭлементОтбора = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
			ЗначениеОтбора = ПараметрКоманды;
			Если ЭтоМассив Тогда
				ЗначениеОтбора = Новый СписокЗначений;
				ЗначениеОтбора.ЗагрузитьЗначения(ПараметрКоманды);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			Иначе
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			КонецЕсли;
			ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
			ПараметрыФормы.ФиксированныеНастройки = ФиксированныеНастройки;
			Параметры.ФиксированныеНастройки = ФиксированныеНастройки;
			ПараметрыФормы.КлючНазначенияИспользования = "ГруппаПартнеров";
			Параметры.КлючНазначенияИспользования = "ГруппаПартнеров";
		Иначе
			ПараметрыФормы.Отбор = Новый Структура("Партнер", ПараметрКоманды);
			ПараметрыФормы.КлючНазначенияИспользования = ПараметрКоманды;
			Параметры.КлючНазначенияИспользования = ПараметрКоманды;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.ДоговорыКонтрагентов") 
		ИЛИ ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		ПараметрыФормы.Отбор = Новый Структура("Договор", ПараметрКоманды);
		ПараметрыФормы.КлючНазначенияИспользования = ПараметрКоманды;
		Параметры.КлючНазначенияИспользования = ПараметрКоманды;
	Иначе
		ОбъектРасчетов = ВзаиморасчетыСервер.ОбъектРасчетовПоСсылке(ПервыйЭлемент);
		ПараметрыФормы.Отбор = Новый Структура("ОбъектРасчетов", ОбъектРасчетов);
		ПараметрыФормы.КлючНазначенияИспользования = ОбъектРасчетов;
		Параметры.КлючНазначенияИспользования = ОбъектРасчетов;
	КонецЕсли;
	
КонецПроцедуры
// begin fix Suetin 27.11.2019 13:33:02
Процедура ДобавитьОтборыВыбранныхПолейВЗапрос(ТекстЗапроса, НастройкиОтчета, ВычисляемыеПоля, ИмяТаблицы) Экспорт    
	
	ТекстОтборов = "";
	
	МассивВыбранныхПолей = Новый Массив;
	НайтиВыбранныеПоляРекурсивно(НастройкиОтчета.Выбор.Элементы, МассивВыбранныхПолей);
	
	Для Каждого ВыбранноеПоле Из МассивВыбранныхПолей Цикл
		Если ВычисляемыеПоля.Найти(Строка(ВыбранноеПоле.Поле)) = Неопределено Тогда
			Если СтрЧислоВхождений(Строка(ВыбранноеПоле.Поле), "Количество") > 0 Тогда Продолжить; КонецЕсли;
			Если СтрЧислоВхождений(Строка(ВыбранноеПоле.Поле), "Всего") > 0 Тогда Продолжить; КонецЕсли;
			ТекстОтборов = ТекстОтборов + ?(ТекстОтборов = "","", "ИЛИ") +"
				|	СУММА("+ИмяТаблицы+"." + Строка(ВыбранноеПоле.Поле) + ") <> 0 ";
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборыВыбранныхПолейБезКоличественныхПолейБезВсего", ?(ТекстОтборов = "", "ИСТИНА", ТекстОтборов));
	
	ТекстОтборов = "";
	
	МассивВыбранныхПолей = Новый Массив;
	НайтиВыбранныеПоляРекурсивно(НастройкиОтчета.Выбор.Элементы, МассивВыбранныхПолей);
	
	Для Каждого ВыбранноеПоле Из МассивВыбранныхПолей Цикл
		Если ВычисляемыеПоля.Найти(Строка(ВыбранноеПоле.Поле)) = Неопределено Тогда
			Если СтрЧислоВхождений(Строка(ВыбранноеПоле.Поле), "Количество") > 0 Тогда Продолжить; КонецЕсли;
			ТекстОтборов = ТекстОтборов + ?(ТекстОтборов = "","", "ИЛИ") +"
				|	СУММА("+ИмяТаблицы+"." + Строка(ВыбранноеПоле.Поле) + ") <> 0 ";
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборыВыбранныхПолейБезКоличественныхПолей", ?(ТекстОтборов = "", "ИСТИНА", ТекстОтборов));
	
КонецПроцедуры

Процедура ДобавитьОтборыВыбранныхПолейВЗапрос1(ТекстЗапроса, НастройкиОтчета, ВычисляемыеПоля, ИмяТаблицы) Экспорт
	
	ТекстОтборов2 = "";
	
	МассивВыбранныхПолей = Новый Массив;
	НайтиВыбранныеПоляРекурсивно(НастройкиОтчета.Выбор.Элементы, МассивВыбранныхПолей);
	
	Для Каждого ВыбранноеПоле Из МассивВыбранныхПолей Цикл
		Если ВычисляемыеПоля.Найти(Строка(ВыбранноеПоле.Поле)) = Неопределено Тогда
			Если СтрЧислоВхождений(Строка(ВыбранноеПоле.Поле), "Количество") > 0 Тогда Продолжить; КонецЕсли;
			ТекстОтборов2 = ТекстОтборов2 + ?(ТекстОтборов2 = "","", "ИЛИ") +"
				|	СУММА("+ИмяТаблицы+"." + Строка(ВыбранноеПоле.Поле) + ") <> 0 ";
		КонецЕсли;
	КонецЦикла;
	
	ТекстОтборов1 = "";
	
	Для Каждого ВыбранноеПоле Из МассивВыбранныхПолей Цикл
		Если ВычисляемыеПоля.Найти(Строка(ВыбранноеПоле.Поле)) = Неопределено Тогда
			Если СтрЧислоВхождений(Строка(ВыбранноеПоле.Поле), "Количество") = 0 Тогда Продолжить; КонецЕсли;
			ТекстОтборов1 = ТекстОтборов1 + ?(ТекстОтборов1 = "","", "ИЛИ") +"
				|	СУММА("+ИмяТаблицы+"." + Строка(ВыбранноеПоле.Поле) + ") <> 0 ";
		КонецЕсли;
	КонецЦикла;
	
	ТекстОтборов = ?(ТекстОтборов2 = "", "ИСТИНА", "(" + ТекстОтборов2 + ")") + "
		|	ИЛИ  " + ?(ТекстОтборов1 = "", "ИСТИНА", "(" + ТекстОтборов1 + ")") + " И " + ?(ТекстОтборов2 = "", "ИСТИНА", "(" + ТекстОтборов2 + ")");
		
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборыВыбранныхПолей", ?(ТекстОтборов = "", "ИСТИНА", ТекстОтборов));
	
КонецПроцедуры

Процедура ДобавитьОтборыВыбранныхПолейВЗапрос2(ТекстЗапроса, НастройкиОтчета, ВычисляемыеПоля, ИмяТаблицы) Экспорт
	
	ТекстОтборов = "";
	
	МассивВыбранныхПолей = Новый Массив;
	НайтиВыбранныеПоляРекурсивно(НастройкиОтчета.Выбор.Элементы, МассивВыбранныхПолей);
	
	Для Каждого ВыбранноеПоле Из МассивВыбранныхПолей Цикл
		Если ВычисляемыеПоля.Найти(Строка(ВыбранноеПоле.Поле)) = Неопределено Тогда
			ТекстОтборов = ТекстОтборов + ?(ТекстОтборов = "","", "ИЛИ") +"
				|	СУММА("+ИмяТаблицы+"." + Строка(ВыбранноеПоле.Поле) + ") <> 0 ";
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборыВыбранныхПолей", ?(ТекстОтборов = "", "ИСТИНА", ТекстОтборов));
	
КонецПроцедуры

Процедура НайтиВыбранныеПоляРекурсивно(КоллекцияЭлементов, МассивЭлементов)

	Для каждого Элемент Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			Если Элемент.Использование Тогда
				МассивЭлементов.Добавить(Элемент);
			КонецЕсли;
		ИначеЕсли Элемент.Использование Тогда
			НайтиВыбранныеПоляРекурсивно(Элемент.Элементы, МассивЭлементов);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
// end fix Suetin 27.11.2019 13:33:09
#КонецОбласти

#КонецЕсли