
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УсловияТруда.Код КАК Код,
	|	УсловияТруда.Наименование КАК Наименование,
	|	УсловияТруда.Ссылка КАК Ссылка,
	|	УсловияТрудаДополнительныеРеквизиты.Значение КАК НаименованиеДляПечати
	|ИЗ
	|	Справочник.УсловияТруда КАК УсловияТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияТруда.ДополнительныеРеквизиты КАК УсловияТрудаДополнительныеРеквизиты
	|		ПО (УсловияТруда.Ссылка = УсловияТрудаДополнительныеРеквизиты.Ссылка
	|				И УсловияТрудаДополнительныеРеквизиты.Свойство.Имя = ""НаименованиеДляОтчетов"")";
	
	Список.ОсновнаяТаблица = "Справочник.УсловияТруда";
	Список.ТекстЗапроса = ТекстЗапроса;
	Список.ДинамическоеСчитываниеДанных = Истина;
	Список.АвтоЗаполнениеДоступныхПолей = Истина;
	Список.ВидКлюча = ВидКлючаДинамическогоСписка.Авто;
	НовыйЭлемент = Элементы.Вставить("ВИЛС_НаименованиеДляПечати",Тип("ПолеФормы"),Элементы.Список,Элементы.Код);
	НовыйЭлемент.ПутьКДанным = "Список.НаименованиеДляПечати";
КонецПроцедуры
