
&После("Печать")
Процедура ВИЛС_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВИЛС_АктИнвентаризацииМатериаловИПолуфабрикатов") Тогда
		
		ТабличныйДокумент = ВИЛС_СформироватьАктИнвентаризацииМатериаловИПолуфабрикатов(ПараметрыПечати, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
									КоллекцияПечатныхФорм, 
									"ВИЛС_АктИнвентаризацииМатериаловИПолуфабрикатов",
									НСтр("ru = 'Акт инвентаризации материалов и полуфабрикатов в цехе (ВИЛС';
										|en = 'Report on materials and semi-finished products stocktaking in the shop (VILS)'"),
									ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

Функция ВИЛС_СформироватьАктИнвентаризацииМатериаловИПолуфабрикатов(ПараметрыПечати, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	
	Если ПараметрыПечати.свойство("НовоеПроизводство") Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РаспределениеПроизводственныхЗатрат.ПФ_MXL_АктИнвентаризацииМатериаловИПолуфабрикатов2_2_ВИЛС");
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(Затраты.Ссылка КАК Документ.РаспределениеПроизводственныхЗатрат) КАК Ссылка,         // fix Suetin 20.12.2019 16:18:13
			|	ВЫРАЗИТЬ(Затраты.Подразделение КАК Справочник.СтруктураПредприятия) КАК Подразделение,
			|	ВЫРАЗИТЬ(Затраты.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(Затраты.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
			|	Затраты.ВходящийОстаток КАК ВходящийОстаток,
			|	Затраты.Наличие КАК Наличие,
			|	Затраты.Распределить КАК Распределить,
			|	Затраты.Распределено КАК Распределено,
			|	Затраты.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ ЗатратыВрем
			|ИЗ
			|	&Затраты КАК Затраты
			|;
			|////////////////////////////////////////////////////////////////////////////////        // begin fix Suetin 23.12.2019 17:09:47
			|ВЫБРАТЬ
			|	ГруппыФУН.Ссылка КАК ГруппаФинансовогоУчета
			|ПОМЕСТИТЬ ГруппыФУН
			|ИЗ
			|	Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФУН
			|ГДЕ
			|	ГруппыФУН.СчетУчетаНаСкладе В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы))
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Затраты.Ссылка КАК Ссылка,
			|	Затраты.Подразделение КАК Подразделение,
			|	Затраты.Номенклатура КАК Номенклатура,
			|	Затраты.Характеристика КАК Характеристика,
			|	Затраты.ВходящийОстаток КАК ВходящийОстаток,
			|	Затраты.Наличие КАК Наличие,
			|	Затраты.Распределить КАК Распределить,
			|	Затраты.Распределено КАК Распределено,
			|	Затраты.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ Затраты
			|ИЗ
			|	ЗатратыВрем КАК Затраты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрН
			|			ПО Затраты.Номенклатура = СпрН.Ссылка
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыФУН
			//|			ПО СпрН.ГруппаФинансовогоУчета = ГруппыФУН.ГруппаФинансовогоУчета
			|	
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПП.Ссылка КАК Ссылка,
			|   СП.Документ КАК Документ,
			|	ПП.Количество КАК Наличие
			|ПОМЕСТИТЬ ТаблицаЗаказов
			|ИЗ
			|	Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК ПП
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СП
			|			ПО ПП.ПартияПроизводства = СП.Ссылка
			|ГДЕ
			|	ПП.Ссылка в (ВЫБРАТЬ РАЗЛИЧНЫЕ ТЗ.Ссылка ИЗ Затраты КАК ТЗ)
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			//|	ДД.Таблица КАК Таблица,
			//|	ДД.Содержание КАК Содержание,
			//|	ДД.ТипЗатрат КАК ТипЗатрат,
			//|	ДД.ВидЗатрат КАК ВидЗатрат,
		    |	ДД.Организация КАК Организация,
		    |	ДД.Подразделение КАК Подразделение,
			//|	ДД.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
			//|	ДД.Регистратор КАК Регистратор,
			//|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
			//|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
			//|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		    |	ДД.Номенклатура КАК Номенклатура,
		    |	ДД.Характеристика КАК Характеристика,
			//|	ДД.Серия КАК Серия,
			//|	ДД.Назначение КАК Назначение,
			//|	ДД.ВидРабот КАК ВидРабот,
			//|	ДД.СтатьяРасходов КАК СтатьяРасходов,
			//|	ДД.АналитикаРасходов КАК АналитикаРасходов,
			//|	ДД.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
			//|	ДД.Продукция КАК Продукция,
			//|	ДД.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
			//|	ДД.СерияПродукции КАК СерияПродукции,
			//|	ДД.НазначениеПродукции КАК НазначениеПродукции,
			//|	ДД.ПартияПроизводства КАК ПартияПроизводства,
		    |	ДД.ЗаказНаПроизводство КАК Документ,																					// fix Suetin 23.12.2019 13:03:48	ЗаказНаПроизводство,
		    |	СУММА(ДД.аНачальныйОстатокКоличество) КАК аНачальныйОстатокКоличество,
		    //|	СУММА(ДД.аНачальныйОстатокСтоимость) КАК аНачальныйОстатокСтоимость,
			//|	СУММА(ДД.аНачальныйОстатокПР) КАК аНачальныйОстатокПР,
			//|	СУММА(ДД.аНачальныйОстатокВР) КАК аНачальныйОстатокВР,
			//|	СУММА(ДД.аНачальныйОстатокЗабалансовая) КАК аНачальныйОстатокЗабалансовая,
		    |	СУММА(ДД.бПоступилоКоличество) КАК бПоступилоКоличество,
			//|	СУММА(ДД.бПоступилоСтоимость) КАК бПоступилоСтоимость,
			//|	СУММА(ДД.бПоступилоПР) КАК бПоступилоПР,
			//|	СУММА(ДД.бПоступилоВР) КАК бПоступилоВР,
			//|	СУММА(ДД.бПоступилоЗабалансовая) КАК бПоступилоЗабалансовая,
		    |	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК Наличие,																	// fix Suetin 23.12.2019 13:04:26	Наличие,  гРасходНаПроизводствоКоличество
			//|	СУММА(ДД.гРасходНаПроизводствоСтоимость) КАК гРасходНаПроизводствоСтоимость,
			//|	СУММА(ДД.гРасходНаПроизводствоПР) КАК гРасходНаПроизводствоПР,
			//|	СУММА(ДД.гРасходНаПроизводствоВР) КАК гРасходНаПроизводствоВР,
			//|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая) КАК гРасходНаПроизводствоЗабалансовая,
		    |	СУММА(ДД.еКонечныйОстатокКоличество) КАК еКонечныйОстатокКоличество//,
			//|	СУММА(ДД.еКонечныйОстатокСтоимость) КАК еКонечныйОстатокСтоимость,
			//|	СУММА(ДД.еКонечныйОстатокПР) КАК еКонечныйОстатокПР,
			//|	СУММА(ДД.еКонечныйОстатокВР) КАК еКонечныйОстатокВР,
			//|	СУММА(ДД.еКонечныйОстатокЗабалансовая) КАК еКонечныйОстатокЗабалансовая
			//|{ВЫБРАТЬ
			//|	Таблица,
			//|	Содержание,
			//|	ТипЗатрат.*,
			//|	ВидЗатрат,
			//|	Организация.*,
			//|	Подразделение.*,
			//|	ПодразделениеОтправитель.*,
			//|	Регистратор.*,
			//|	НаправлениеДеятельности.*,
			//|	СтатьяКалькуляции.*,
			//|	АналитикаУчетаНоменклатуры.*,
			//|	Номенклатура.*,
			//|	Характеристика.*,
			//|	Серия.*,
			//|	Назначение.*,
			//|	ВидРабот.*,
			//|	СтатьяРасходов.*,
			//|	АналитикаРасходов.*,
			//|	АналитикаУчетаПродукции.*,
			//|	Продукция.*,
			//|	ХарактеристикаПродукции.*,
			//|	СерияПродукции.*,
			//|	НазначениеПродукции.*,
			//|	ПартияПроизводства.*,
			//|	ЗаказНаПроизводство.*,
			//|	аНачальныйОстатокКоличество,
			//|	аНачальныйОстатокСтоимость,
			//|	аНачальныйОстатокПР,
			//|	аНачальныйОстатокВР,
			//|	аНачальныйОстатокЗабалансовая,
			//|	бПоступилоКоличество,
			//|	бПоступилоСтоимость,
			//|	бПоступилоПР,
			//|	бПоступилоВР,
			//|	бПоступилоЗабалансовая,
			//|	гРасходНаПроизводствоКоличество,
			//|	гРасходНаПроизводствоСтоимость,
			//|	гРасходНаПроизводствоПР,
			//|	гРасходНаПроизводствоВР,
			//|	гРасходНаПроизводствоЗабалансовая,
			//|	еКонечныйОстатокКоличество,
			//|	еКонечныйОстатокСтоимость,
			//|	еКонечныйОстатокПР,
			//|	еКонечныйОстатокВР,
			//|	еКонечныйОстатокЗабалансовая}
		    |ИЗ
		    |	(ВЫБРАТЬ
		    |		""Производство"" КАК Таблица,
		    |		""Начальный остаток (материалы)"" КАК Содержание,
		    |		Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
		    |		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные), ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
		    |				ТОГДА ""Материальные""
		    |			ИНАЧЕ ""Услуги""
		    |		КОНЕЦ КАК ВидЗатрат,
		    |		ДД.Организация КАК Организация,
		    |		Аналитика.Подразделение КАК Подразделение,
		    |		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
		    |		НЕОПРЕДЕЛЕНО КАК Регистратор,
		    |		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
		    |		Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
		    |		ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		    |		Аналитика.Номенклатура КАК Номенклатура,
		    |		Аналитика.Характеристика КАК Характеристика,
		    |		Аналитика.Серия КАК Серия,
		    |		Аналитика.Назначение КАК Назначение,
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
		    |		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
		    |		НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
		    |		НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
		    |		ДД.Партия КАК ПартияПроизводства,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ КАК ЗаказНаПроизводство,
			
			|		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		    |				ТОГДА - ДД.КоличествоОстаток
		    |			ИНАЧЕ ДД.КоличествоОстаток
		    |		КОНЕЦ КАК аНачальныйОстатокКоличество,
			
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
		    |					ИНАЧЕ ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
		    |				КОНЕЦ
		    |		КОНЕЦ КАК аНачальныйОстатокСтоимость,
		    |		ДД.ПостояннаяРазницаОстаток КАК аНачальныйОстатокПР,
		    |		ДД.ВременнаяРазницаОстаток КАК аНачальныйОстатокВР,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА 0
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |					ИЛИ &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьЗабалансоваяОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
		    |		КОНЕЦ КАК аНачальныйОстатокЗабалансовая,
		    |		0 КАК бПоступилоКоличество,
		    |		0 КАК бПоступилоСтоимость,
		    |		0 КАК бПоступилоПР,
		    |		0 КАК бПоступилоВР,
		    |		0 КАК бПоступилоЗабалансовая,
		    |		0 КАК гРасходНаПроизводствоКоличество,
		    |		0 КАК гРасходНаПроизводствоСтоимость,
		    |		0 КАК гРасходНаПроизводствоПР,
		    |		0 КАК гРасходНаПроизводствоВР,
		    |		0 КАК гРасходНаПроизводствоЗабалансовая,
		    |		0 КАК еКонечныйОстатокКоличество,
		    |		0 КАК еКонечныйОстатокСтоимость,
		    |		0 КАК еКонечныйОстатокПР,
		    |		0 КАК еКонечныйОстатокВР,
		    |		0 КАК еКонечныйОстатокЗабалансовая
		    |	ИЗ
		    |		РегистрНакопления.СебестоимостьТоваров.Остатки(
		    |				{(&НачалоПериода)},
		    |				НЕ &БезОтбораПоПериоду
		    |					И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
		    |					И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		    |						ИЛИ Партия ССЫЛКА Документ.ЗаказНаПроизводство)) КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		    |			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.Партия)
			
			|	ГДЕ (Аналитика.Подразделение, Аналитика.Номенклатура, Аналитика.Характеристика) В (ВЫБРАТЬ РАЗЛИЧНЫЕ З.Подразделение, З.Номенклатура, З.Характеристика ИЗ Затраты КАК З)	
			
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Поступило на незавершенное производство (материалы) для 2.2"",
		    |		КорАналитика.СтатьяКалькуляции.ТипЗатрат,
		    |		""Материальные"",
		    |		ДД.Организация,
		    |		КорАналитика.МестоХранения,
		    |		Аналитика.МестоХранения,
		    |		ДД.Регистратор,
		    |		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, КорАналитика.Назначение.НаправлениеДеятельности),
		    |		КорАналитика.СтатьяКалькуляции,
		    |		ДД.КорАналитикаУчетаНоменклатуры,
		    |		КорАналитика.Номенклатура,
		    |		КорАналитика.Характеристика,
		    |		КорАналитика.Серия,
		    |		КорАналитика.Назначение,
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ДД.КорПартия,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
			
			|		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		    |				ТОГДА - ДД.Количество
		    |			ИНАЧЕ ДД.Количество
		    |		КОНЕЦ,
			
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |					ИНАЧЕ ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазница,
		    |		ДД.ВременнаяРазница,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА 0
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |					ИЛИ &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьЗабалансовая
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьЗабалансоваяРегл
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.СебестоимостьТоваров КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		    |			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
		    |			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.КорПартия)
		    |	ГДЕ
		    |		(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		    |				ИЛИ &БезОтбораПоПериоду)
		    |		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |		И КорАналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
			
			|		И (КорАналитика.МестоХранения, КорАналитика.Номенклатура, КорАналитика.Характеристика) В (ВЫБРАТЬ РАЗЛИЧНЫЕ З.Подразделение, З.Номенклатура, З.Характеристика ИЗ Затраты КАК З)	
			
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Поступило на незавершенное производство (отходы по фиксированной стоимости)"",
		    |		Аналитика.СтатьяКалькуляции.ТипЗатрат,
		    |		""Материальные"",
		    |		ДД.Организация,
		    |		Аналитика.МестоХранения,
		    |		КорАналитика.МестоХранения,
		    |		ДД.Регистратор,
		    |		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, Аналитика.Назначение.НаправлениеДеятельности),
		    |		Аналитика.СтатьяКалькуляции,
		    |		ДД.АналитикаУчетаНоменклатуры,
		    |		Аналитика.Номенклатура,
		    |		Аналитика.Характеристика,
		    |		Аналитика.Серия,
		    |		Аналитика.Назначение,
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ДД.Партия,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
			
			|		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		    |				ТОГДА - ДД.Количество
		    |			ИНАЧЕ ДД.Количество
		    |		КОНЕЦ,
			
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |					ИНАЧЕ ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазница,
		    |		ДД.ВременнаяРазница,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА 0
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |					ИЛИ &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьЗабалансовая
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьЗабалансоваяРегл
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.СебестоимостьТоваров КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		    |			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
		    |			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.Партия)
		    |	ГДЕ
		    |		(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		    |				ИЛИ &БезОтбораПоПериоду)
		    |		И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		    |		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		    |		И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
			
			|		И (Аналитика.МестоХранения, Аналитика.Номенклатура, Аналитика.Характеристика) В (ВЫБРАТЬ РАЗЛИЧНЫЕ З.Подразделение, З.Номенклатура, З.Характеристика ИЗ Затраты КАК З)	
			
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Поступило на незавершенное производство (услуги переработчика) для 2.2"",
		    |		Аналитика.СтатьяКалькуляции.ТипЗатрат,
		    |		""Услуги"",
		    |		ДД.Организация,
		    |		Аналитика.МестоХранения,
		    |		Аналитика.МестоХранения,
		    |		ДД.Регистратор,
		    |		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, Аналитика.Назначение.НаправлениеДеятельности),
		    |		Аналитика.СтатьяКалькуляции,
		    |		ДД.АналитикаУчетаНоменклатуры,
		    |		Аналитика.Номенклатура,
		    |		Аналитика.Характеристика,
		    |		Аналитика.Серия,
		    |		Аналитика.Назначение,
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ДД.Партия,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
			
			|		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		    |				ТОГДА - ДД.Количество
		    |			ИНАЧЕ ДД.Количество
		    |		КОНЕЦ,
			
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |					ИНАЧЕ ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазница,
		    |		ДД.ВременнаяРазница,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА 0
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |					ИЛИ &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьЗабалансовая
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьЗабалансоваяРегл
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.СебестоимостьТоваров КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		    |			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.Партия)
		    |	ГДЕ
		    |		(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		    |				ИЛИ &БезОтбораПоПериоду)
		    |		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		    |		И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		    |		И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
			
			|		И (Аналитика.МестоХранения, Аналитика.Номенклатура, Аналитика.Характеристика) В (ВЫБРАТЬ РАЗЛИЧНЫЕ З.Подразделение, З.Номенклатура, З.Характеристика ИЗ Затраты КАК З)	
			
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Расход из незавершенного производства (материалы) для 2.2"",
		    |		Аналитика.СтатьяКалькуляции.ТипЗатрат,
		    |		""Материальные"",
		    |		ДД.Организация,
		    |		Аналитика.МестоХранения,
		    |		Аналитика.МестоХранения,
		    |		ДД.Регистратор,
		    |		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, Аналитика.Назначение.НаправлениеДеятельности),
		    |		Аналитика.СтатьяКалькуляции,
		    |		ДД.АналитикаУчетаНоменклатуры,
		    |		Аналитика.Номенклатура,
		    |		Аналитика.Характеристика,
		    |		Аналитика.Серия,
		    |		Аналитика.Назначение,
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ДД.КорАналитикаУчетаНоменклатуры,
		    |		АналитикаПродукции.Номенклатура,
		    |		АналитикаПродукции.Характеристика,
		    |		АналитикаПродукции.Серия,
		    |		АналитикаПродукции.Назначение,
		    |		ДД.Партия,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
			
			|		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		    |				ТОГДА - ДД.Количество
		    |			ИНАЧЕ ДД.Количество
		    |		КОНЕЦ,
			
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
		    |					ИНАЧЕ ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазница,
		    |		ДД.ВременнаяРазница,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА 0
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |					ИЛИ &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьЗабалансовая
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьЗабалансоваяРегл
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.СебестоимостьТоваров КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		    |			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
		    |			ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.Партия)
		    |	ГДЕ
		    |		(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		    |				ИЛИ &БезОтбораПоПериоду)
		    |		И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		    |		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			
			|		И (Аналитика.МестоХранения, Аналитика.Номенклатура, Аналитика.Характеристика) В (ВЫБРАТЬ РАЗЛИЧНЫЕ З.Подразделение, З.Номенклатура, З.Характеристика ИЗ Затраты КАК З)	
			
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Конечный остаток (материалы)"",
		    |		Аналитика.СтатьяКалькуляции.ТипЗатрат,
		    |		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные), ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
		    |				ТОГДА ""Материальные""
		    |			ИНАЧЕ ""Услуги""
		    |		КОНЕЦ,
		    |		ДД.Организация,
		    |		Аналитика.МестоХранения,
		    |		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, Аналитика.Назначение.НаправлениеДеятельности),
		    |		Аналитика.СтатьяКалькуляции,
		    |		ДД.АналитикаУчетаНоменклатуры,
		    |		Аналитика.Номенклатура,
		    |		Аналитика.Характеристика,
		    |		Аналитика.Серия,
		    |		Аналитика.Назначение,
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ДД.Партия,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
			
			|		ВЫБОР
		    |			КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		    |				ТОГДА - ДД.КоличествоОстаток
		    |			ИНАЧЕ ДД.КоличествоОстаток
		    |		КОНЕЦ,
			
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
		    |					ИНАЧЕ ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазницаОстаток,
		    |		ДД.ВременнаяРазницаОстаток,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА 0
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |					ИЛИ &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьЗабалансоваяОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
		    |		КОНЕЦ
		    |	ИЗ
		    |		РегистрНакопления.СебестоимостьТоваров.Остатки(
		    |				{(&ОкончаниеПериодаГраница)},
		    |				АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
		    |					И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		    |						ИЛИ Партия ССЫЛКА Документ.ЗаказНаПроизводство)) КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		    |			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.Партия)
			
			|	ГДЕ (Аналитика.МестоХранения, Аналитика.Номенклатура, Аналитика.Характеристика) В (ВЫБРАТЬ РАЗЛИЧНЫЕ З.Подразделение, З.Номенклатура, З.Характеристика ИЗ Затраты КАК З)	
			
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Начальный остаток (постатейные) для 2.2"",
		    |		ДД.СтатьяКалькуляции.ТипЗатрат,
		    |		""Постатейные"",
		    |		ДД.Организация,
		    |		ДД.Подразделение,
		    |		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL 
		    |				ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
		    |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		    |		КОНЕЦ,
		    |		ДД.СтатьяКалькуляции,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ДД.СтатьяРасходов,
		    |		ДД.АналитикаРасходов,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ВЫБОР
		    |			КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |				ТОГДА ДД.ПартияПроизводства
		    |			КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
		    |				ТОГДА ДД.УдалитьПартияПроизводства
		    |			ИНАЧЕ НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.СтоимостьОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДСОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпрОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРеглОстаток
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДСОстаток
		    |					ИНАЧЕ ДД.СтоимостьУпрОстаток
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазницаОстаток,
		    |		ДД.ВременнаяРазницаОстаток,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
		    |				{(&НачалоПериода)}, ЛОЖЬ И
		    |				(ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |					ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
		    |					И НЕ &БезОтбораПоПериоду) КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства)
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Поступило на незавершенное производство (постатейные) для 2.2"",
		    |		ДД.СтатьяКалькуляции.ТипЗатрат,
		    |		""Постатейные"",
		    |		ДД.Организация,
		    |		ДД.Подразделение,
		    |		Реквизиты.Подразделение,
		    |		ДД.Регистратор,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL 
		    |				ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
		    |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		    |		КОНЕЦ,
		    |		ДД.СтатьяКалькуляции,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ДД.СтатьяРасходов,
		    |		ДД.АналитикаРасходов,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ВЫБОР
		    |			КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |				ТОГДА ДД.ПартияПроизводства
		    |			КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
		    |				ТОГДА ДД.УдалитьПартияПроизводства
		    |			ИНАЧЕ НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.Стоимость
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДС
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпр
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРегл
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДС
		    |					ИНАЧЕ ДД.СтоимостьУпр
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазница,
		    |		ДД.ВременнаяРазница,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		    |			ПО ДД.Регистратор = Реквизиты.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства)
		    |	ГДЕ  ЛОЖЬ И
		    |		(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		    |				ИЛИ &БезОтбораПоПериоду)
		    |		И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |				ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
		    |		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Расход из незавершенного производства (постатейные) для 2.2"",
		    |		ДД.СтатьяКалькуляции.ТипЗатрат,
		    |		""Постатейные"",
		    |		ДД.Организация,
		    |		ДД.Подразделение,
		    |		ДД.Подразделение,
		    |		ДД.Регистратор,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL 
		    |				ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
		    |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		    |		КОНЕЦ,
		    |		ДД.СтатьяКалькуляции,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ДД.СтатьяРасходов,
		    |		ДД.АналитикаРасходов,
		    |		ДД.АналитикаУчетаПродукции,
		    |		АналитикаПродукции.Номенклатура,
		    |		АналитикаПродукции.Характеристика,
		    |		АналитикаПродукции.Серия,
		    |		АналитикаПродукции.Назначение,
		    |		ВЫБОР
		    |			КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |				ТОГДА ДД.ПартияПроизводства
		    |			КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
		    |				ТОГДА ДД.УдалитьПартияПроизводства
		    |			ИНАЧЕ НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.Стоимость
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДС
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпр
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРегл
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДС
		    |					ИНАЧЕ ДД.СтоимостьУпр
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазница,
		    |		ДД.ВременнаяРазница,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
		    |			ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства)
		    |	ГДЕ ЛОЖЬ И
		    |		(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		    |				ИЛИ &БезОтбораПоПериоду)
		    |		И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |				ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
		    |		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	
		    |	ОБЪЕДИНИТЬ ВСЕ
		    |	
		    |	ВЫБРАТЬ
		    |		""Производство"",
		    |		""Конечный остаток (постатейные) для 2.2"",
		    |		ДД.СтатьяКалькуляции.ТипЗатрат,
		    |		""Постатейные"",
		    |		ДД.Организация,
		    |		ДД.Подразделение,
		    |		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL 
		    |				ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
		    |			КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
		    |				ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
		    |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		    |		КОНЕЦ,
		    |		ДД.СтатьяКалькуляции,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка),
		    |		ДД.СтатьяРасходов,
		    |		ДД.АналитикаРасходов,
		    |		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		    |		НЕОПРЕДЕЛЕНО,
		    |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		    |		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
		    |		ВЫБОР
		    |			КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |				ТОГДА ДД.ПартияПроизводства
		    |			КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
		    |				ТОГДА ДД.УдалитьПартияПроизводства
		    |			ИНАЧЕ НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		ВЫБОР
		    |			КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL 
		    |					И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
		    |				ТОГДА СпрПартииПроизводства.Документ
		    |			КОГДА ИСТИНА
		    |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
		    |			КОГДА ИСТИНА
		    |				ТОГДА НЕОПРЕДЕЛЕНО
		    |		КОНЕЦ,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		0,
		    |		ВЫБОР
		    |			КОГДА &ДанныеПоСебестоимости = 1
		    |				ТОГДА ДД.СтоимостьОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 2
		    |				ТОГДА ДД.СтоимостьБезНДСОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 3
		    |				ТОГДА ДД.СтоимостьУпрОстаток
		    |			КОГДА &ДанныеПоСебестоимости = 4
		    |				ТОГДА ДД.СтоимостьРеглОстаток
		    |			ИНАЧЕ ВЫБОР
		    |					КОГДА &ПоПредприятию
		    |						ТОГДА ДД.СтоимостьБезНДСОстаток
		    |					ИНАЧЕ ДД.СтоимостьУпрОстаток
		    |				КОНЕЦ
		    |		КОНЕЦ,
		    |		ДД.ПостояннаяРазницаОстаток,
		    |		ДД.ВременнаяРазницаОстаток,
		    |		0
		    |	ИЗ
		    |		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
		    |				{(&ОкончаниеПериодаГраница)}, ЛОЖЬ И
		    |				(ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		    |					ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)) КАК ДД
		    |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		    |			ПО (СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства)) КАК ДД
		    |
		    |СГРУППИРОВАТЬ ПО
			//|	ДД.Таблица,
			//|	ДД.Содержание,
			//|	ДД.ТипЗатрат,
			//|	ДД.ВидЗатрат,
		    |	ДД.Организация,
		    |	ДД.Подразделение,
			//|	ДД.ПодразделениеОтправитель,
			//|	ДД.Регистратор,
			//|	ДД.НаправлениеДеятельности,
			//|	ДД.СтатьяКалькуляции,
			//|	ДД.АналитикаУчетаНоменклатуры,
		    |	ДД.Номенклатура,
		    |	ДД.Характеристика,
			//|	ДД.Серия,
			//|	ДД.Назначение,
			//|	ДД.ВидРабот,
			//|	ДД.СтатьяРасходов,
			//|	ДД.АналитикаРасходов,
			//|	ДД.АналитикаУчетаПродукции,
			//|	ДД.Продукция,
			//|	ДД.ХарактеристикаПродукции,
			//|	ДД.СерияПродукции,
			//|	ДД.НазначениеПродукции,
			//|	ДД.ПартияПроизводства,
		    |	ДД.ЗаказНаПроизводство
			|;
			|/////////////////////////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Организация КАК Организация,
			|	Затраты.Ссылка КАК Ссылка,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияПредставление,
			|	Затраты.Подразделение КАК Подразделение,
			|	Затраты.Подразделение.Представление КАК ПодразделениеПредставление,
			|	Затраты.Номенклатура КАК Номенклатура,
			|	Затраты.Характеристика КАК Характеристика,
			|	Затраты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Затраты.Номенклатура.Представление КАК НоменклатураПредставление,
			|	Затраты.Характеристика.Представление КАК ХарактеристикаПредставление,
			|	Затраты.Номенклатура.Код КАК НоменклатураКод,
			|	Затраты.Номенклатура.Артикул КАК НоменклатураАртикул,
			|	Затраты.ВходящийОстаток КАК ВходящийОстаток,
			|	Затраты.Наличие КАК Наличие,
			|	Затраты.Распределить КАК Распределить,
			|	Затраты.Распределено КАК Распределено,
			|	Затраты.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Затраты КАК Затраты
			|ГДЕ
			|	НЕ Затраты.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки
			|ИТОГИ
			|	МАКСИМУМ(ОрганизацияПредставление),
			|	МАКСИМУМ(ПодразделениеПредставление)
			|ПО
			|	Подразделение";
		
	Иначе
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РаспределениеПроизводственныхЗатрат.ПФ_MXL_АктИнвентаризацииМатериаловИПолуфабрикатов");
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(Затраты.Подразделение КАК Справочник.СтруктураПредприятия) КАК Подразделение,
			|	ВЫРАЗИТЬ(Затраты.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(Затраты.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
			|	Затраты.ВОбработке + Затраты.ФактОстаток КАК УчетОстаток,
			|	Затраты.ФактОстаток КАК ФактОстатокВЗапасе,
			|	Затраты.НеРаспределено КАК ФактОстатокНЗП,
			|	Затраты.КРаспределению КАК КРаспределению,
			|	Затраты.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ Затраты
			|ИЗ
			|	&Затраты КАК Затраты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Организация КАК Организация,
			|	ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияПредставление,
			|	Затраты.Подразделение КАК Подразделение,
			|	Затраты.Подразделение.Представление КАК ПодразделениеПредставление,
			|	Затраты.Номенклатура КАК Номенклатура,
			|	Затраты.Характеристика КАК Характеристика,
			|	Затраты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Затраты.Номенклатура.Представление КАК НоменклатураПредставление,
			|	Затраты.Характеристика.Представление КАК ХарактеристикаПредставление,
			|	Затраты.Номенклатура.Код КАК НоменклатураКод,
			|	Затраты.Номенклатура.Артикул КАК НоменклатураАртикул,
			|	Затраты.УчетОстаток КАК УчетОстаток,
			|	Затраты.ФактОстатокВЗапасе КАК ФактОстатокВЗапасе,
			|	Затраты.ФактОстатокНЗП КАК ФактОстатокНЗП,
			|	Затраты.ФактОстатокВЗапасе + Затраты.ФактОстатокНЗП КАК ФактОстатокВсего,
			|	Затраты.КРаспределению КАК КРаспределению,
			|	Затраты.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Затраты КАК Затраты
			|ГДЕ
			|	НЕ Затраты.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки
			|ИТОГИ
			|	МАКСИМУМ(ОрганизацияПредставление),
			|	МАКСИМУМ(ПодразделениеПредставление)
			|ПО
			|	Подразделение";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));	

	ТаблицаЗатраты = ПараметрыПечати.Затраты.Выгрузить(ПараметрыОтбора);
	ТаблицаЗатраты.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	НомерСтроки = 1;
	Для каждого ДанныеСтроки Из ТаблицаЗатраты Цикл
		ДанныеСтроки.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Затраты", ТаблицаЗатраты);
	Запрос.УстановитьПараметр("Организация", ПараметрыПечати.Организация);
	// begin fix Suetin 23.12.2019 13:12:25
	Запрос.УстановитьПараметр("НачалоПериода"			, НачалоМесяца(ПараметрыПечати.Период));  
	Запрос.УстановитьПараметр("ОкончаниеПериода"		, КонецМесяца(ПараметрыПечати.Период)); 
	Запрос.УстановитьПараметр("ОкончаниеПериодаГраница"	, Новый Граница(КонецМесяца(ПараметрыПечати.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("БезОтбораПоПериоду"		, Ложь);   
	Запрос.УстановитьПараметр("ПоПредприятию"			, Истина);  
	Запрос.УстановитьПараметр("ДанныеПоСебестоимости"	, 2);
	// end fix Suetin 23.12.2019 13:12:32
	Результат 						= Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	РезультатЗаказовПоСсылкеПустой 	= Результат[3].Пустой();
	ВыборкаПоПодразделению 			= Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Не РезультатЗаказовПоСсылкеПустой Тогда
		ВыборкаЗаказов				= Результат[3].Выбрать();
	Иначе
		ВыборкаЗаказов				= Результат[4].Выбрать();
	КонецЕсли; 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктИнвентаризацииМатериаловИПолуфабрикатов";
	
  	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы" + ?(ВыводитьКоды, "_Код", ""));
	ОбластьМакета = Макет.ПолучитьОбласть("Строка" + ?(ВыводитьКоды, "_Код", ""));
	ОбластьМакетаДокумент = Макет.ПолучитьОбласть("Строка" + ?(ВыводитьКоды, "_Код_Документ", "_Документ"));       // fix Suetin 20.12.2019 16:57:21
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("Подвал");
	
	Если ВыводитьКоды Тогда
		ОбластьШапкаТаблицы.Параметры.ИмяКолонкиКодов = КолонкаКодов;
	КонецЕсли; 
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоПодразделению.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ПараметрыЗаголовка = Новый Структура("ОрганизацияПредставление,ПодразделениеПредставление");
		ЗаполнитьЗначенияСвойств(ПараметрыЗаголовка, ВыборкаПоПодразделению);
		ПараметрыЗаголовка.Вставить("ДатаДокумента", Формат(КонецМесяца(ПараметрыПечати.Период), "ДЛФ=D"));
		
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		СсылкаОбластьПечати = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Акт инвентаризации в подразделении %1';
										|en = 'Stocktaking report in department %1'"),
									ВыборкаПоПодразделению.ПодразделениеПредставление);
								
		НомерСтраницы = 1;
		НомерСтроки = 0;
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		ДанныеПечати = ВыборкаПоПодразделению.Выбрать();
		Пока ДанныеПечати.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			
			Если НомерСтроки = 1 Тогда
				
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				
			Иначе
			
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьМакета);
				// begin fix Suetin 20.12.2019 16:39:41
				СтруктураПоиска = Новый Структура();
				Если Не РезультатЗаказовПоСсылкеПустой Тогда
					СтруктураПоиска.Вставить("Ссылка", ДанныеПечати.Ссылка);
				Иначе
				    СтруктураПоиска.Вставить("Подразделение"	, ДанныеПечати.Подразделение);
					СтруктураПоиска.Вставить("Номенклатура"		, ДанныеПечати.Номенклатура);
					СтруктураПоиска.Вставить("Характеристика"	, ДанныеПечати.Характеристика);
				КонецЕсли; 
				ВыборкаЗаказов.Сбросить();
				Пока ВыборкаЗаказов.НайтиСледующий(СтруктураПоиска) Цикл
					ОбластьМакетаДокумент = Макет.ПолучитьОбласть("Строка" + ?(ВыводитьКоды, "_Код_Документ", "_Документ"));       // fix Suetin 20.12.2019 16:57:21
					ОбластьМакетаДокумент.Параметры.Заполнить(ВыборкаЗаказов);
					МассивВыводимыхОбластей.Добавить(ОбластьМакетаДокумент);
				КонецЦикла; 
				// end fix Suetin 20.12.2019 16:39:48
				Если НомерСтроки <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Используем структуру для заполнения параметров, т.к. макет может изменяться пользователем.
			ДополнительныеПараметрыОбластьМакета = Новый Структура;
			ДополнительныеПараметрыОбластьМакета.Вставить("НомерСтроки", НомерСтроки);
			Если ВыводитьКоды Тогда
				ДополнительныеПараметрыОбластьМакета.Вставить("Артикул", ДанныеПечати["Номенклатура" + КолонкаКодов]);
			КонецЕсли;
			
			НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
										ДанныеПечати.НоменклатураПредставление, 
										ДанныеПечати.ХарактеристикаПредставление);
											
			ДополнительныеПараметрыОбластьМакета.Вставить("НоменклатураПредставление", НоменклатураПредставление);
			ОбластьМакета.Параметры.Заполнить(ДополнительныеПараметрыОбластьМакета);
			// begin fix Suetin 20.12.2019 17:05:19
			//ТабличныйДокумент.Вывести(ОбластьМакета);
			Для каждого ЭлементОбластьМакета Из МассивВыводимыхОбластей Цикл
				ТабличныйДокумент.Вывести(ЭлементОбластьМакета);
			КонецЦикла; 
			// end fix Suetin 20.12.2019 17:05:23		
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаОбластьПечати);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
