//begin fix Клещ А.Н. 16.10.2019  
&После("ОбработкаПроведения")
Процедура ВИЛС_ОбработкаПроведения(Отказ, РежимПроведения)
	Если РольДоступна("ПолныеПрава") Тогда Возврат; КонецЕсли;
	СтруктураПараметров = ИнтеграцияС1СДокументооборотПереопределяемый.ВИЛС_ВернутьСтатусДокумента(ЭтотОбъект.Ссылка);
	
	Если не ((не СтруктураПараметров =Неопределено) и СтруктураПараметров.Свойство("ЕстьФайлы") и СтруктураПараметров.ЕстьФайлы) Тогда
		Отказ = Истина;
	КонецЕсли;

	Если Отказ Тогда 
		Сообщить("Отсутствуют прикрепленные файлы.");
	КонецЕсли;
КонецПроцедуры

//end fix Клещ А.Н. 16.10.2019

//begin fix Клещ А.Н. 18.10.2019  
&После("ПередЗаписью")
Процедура ВИЛС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РольДоступна("ПолныеПрава") Тогда Возврат; КонецЕсли;
	КонтрольнаяДата = ВИЛС_Служебный.ДатаПоКоличествуРабочихДней(Дата,2);
	
	Если (не Проведен) и (не НачалоДня(КонтрольнаяДата) >= НачалоДня(ТекущаяДата())) и  РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
		Сообщить("Измените дату документа.");
	КонецЕсли;
КонецПроцедуры
//end fix Клещ А.Н. 18.10.2019
