//begin fix Клещ А.Н. 16.10.2019  
&После("ОбработкаПроведения")
Процедура ВИЛС_ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураПараметров = ИнтеграцияС1СДокументооборотПереопределяемый.ВИЛС_ВернутьСтатусДокумента(ЭтотОбъект.Ссылка);
	Отказ = Истина;
	Если (не СтруктураПараметров =Неопределено) и СтруктураПараметров.Свойство("ЕстьФайлы") и СтруктураПараметров.ЕстьФайлы Тогда
		Отказ = Ложь;
	КонецЕсли;
	
	Если Отказ Тогда 
		Сообщить("Отсутствуют прикрепленные файлы.");
	КонецЕсли;
	
КонецПроцедуры
//end fix Клещ А.Н. 16.10.2019