// begin fix Suetin 20.02.2019 18:45:45
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Объект.ПоРаспоряжениям и ЗначениеЗаполнено(Объект.Распоряжение) и ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЭтапПроизводства2_2")
		и ЗначениеЗаполнено(Объект.Распоряжение.Распоряжение.ДокументОснование)
		Тогда
		Если ТипЗнч(Объект.Распоряжение.Распоряжение.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Возврат;
		ИначеЕсли  ТипЗнч(Объект.Распоряжение.Распоряжение.ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца")Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ЗаказКлиента", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево); 													 
	ДобавляемыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода; 
   	ДобавляемыйЭлемент.ПутьКДанным 			= "Объект.ВИЛС_ЗаказКлиента";
	ДобавляемыйЭлемент.Заголовок 			= "Заказ клиента";
КонецПроцедуры
// end fix Suetin 20.02.2019 18:45:49