
&НаСервере
Процедура ВИЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Элементы.Найти("ВИЛС_ЗаказКлиента") = Неопределено Тогда
		ДобавляемыйЭлемент = Элементы.Вставить("ВИЛС_ЗаказКлиента", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво); 													 
		ДобавляемыйЭлемент.Вид 								= ВидПоляФормы.ПолеВвода; 
		ДобавляемыйЭлемент.ПутьКДанным 						= "Объект.ВИЛС_ЗаказКлиента";
		ЗаполнитьЗначенияСвойств(ДобавляемыйЭлемент, Элементы.ГруппаШапкаЛево.ПодчиненныеЭлементы.Получатель,, "ВыделенныйТекст,Заголовок,ОграничениеТипа,ПараметрыВыбора,Подсказка,ПодсказкаВвода,ПутьКДанным,ПутьКДаннымПодвала,РасширеннаяПодсказка,СвязиПараметровВыбора,СвязьПоТипу,СочетаниеКлавиш,СписокВыбора");
		ДобавляемыйЭлемент.КнопкаВыбора                     = Истина;
		ДобавляемыйЭлемент.КнопкаВыпадающегоСписка 			= Ложь;
		ДобавляемыйЭлемент.Заголовок 						= "Заказ клиента";
	КонецЕсли;
КонецПроцедуры
