
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ВИЛС_ОбработкаОповещенияЗаписиНовогоЭлементаСправочникаНаправленияДеятельности(ИмяСобытия, Параметр, Источник) Экспорт
	Если ИмяСобытия="Справочник.НаправленияДеятельности.ОбработкаЗаписиНового" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В справочнике Статьи расходов необходимо внести изменения
			|в Правила распределения между направлениями деятельности.'"),, Параметр);//НСтр("ru = 'Справочник Направления деятельности'"));
	КонецЕсли;
КонецПроцедуры // ВИЛС_ОбработкаОповещенияЗаписиНовогоЭлементаСправочникаНаправленияДеятельности()

&Вместо("ВыполнитьПереопределяемуюКоманду")
Процедура ВИЛС_ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры)
	Если Форма.ИмяФормы = "Документ.СверкаВзаиморасчетов.Форма.ФормаДокумента" Тогда
		Если ТипЗнч(Команда) = Тип("ПолеФормы") 
			и Команда.Имя = "ВИЛС_ДетальныеЗаписиРасчетыРасчетныйДокумент" Тогда
		    ТекущиеДанные = Форма.Элементы.ДетальныеЗаписиРасчеты.ТекущиеДанные;
			ТекущиеДанные.РасчетныйДокумент = ТекущиеДанные.ВИЛС_РасчетныйДокумент;
		КонецЕсли; 	
	КонецЕсли;
КонецПроцедуры
