
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ВИЛС_ОбработкаОповещенияЗаписиНовогоЭлементаСправочникаНаправленияДеятельности(ИмяСобытия, Параметр, Источник) Экспорт
	Если ИмяСобытия="Справочник.НаправленияДеятельности.ОбработкаЗаписиНового" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В справочнике Статьи расходов необходимо внести изменения
			|в Правила распределения между направлениями деятельности.'"),, Параметр);//НСтр("ru = 'Справочник Направления деятельности'"));
	КонецЕсли;
КонецПроцедуры // ВИЛС_ОбработкаОповещенияЗаписиНовогоЭлементаСправочникаНаправленияДеятельности()
