
&После("ОбработкаПроведения")
Процедура ВИЛС_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ВИЛС_Служебный.ИспользуютсяОсобыеУсловияТруда(Организация) Тогда
		РегистрыСведений.ВИЛС_ДанныеУсловийТрудаПоСотрудникам.ИзменитьЗаписиПоРегистратору(ЭтотОбъект.Ссылка,Истина);
	КонецЕсли;
	// begin fix Suetin 12.05.2020 13:42:36
	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		РегистрыСведений.БухучетЗарплатыСотрудников.ВИЛС_ИзменитьЗаписиПоРегистратору(ЭтотОбъект.Ссылка);
	КонецЕсли; 
	// end fix Suetin 12.05.2020 13:42:47
КонецПроцедуры

&После("ПередЗаписью")
Процедура ВИЛС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		Если ВИЛС_Служебный.ИспользуютсяОсобыеУсловияТруда(Организация) Тогда
		РегистрыСведений.ВИЛС_ДанныеУсловийТрудаПоСотрудникам.ИзменитьЗаписиПоРегистратору(ЭтотОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры
