&Вместо("ОпределитьСоответствиеПолейФайла")
// Позволяет переопределить соответствие между полями файла и полями выгружаемой коллекции.
//
// Параметры:
//		СоответствиеПолей - Соответствие - Соответствие полей документа и файла:
//			Ключ - название поля в файле;
//			Значение - название поля в документе.
//		ВидОперации - Строка - Вид операции обмена с банками, для которого получается соответствие полей.
//		ФорматФайла - ПеречислениеСсылка.ФорматыФайловОбменаПоЗарплатномуПроекту - Версия формата файла обмена.
//
Процедура ВИЛС_ОпределитьСоответствиеПолейФайла(СоответствиеПолей, ВидОперации, ФорматФайла = Неопределено) Экспорт
	
	 Если не СоответствиеПолей.Получить("НомерРеестра") = Неопределено Тогда
		  СоответствиеПолей.Удалить("НомерРеестра");
	 КонецЕсли;
	  	
КонецПроцедуры
